{
    "name": "Lust Rune",
    "CardType": "Addition",
    "Description": "Strange pink runes have been scattered around the area. How they got there is unknown, but they're still something to be cautious of.",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Elf",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene": [  "While walking through the forest, an intricate pink rune suddenly appears beneath you! It also overwrote the old scene! How could it!",
                                      "Menu",
                                        "Try to dodge!",
                                        "Try to use your magical powers to destroy the rune!",
                                        "See what happens.",
                                        "A New Scene!",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "EventStart",
                        "theScene": [ "MenuAddition", 
                                      "A New Scene!",
                                      "RequiresPerk", "Energy Drainer",
                                      "A New Scene!",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "A New Scene!",
                        "theScene": [  "The world explodes. But it got better. Also note that you CAN add new speakers. and if overriding an existing scene, make sure the name is the exact same."
                                  ]
                    }



                ]
}
/*
{
  "name": "Go to your room.",
  "CardType": "Addition",
  "CardLimit": "0",
  "Description": "",
  "requires": [ ""],
  "Speakers": [
                {
                  "name": "Clara",
                  "postName": "",
                  "SpeakerType": "Monster"
                }
              ],
  "EventText": [
                  {
                      "NameOfScene": "Enter",
                      "theScene": [
                                    "You head upstairs and enter into your cozy, sparsely decorated room.",
                                    "IfHasItem", "Clara's Milk",
                                      "ClaraCheck",
                                    "JumpToScene", "RoomMenu"
                                ]
                  },
                  {
                      "NameOfScene": "ClaraCheck",
                      "theScene": [
                                    "IfChoice", "9", "ClaraIsStaying",
                                      "RoomMenu",
                                    "JumpToScene", "ClaraTown"
                                ]
                  },
                  {
                      "NameOfScene": "ClaraTown",
                      "theScene": [
                        "As you return to your room after a long day of adventuring, your superhuman hero senses tingle at the approach of... absolutely nothing? Huh. You could have sworn you detected the scent of bad ideas and regret wafting through the hallway. Shaking it off, you go to open the door of your room, and are impacted by the average feather in the process.",
                        "When you finally look down you realize you have a new growth protruding from your leg - oh nevermind it's just Clara.",
                        "PlayerSpeaks",
                        "...Wait, what?",
                        "DisplayCharacters",
                          "Clara",
                        "EndLoop",
                        "The pint-sized cowgirl looks up at you with emerald eyes dancing in joy and relief, regarding you as a sight for sore eyes, and hugs extra tight for good measure.",
                        "Speaks",
                        "O-oh thank goodness, I was worried I wouldn't find you!",
                        "You notice a small puddle of belongings behind her and have a bad feeling about this, but hey, when has anything involving Clara ever gone poorly?",
                        "Speaks",
                        "I- a storm hit the mountain last night, and it blew away my tent, and - and - I still can't find my sister, and I don't have anywhere to stay, and you were the only person nice to me, and I don't know what to DO, andandandand-",
                        "Her bright green eyes mist over as the small girl looks like she's about to cry, digging her face into your stomach as she resists the desire. It... sounds like she had a pretty rough night, and people are starting to give the two of you weird looks for some reason. Vaguely aware that you'll probably regret this, you let her into your room for the time being, trying not to think too hard about how that probably looks to observers.",
                        "Clara calms down after a bit of headpatting and a good cry, wiping off her face as she returns to the cool and collect... well, it's hard to call her collected or reliable in the least, but at least she's back to being normal Clara..",
                        "Speaks",
                        "T-thank you, {ThePlayerName}. You - you've helped me so much already, I-I'm sorry to bother you again, I just - I didn't know where else to go, I d-don't know anyone else, a-and - and my sister is still-",
                        "She trails off, sniffling as she tried to reign in her emotions with limited success, but raises her head back to you with a fire in her eyes that betrays her quivering lower lip.",
                        "Speaks",
                        "P-please let me stay with you! Just for a little while! I- I'll pay you back, I promise, but I don't have anywhere left to go, and, and, big sis said that I had to be 'independent' and stuff s-so I have to find her instead of just waiting for her to come back, but, I'm n-not really good with people, but I won't be a burden either. I'll even sleep on the floor if you want, I still have my blanket!",
                        "...Goddess dammit, it wouldn't be very heroic to kick a homeless little girl onto the street, would it? At least she's not a damn succubus. ...Would having a succubus housewife be that bad? Hmm. Food for thought.",
                        "SwapLineIf",
                          "Item",
                          "Symbol of Bonds",
                          "Trisha leaps to mind for a moment, her soft lips wrapped around your cock as you feast on her cooking, looking up at you both impishly and fondly as pleasure and warmth alike flow through you.",
                          "",
                          "Haha, crazy talk. Where you would find a succubus housewife slash cooking goddess?",
                        "EndLoop",
                        "As a hero you can't rightly refuse to let her stick around for at least a night; you resolve to decide what to do with her for real later on.",
                        "Clara beams through misty eyes, jumping up to hug you and give you a tender kiss on the cheek before retreating to her pile of sundries. Which turns out to be a pretty ratty blanket and... not much else. Some unfitting clothes, stolen or acquired from people definitely not her size, and a few smaller items you don't immediately recognize.",
                        "Speaks",
                        "Thank you so much, {ThePlayerName}! You won't regret it, I promise, I'll pay you back for sure!",
                        "You have your doubts as to whether or not that assorted junk is legal tender, but at least you managed to make a little girl very happy today, and even if it's not on par with saving the world from evil - it still FEELS pretty damn heroic. ...More so than most of the day to day orgiastic fuckfests of the island, anyways. Dammit that kinda killed the mood.",
                        "SetChoice", "9", "ClaraIsStaying",
                        "SetChoice", "8", "Haven't slept together",
                        "JumpToScene", "RoomMenu"
                                ]
                  },
                  {
                      "NameOfScene": "RoomMenu",
                      "theScene": [ "SetChoice", "1", "",
                                   "SwapLineIf", "Choice", "8", "Haven't slept together",
                                   "Clara was acting a little weird when you got home, but it ultimately didn't come to anything, and she swears up and down nothing is wrong.",
                                   "8", "", "",
                                   "EndLoop",
                                    "Menu",
                                      "Rest. (Advances Time 1)",
                                      "Sleep till morning.",
                                      "RequiresChoice", "9", "ClaraIsStaying", "Sleep with Clara (Wholesome)",
                                      "Leave",
                                    "EndLoop"
                                ]
                  },
                  {
                      "NameOfScene": "Sleep with Clara (Wholesome)",
                      "theScene": ["Clara has been acting kind of strange ever since you got back from adventuring earlier in the evening, but has been pretty quiet; it's not until you're about to crash that she approaches you, hands balled into fists as she tries her best to look brave and fails utterly at it.",
                      "Speaks",
                      "Can- can I sleep with you tonight? Please, I-I'll be quiet, I - I had a bad dream last night, and I d-don't want to be alone tonight, too...",
                      "...You're pretty sure Clara isn't even capable of falsehood, and she looks pretty damn torn up, so despite your better judgment you cave and let her in. It's either a testament to her emotional condition that she only manages a small nod rather than effusive thanks, and true to her word she curls up into a little ball on her side of the bed and lies as still as the grave.",
                      "It's a little awkward, to be honest, but aside from the dim warmth of her distant body it isn't anything too weird so you still manage to fall asleep pretty quick; you may not literally be fighting for your life on this island, but the kind of battles that happen here are no less taxing.",
                      "...",
                      "RestPlayer",
                      "You awaken later in the night to a quiet mewling, something akin to tortured animal, and even through the haze of sleep realize pretty quickly that it's coming from the other side of your bed - it's hard to see much in the dusky gloom of night, but calling out quietly to Clara doesn't get much of a response nor lessen the sounds, her tiny shoulders trembling lightly as she lies wracked in her dreams.",
                      "Feeling a little bad, you pull her in closer, feeling the tenseness in her muscles the instant you touch her, and sweep her into a hug.",
                      "She stiffens initially, but goes to pieces almost immediately, murmuring a name you don't recognize between sobs as she trembles in your grasp. The sleeping cowgirl bawls into your chest for some time, letting out all of the stress and loneliness that have built up.",
                      "Eventually her breathing slows to a more consistent tempo as she either goes back to sleep or returns to deeper sleep, her arms wrapped tightly around you as she calms down; reveling in your warmth as her own warmth suffuses you, her body temperature just as warm as she is soft.",
                      "RestPlayer",
                      "Despite the discomfiture of your awakening, it's comfy enough that you find yourself drifting off to sleep surprisingly fast, and there are no further interruptions. You awaken to the golden light of morning with Clara still asleep in your arms, though her deathgrip has loosened enough that you can extract yourself fairly easily to get moving with your day.",
                      "SetChoice", "8", "",
                      "JumpToScene",
                      "RoomMenu"
                                ]
                  },

            {
                "NameOfScene": "EventBroke",
                "theScene": [ "aaaaa event broked."
                          ]
            }
          ]
}
*/
