{
    "name": "Metallic Ruins",
    "CardType": "",
    "CardLimit": "0",
    "Description": "",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Galla",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }

                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene": [  "{SetTextColor}#F6BADC{Done}blank{ColorEnd} but it was {UseSetColor}pink{ColorEnd}, now it is {SetTextColor}#62a12f{Done}purple.{ColorEnd} I said {SetTextColor}#c21196{Done}purple.{ColorEnd}"

                                  ]
                    },
                    {
                      "NameOfScene": "UseWomb",
                      "theScene": [  
                                    "ChangeArousalQuietly","20",
                                    "You pick up the device from your inventory and unzip your pants, freeing your erect dick as you hold it firmly by the end, alligning yourself with the entrance of the Automaton's artificial pussy, before squeezing it into her tight slit.",
                                    "ChangeArousalQuietly","70",  
                                    "You give yourself some time to adjust to the texture, when suddenly the machine flashes brightly as it seemingly comes to life and starts lowly vibrating!",
                                    "ChangeArousalQuietly","120",             
                                    "You slip out a moan from the unexpected sensations, as you quickly get a hold of yourself and tightly grip the machine. You start pumping your dick with firm slow strokes, testing the device's limits, and eventually end up hitting a squishy, rubbery wall.",
                                    "PlayerOrgasmNoSpiritLoss", 
                                    "After confirming how far you can go, you pick up the pace as you proceed to rigourously pump your length, until with a few final pumps, you reach climax, moaning loudly as you unload your cum into the orrifice while your legs tremble from your self induced orgasm. The machine stops whirrling in your hand as you come down from your high and pull out your dick with a content smile, fully satisfied with the device's performance, before pulling up your pants and properly disposing of it."

                                ]
                    }



                ]
}
