{
    "name": "Automaton Defeated",
    "CardType": "",
    "CardLimit": "0",
    "Description": "",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Automaton",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene": [  "DisplayCharacters",
                                      "1",
                                      "EndLoop",
                                      "Menu",
                                        "Fuck her pussy!",
                                        "Fuck her ass!",
                                        "Put her mouth to better use.",
                                        "Leave.",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "SexStart",
                        "theScene": [  "DisplayCharacters",
                                      "1",
                                      "EndLoop",
                                      "Her still trembling pussy lightly squeezes your throbbing shaft as you consider what to do next...",
                                      "Menu",
                                        "Keep fucking her pussy!",
                                        "Fuck her ass instead!",
                                        "Pull out of her pussy and put her mouth to better use.",
                                        "Pull out and leave.",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "AnalStart",
                        "theScene": [  "DisplayCharacters",
                                      "1",
                                      "EndLoop",
                                      "Her toned rear lightly squeezes your throbbing shaft as you consider what to do next...",
                                      "Menu",
                                        "Keep fucking her ass!",
                                        "Fuck her pussy instead!",
                                        "Pull out of her ass and put her mouth to better use.",
                                        "Pull out and leave. ",
                                      "EndLoop"
                                  ]
                    },




                    {
                        "NameOfScene": "Fuck her pussy!",
                        "theScene": [ 
                                      "The kunoichi nervously looks at you as you approach her with your throbbing manhood, and she desperately tries to fiercely stare at you as you pull her unresisting legs apart, revealing her dripping sex to you.",
                                        "Speaks",
                                        "I-I already t-told you that I won't be defeated by-",
                                        "ChangeArousalQuietly",
                                        "20",
                                    
                                        "You cut her words off as you easily penetrate her tight pussy, forcing her to stifle a slutty moan as hilt yourself within her welcoming body.",
                                        "ChangeArousalQuietly",
                                        "30",
                                        "Her voice only gets louder and louder despite her efforts to restrain herself as you slowly increase your pace, and shivers of pleasure race up your spine as she unconsciously squeezes your shaft in time with your thrusts.",
                                        "JumpToScene",
                                        "SexScene"
                                  ]
                    },
                    {
                        "NameOfScene": "Keep fucking her pussy!",
                        "theScene": [   
                                        "ChangeArousalQuietly",
                                        "20",
                                        "The kunoichi lets out a yelp of pleasure as you begin to thrust into her tight pussy once more, and she desperately tries to stifle her slutty moans while she fiercely stares up at you.",
                                        "Speaks",
                                        "I-I already, nnmmm!♥ T-told you that I won't be defeated by you!",
                                        "ChangeArousalQuietly", "30",
                                 

                                        "Contrary her defiant words, her gasping breaths and her dripping sex indicate that she's clearly feeling your movements as you begin to increase your pace, and shivers of pleasure race up your spine as she unconsciously squeezes your shaft in time with your thrusts.",
                                        "JumpToScene",
                                        "SexScene"
                                  ]
                    },
                    {
                        "NameOfScene": "Fuck her pussy instead!",
                        "theScene": [ 
                                      "ChangeArousalQuietly",
                                        "10",
                                        "The kunoichi powerfully shudders with pleasure as you pull out of her tight rear while it almost seems to desperately cling to your shaft, and she stares up at you with defiance even as the faintest hint of lust clouds her expression.",
                                        "Speaks",
                                        "H-Haha... I knew you couldn't handl-!",
                                        "ChangeArousalQuietly",
                                        "15",
                                        "You cut off her words as you suddenly hilt yourself inside her dripping sex, forcing a slutty moan from her lips as she trembles underneath you.",
                               
                                        "Speaks",
                                        "EEEK!♥ Ghhh! I-I already told you that I w-won't be defeated by you! J-Just give up already!",
                                        "ChangeArousalQuietly",
                                        "25",
                                        "She desperately tries to stifle her voice as you slowly increase your pace, but her muffled noises of pleasure only spur you to move faster as you revel in the sensations of her welcoming sex while it unconsciously squeezes your shaft in time with your thrusts.",
                                        "JumpToScene",
                                        "SexScene"
                                  ]
                    },
                    {
                        "NameOfScene": "SexScene",
                        "theScene": [  "ChangeArousalQuietly",
                                      "25",
                            
                                      "You grab ahold of her legs and push them past her head as you begin to really fuck her in earnest, making her flush deeply from embarrassment as she trembles in ecstasy.",
                                      "ChangeArousalQuietly",
                                      "25",
                                      "Her pussy powerfully clamps down on your cock as you push into her eager depths and greedily tries to suck you back in as you pull out, sending shivers of delight racing through your groin as she futilely attempts to stifle her moans of pleasure with her hands.",
                                      "ChangeArousalQuietly",
                                      "35",
                                      "As you build up to a good tempo, you manage to completely pin the kunoichi down, pressing your weight onto her as you continue to fuck her tight pussy.",
                                      "ChangeArousalQuietly",
                                      "25",
                         
                                      "She refuses to look at you as she begins to entirely quiet her voice with a look of defiance, and you take a moment to abruptly slam your hips into hers while snaking a hand up to her wrists, forcing her to let out a moan and lose focus for long enough to let you pull her arms away from her face.",
                                      "ChangeArousalQuietly",
                                      "25",
                                      "Now unable to hold back her voice, she lets out gasping noises of pleasure with every movement you make, and after a brief moment of attempting to struggle out of your grip, she finally shoots you a rebellious look as she flashes you a cunning grin.",
                                      "Speaks",
                                      "I-I'm not out of this fight just yet!",
                                      "ChangeArousalQuietly",
                                      "50",
              
                                      "You shudder in pleasure as her pussy possessively squeezes and churns around your cock, eagerly trying to milk your shaft dry and eliciting a moan from you as her grin becomes more cocky.",
                                      "ChangeArousalQuietly",
                                      "50",
                
                                      "She opens her mouth to say something, only to let out a surprised yelp of pleasure as you let go of her legs and wrap your arms around her back to pull her into a powerful hug while thrusting into her harder and faster than ever before, and she's so surprised by your sudden aggression that she doesn't seem to realize that she's locked her legs around your waist.",
                                      "ChangeArousalQuietly",
                                      "30",
                   
                                      "She desperately tries to regain her composure as she shudders in ecstasy with every movement you make, but her defiant expression is quickly crumbling into one of wanton lust, and she lets out a shocked gasp in between her moans as she suddenly notices how her body has unconsciously latched itself onto yours.",
                                      "Speaks",
                                      "W-Why are my legs?! W-What do you think you're doing to- OH!♥",
                                      "ChangeArousalQuietly",
                                      "35",
                                      "Her voice trails off as a tiny orgasm races through her, making her shiver underneath you as she moans in bliss, and she gazes up at you with a look of molten need, barely managing to maintain what little composure she has left as she tries to steel herself one last time.",
                                      "Speaks",
                                      "I-I can't l-lose to you...♥ I-I've just g-got to... H-Hold on f-for a... For a...",
                                      "ChangeArousalQuietly",
                                      "50",
  
                                      "She doesn't even manage to finish her thought as you continue to pound her pussy, making her tense up in ecstasy as another micro orgasm tears through her, and before she even finishes spasming she wraps her arms around your neck and pulls you into a deep, romantic kiss, letting you dominate her mouth and body at the same time.",
                                      "ChangeArousalQuietly",
                                      "50",
                    
                                      "Her red eyes blaze with submissive lust as she lovingly gazes up at you, and she lets out miniature mewls of ecstatic pleasure as she begins to move her body in time with your thrusts, intensifying the already enormous amounts of pleasure tearing through you.",
                                      "ChangeArousalQuietly",
                                      "75",
                     
                                      "Your thrusts become even more wild and powerful as you feel a molten need for release building within you, and the kunoichi's eyes start to roll up with pleasure as she begins to shudder from a seemingly endless series of miniature orgasms, making her pussy spasm around your throbbing manhood.",
                                      "PlayerOrgasmNoSpiritLoss",
                     
                                      "She suddenly lets out a wild howl of ecstasy into your mouth and tightens her grip around your neck as she finally gets pushed into a powerful climax, causing her pussy to clamp down on your cock like a vice and sends you into your own equally powerful orgasm, forcing her to even greater heights as you cum into her eagerly waiting body.",
                       
                                      "The two of you tremble in breathless ecstasy for a seemingly endless moment until you finally break the kiss, leaving you both gasping for air as the kunoichi stares up at you with a submissively blissful smile.",
                                      "Speaks",
                                      "Oh,♥ master that was wonderf-",
                  
                                      "Her eyes go wide as she lets out a surprisingly cute 'eep' before clamping her mouth shut and quickly looking away from you with a deep flush.",
                
                                      "Speaks",
                                      "A-Alright, you won! Now pull out... Y-You're making me feel weird...",
                                      "Despite her words, her legs only seem to lock tighter around your waist, and her arms feel like they're gently pulling you closer towards her as her face still burns bright red...",
                                      "Menu",
                                        "Fuck her some more!",
                                        "Pull out and head on your way.",
                                      "EndLoop"

                                  ]
                    },
                          {
                              "NameOfScene": "Fuck her some more!",
                              "theScene": [   "You pull the kunoichi and yourself into a sitting position with her in your lap, and her arms and legs remain firmly wrapped around you as she turns to look at you with a weakly defiant gaze.",
                                              "Speaks",
                                              "Wh-What do you think you're-",
       
                                              "You interrupt her by pulling her into another deep kiss, and she quickly melts into your embrace with a lusty whimper.",
                                              "ChangeArousalQuietly",
                                              "20",
                                              "She tightly clings to your body as you twine your tongue around hers, and she starts to slowly bounce her hips onto your shaft.",
                                              "ChangeArousalQuietly",
                                              "20",
           
                                              "Gasping with pleasure as she continues to teasingly ride your manhood, she breaks the kiss and glares at you with a mix of embarrassment and lust.",
                                              "Speaks",
                                              "Y-You bastard... I-I'm only doing this because you're my mast-... I mean... I... You-",
                                              "ChangeArousalQuietly",
                                              "30",
                                              "She lets out a frustrated moan and nuzzles into your neck, tightening her grip on your body as she starts to move her hips slightly faster.",
                                              "Speaks",
                                              "E-Every part of my body is screaming to be yours... W-Why...?♥",
                                              "ChangeArousalQuietly",
                                              "50",

                                              "You respond to her question by grabbing onto her curvy hips and slamming her down onto your cock, making her stiffen in ecstasy as she lets out a moan into your ear.",
                                              "Speaks",
                                              "OHHHH!♥♥♥ M-Master...♥",
                                              "ChangeArousalQuietly",
                                              "30",

                                              "She pulls her head away from your neck for a moment to gaze at you with submissive need, and she immediately begins to ride you more intensely as you thrust up into her tight pussy, making her shiver with pleasure as the two of you fuck in your intimate embrace.",
                                              "Speaks",
                                              "Ahhh...♥ It feels so good to call you my m-master... I-I shouldn't like it... B-But I do...♥",
                                              "ChangeArousalQuietly",
                                              "30",
                                              "Your cock throbs with every grinding thrust you make into her dripping sex, and she trembles with bliss as you pull her into another kiss.",
                                              "ChangeArousalQuietly",
                                              "40",
                                              "She continues to let out whimpering moans of ecstasy into your mouth as the two of you increase your tempo until you're fucking at an overwhelmingly rapid pace, and she suddenly tears her lips away from yours with a needy moan as she gazes into your eyes with utterly submissive lust.",
                                              "Speaks",
                                              "P-Please... Master... Make me yours.♥",
                                              "ChangeArousalQuietly",
                                              "75",
                                              "You immediately begin to move even more intensely than before, slamming her hips down onto your shaft over and over as she lets out a blissful scream of ecstasy, and she begins to pepper your face with kisses as she trembles with pleasure.",
                                              "ChangeArousalQuietly",
                                              "25",

                                              "She submissively moans and whimpers needily as you kiss her back while fucking her absolutely silly, and she continues to grind and bounce her hips against yours the entire time, even as her eyes occasionally roll back from the intense stimulation ravaging her body.",
                                              "ChangeArousalQuietly",
                                              "25",

                                              "Between her gasps of ecstasy and her unending kisses, she continuously begs you to break her into your unthinking sex slave while whispering 'master' over and over again, only to stop in submissive bliss every time you dominantly thrust into her utterly soaked pussy.",
                                              "ChangeArousalQuietly",
                                              "50",
                                              "Her spasming gradually gets stronger and stronger as she nears orgasm once more, and her pleas get more and more desperate as she powerfully trembles with need before she pulls you into a deep kiss and begins to ride your shaft with wild abandon, seemingly desperate to make you cum.",
                                              "PlayerOrgasmNoSpiritLoss",

                                              "You let out a yell into her mouth as you hilt yourself within her spasming pussy and fill her with another massive load of semen, electrifying her body with pleasure as she's pushed into an overwhelmingly potent orgasm.",
                                              "As you both eventually come down from your respective highs, you break the kiss as the kunoichi goes slack in your arms, twitching slightly in the afterglow of pleasure with an utterly dazed and lust drunk expression as her tongue loosely hangs out of her mouth.",

                                              "You gently lower her to the ground as she slowly begins to fade away, and she lets out a whimper of protest as you free your spent cock from her still spasming pussy.",

                                              "As you slowly begin to untangle yourself from her grip, she gently tightens her arms around your neck one last time as she lovingly stares up at you with a startlingly lucid smile.",
                                              "Speaks",
                                              "Thank you master...♥ Please show me how to submit again sometime soon...♥",
                                              "JumpToScene",
                                              "Fucked her silly"
                                        ]
                          },





                    {
                        "NameOfScene": "Fuck her ass!",
                        "theScene": [   
                                      "The kunoichi nervously looks at you as you approach her with your throbbing manhood, and she desperately tries to fiercely stare at you as you pull her unresisting legs apart, revealing her enticing looking asshole to you.",
                                       "Speaks",
                                       "I-I already t-told you that I won't be defeated by-",
                                       "ChangeArousalQuietly",
                                       "20",
                                       "You cut her words off as you easily penetrate her ass, forcing her to stifle a slutty moan as you hilt yourself within her welcoming body.",
                                       "ChangeArousalQuietly",
                                       "30",
                                       "Her voice only gets louder and louder despite her efforts to restrain herself as you slowly increase your pace, and shivers of pleasure race up your spine as she unconsciously squeezes your shaft in time with your thrusts.",
                                       "JumpToScene",
                                       "AnalScene"
                                  ]
                    },
                    {
                        "NameOfScene": "Keep fucking her ass!",
                        "theScene": [    "ChangeArousalQuietly",
                                        "20",
                                        "The kunoichi lets out a yelp of pleasure as you begin to thrust into her tight ass once more, and she desperately tries to stifle her slutty moans while she fiercely stares up at you.",
                                        "Speaks",
                                        "I-I already, nnmmm!♥ T-told you that I won't be defeated by you!",
                                        "ChangeArousalQuietly",
                                        "30",
                                        "Contrary her defiant words, her gasping breaths and twitching body indicate that she's clearly feeling your movements as you begin to increase your pace, and shivers of pleasure race up your spine as she unconsciously squeezes your shaft in time with your thrusts.",
                                        "JumpToScene",
                                        "AnalScene"
                                  ]
                    },
                    {
                        "NameOfScene": "Fuck her ass instead!",
                        "theScene": [    "ChangeArousalQuietly",
                                        "10",
                                        "The kunoichi powerfully shudders with pleasure as you pull out of her pussy while it almost seems to desperately cling to your shaft, and she stares up at you with defiance even as the faintest hint of lust clouds her expression.",
                                        "Speaks",
                                        "H-Haha... I knew you couldn't handl-!",
                                        "ChangeArousalQuietly",
                                        "15",
                                        "You cut off her words as you suddenly hilt yourself inside her tight ass, forcing a slutty moan from her lips as she trembles underneath you.",
                                        "Speaks",
                                        "EEEK!♥ Ghhh! I-I already told you that I w-won't be defeated by you! J-Just give up already!",
                                        "ChangeArousalQuietly",
                                        "25",
                                        "She desperately tries to stifle her voice as you slowly increase your pace, but her muffled noises of pleasure only spur you to move faster as you revel in the sensations of her welcoming rear while it unconsciously squeezes your shaft in time with your thrusts.",
                                        "JumpToScene",
                                        "AnalScene"
                                  ]
                    },
                    {
                        "NameOfScene": "AnalScene",
                        "theScene": [    "ChangeArousalQuietly",
                                        "25",
                                        "You force the kunoichi trainee onto her stomach as you begin to really fuck her in earnest, and she merely shoots a glare over her shoulder at you as she deeply flushes with embarrassment.",
                                        "ChangeArousalQuietly",
                                        "25",
                                        "She seems to be gritting her teeth to prevent herself from making any noise, but as your hands reach down to grope her firm rear while you continue to slowly increase your pace more and more, her entire body shivers as a faint moan escapes her lips.",
                                        "ChangeArousalQuietly",
                                        "20",
                                        "Your cock pleasantly throbs inside her tight rear as it squeezes down on your length with each thrust you make, and you notice that one of her hands is firmly clamped over her mouth in an attempt to silence herself.",
                                        "ChangeArousalQuietly",
                                        "50",
                                        "The kunoichi trainee shoots a victorious seeming glare over her shoulder at you as she manages to completely stifle her voice, but her stubborn resistance completely crumbles as you suddenly pull on her tail and use your grip to thrust into her rear at a new angle, causing her to let out an overwhelmingly arousing moan as the hand covering her mouth falls limply to her side.",
                                        "ChangeArousalQuietly",
                                        "25",
                                        "She desperately attempts to get herself under control again as you continue to tug on her tail while she trembles in bliss every time you hilt yourself within her, but she can't quite seem to manage it as she whimpers in pleasure underneath you.",
                                        "ChangeArousalQuietly",
                                        "35",
                                        "Her breathing begins to become more and more ragged as her voice slowly rises in pitch, and after giving her deliciously toned rear a few more squeezes before playfully smacking it while powerfully thrusting into her, she suddenly screams in ecstasy as her body spasms in bliss, causing her ass to tighten delightfully around your cock.",
                                        "ChangeArousalQuietly",
                                        "25",
                                        "You don't stop your thrusting even as she shudders with every movement you make, and she shoots you a dazed, aroused, yet very much indignant glare over her shoulder as she tries to get her gasping voice under control.",
                                        "Speaks",
                                        "T-There's no way I came from something as weak as {i}that{/i} h-human! I-I'm {i}not{/i} a m-masochist like y-you!",
                                        "ChangeArousalQuietly",
                                        "30",
                                        "You yank on her tail once more as you continue to thrust into her tight rear, and her face becomes loose with ecstasy as she suddenly lurches forward with a unrestrained moan, clearly unable to prop herself up with her arms anymore as spasms of pleasure tear through her body.",
                                        "ChangeArousalQuietly",
                                        "25",
                                        "Her voice only gets louder as she seems to forget about holding it back any longer, and as you give her ass a firmer slap, she lets out a lewd shriek of orgasmic bliss as another climax washes over mere moments after her last one.",
                                        "ChangeArousalByPercent",
                                        "50",
                                        "Her already tight ass becomes viselike around your cock as you feel a burning need for release building within your groin, and you begin to slap her firm rear between your thrusts as you redouble your efforts to fuck the kunoichi trainee, causing her to spasm on the ground as you effortlessly extend her already powerful orgasm.",
                                        "Speaks",
                                        "AAAAHH!♥ I-I give up! You win! EEEEK!♥ N-No more! I-I'll become a masochist at this rat- OOOOHHHH!♥♥♥",
                                        "ChangeArousalQuietly",
                                        "50",
                                        "She can't even finish her sentence as you begin to roughly pound her ass, making it jiggle with every meeting of your hips while her voice trails off into incoherent noises of ecstasy.",
                                        "ChangeArousalQuietly",
                                        "50",
                                        "Your thoughts are utterly consumed by your intense need to cum, but as you yank on her tail once more to thrust into her from a different angle, the spaded tip of it wags in front of your face, and you're suddenly overwhelmed by the urge to bite down on it as it draws closer to your mouth.",
                                        "ChangeArousalQuietly",
                                        "25",
                                        "As you lean forwards and gently sink your teeth into it, the kunoichi goes completely rigid with incoherent bliss as she lets out a deafening shriek of pleasure.",
                                        "ChangeArousalQuietly",
                                        "50",
                                        "Her ass spasms and churns around your manhood as another orgasm tears through her, and every thrust you make begins to feel agonizingly pleasant as you teeter on the brink of your own climax.",
                                        "PlayerOrgasmNoSpiritLoss",
                                        "You give her rear one last slap as you hilt yourself within her and cum, flooding her with your semen as her entire body is sent to higher heights of pleasure than ever before.",
                                        "Speaks",
                                        "AAAAAAAH!!!♥♥♥ YESSS!!!♥♥♥",
                                        "After a breathless moment of ecstasy, you release your grip on her tail and catch your breath as you revel in the afterglow of your orgasm, but the kunoichi continues to let out blissful whimpers as she lightly trembles on the ground, and she looks up at you with a loose grin, seeming to be completely intoxicated with pleasure.",
                                        "Speaks",
                                        "A-Ah... My master's cock feels so gooodddd...♥",
                                        "She shivers lightly as her eyes sudden seem to regain their focus, and she glares back up at you with renewed determination.",
                                        "Speaks",
                                        "W-What are you looking at me for? I didn't say anything weird, a-alright?! B-Besides, you won, s-so hurry up and pull out already...",
                                        "Despite her words, she almost seems to be pushing her waist back into you as she gently grinds her hips into yours while her ass possessively squeezes on your throbbing cock...",
                                        "Menu",
                                          "Fuck her ass some more!",
                                          "Pull out and head on your way. ",
                                        "EndLoop"
                                  ]
                    },
                          {
                              "NameOfScene": "Fuck her ass some more!",
                              "theScene": [    "ChangeArousalQuietly",
                                              "25",
                                              "You begin to thrust into the kunoichi's rear once more, and she lets out a panicked whimper of pleasure as a shiver races through her body.",
                                              "Speaks",
                                              "A-Ah?! Y-You're not satisfied yet?!",
                                              "ChangeArousalQuietly",
                                              "50",
                                              "You grab ahold of her legs and pull her back into your lap before wrapping your arms around her waist and standing up, making her gasp as you continue to fuck her ass while you prop her in the air.",
                                              "ChangeArousalQuietly",
                                              "25",
                                              "Her legs are completely spread open in your grip, exposing her dripping pussy to the air as you powerfully thrust into her ass while bouncing her on your cock, forcing her to shudder as you easily dominate her.",
                                              "Speaks",
                                              "EEEK! W-Wait! This position is t-too humiliating mast-",
                                              "ChangeArousalQuietly",
                                              "50",
                                              "She bites her lip to stop herself from speaking, but she lets out a loud moan with a shiver of pleasure as you deliberately loosen your grip on her legs slightly, causing her to involuntarily spear your cock within the tight confines of her rear as her body weight presses her down into you.",
                                              "ChangeArousalQuietly",
                                              "35",
                                              "Her ass spasms around your length as you continue to fuck her, sending waves of pleasure racing through you as you unendingly thrust into her.",
                                              "ChangeArousalQuietly",
                                              "35",
                                              "She begins to lean backwards into your chest as she lets out whimpering moans of ecstasy from how roughly you're treating her, and the shifting of her weight allows you to slide one of your hands down from her waist to her dripping pussy, making her tremble as you begin to play with her, occasionally stopping to gently flick her sensitive clit.",
                                              "ChangeArousalQuietly",
                                              "25",
                                              "Shivers of bliss wrack her body from your simultaneous assault of her ass and pussy, and she begins to go completely slack with pleasure as she press further against your body, looking up at you with an utterly pleasure drunk, yet still faintly defiant look.",
                                              "Speaks",
                                              "Hahhh...♥ I-I won't... G-Give in...",
                                              "ChangeArousalQuietly",
                                              "50",
                                              "Her words spur you to thrust even harder than before as your other hand moves up and begins to roughly grope one of her breasts while tweaking and pinching her nipple, making her gasp arousingly as she shudders in your arms.",
                                              "ChangeArousalQuietly",
                                              "35",
                                              "She grits her teeth in an attempt to endure the pleasure, but she cries out in ecstasy as you gently pinch her clit while bouncing her on your cock, causing juices to squirt from her pussy as her ass spasms around your shaft.",
                                              "Speaks",
                                              "EEEK!♥♥♥",
                                              "ChangeArousalQuietly",
                                              "50",
                                              "You start to thrust hard and fast into her twitching rear as her body begins to spasm in orgasm, and she lets out a string of incoherently lustful moans as she submissively stares up into your eyes.",
                                              "ChangeArousalQuietly",
                                              "50",
                                              "As she eventually begins to come down from her orgasm, you slow down your fevered thrusts, and she lifts her arms that were loosely hanging at her sides to wrap them around your head as she pulls your face closer to hers with an expression of lustful bliss.",
                                              "Speaks",
                                              "Master...♥ Please kiss me while you break the rest of my resistan-♥ GHK- Wh-Why was I sayin-",
                                              "ChangeArousalQuietly",
                                              "75",
                                              "Her eyes seem to regain their focus for a moment as she tries to pull herself away from you, but you cut off her movements with the kiss she was so desperately begging for, and whatever defiance she had left utterly leaves her as she melts into your grasp, shivering submissively as you dominate her ass, pussy, mouth, and breasts at the same time.",
                                              "ChangeArousalByPercent",
                                              "50",
                                              "She whimpers and moans with every movement you make, reciprocating your thrusts with her hips as a burning need begins to build in your groin, and her voice begins to get higher and higher pitched as she approaches her own orgasm, but just before you manage to cum, she suddenly pulls away from your mouth and stares at you lovingly.",
                                              "Speaks",
                                              "M-Master.♥",
                                              "PlayerOrgasmNoSpiritLoss",
                                              "Her meek voice pushes you over the edge as you powerfully yank her back into a deep kiss while hilting yourself within her tight rear and unloading a large amount of semen within her, making the two of you shiver in bliss as you continue to roughly pinch her nipples and clit while you cum, causing her ass to crushingly tighten around your spasming manhood as she's pushed into her own explosive orgasm.",
                                              "The sound of her overwhelmingly lewd moans are muffled by your intense kiss as you twist your tongue around hers, and even as you both come down from your respective pleasureful highs, she continues to spasm in your arms from the aftershock of so many climaxes in quick succession.",
                                              "ChangeEnergyQuietly",
                                              "-50",
                                             
                                              "A sudden wave of exhaustion washes over you, and you slowly sit down with your cock still inside the kunoichi's squeezing ass as you catch your breath. That position took it out of you...",
                                              "You hook your arms underneath the now limp woman's armpits and pull her off of you, making her murmer in protest as you free your spent manhood from her rear, but she submissively doesn't struggle as you set her down on the ground next to you.",
                                              
                                              "She gives you a weak, happy smile as she lays herself down on the ground, still trembling lightly in post orgasmic bliss as she smiles contentedly.",
                                              "ChangeEnergyQuietly",
                                              "60",
                                              "It doesn't take long for you to get your energy back, and as you stand back up, you notice that the kunoichi is already starting to fade away...",
                                              "JumpToScene",
                                              "Fucked her silly"
                                        ]
                          },









                    {
                        "NameOfScene": "Put her mouth to better use.",
                        "theScene": [ 
                                      "The kunoichi nervously looks at you as you approach her with your throbbing manhood, and she desperately tries to fiercely stare at you as you put your hands behind her head and eye her full looking lips.",
                                        "Speaks",
                                        "I-I already t-told you I won't be defeated by yo- MMPH!?!",
                                        "JumpToScene",
                                        "BJScene"
                                  ]
                    },
                    {
                        "NameOfScene": "Pull out of her pussy and put her mouth to better use.",
                        "theScene": [   
                                        "ChangeArousalQuietly",
                                        "10",
                                        "The kunoichi powerfully shudders with pleasure as you pull out of her pussy while it almost seems to desperately cling to your shaft, and she stares up at you with defiance even as the faintest hint of lust clouds her expression.",
                                        "Speaks",
                                        "H-Haha... I knew you couldn't handl- MMPH!?!",
                                        "JumpToScene",
                                        "BJScene"
                                  ]
                    },
                              {
                        "NameOfScene": "Pull out of her ass and put her mouth to better use.",
                        "theScene": [   
                                      "ChangeArousalQuietly",
                                        "10",
                                        "The kunoichi powerfully shudders with pleasure as you pull out of her ass while it almost seems to desperately cling to your shaft, and she stares up at you with defiance even as the faintest hint of lust clouds her expression.",
                                        "Speaks",
                                        "H-Haha... I knew you couldn't handl- MMPH!?!",
                                        "JumpToScene",
                                        "BJScene"
                                  ]
                    },
                    {
                        "NameOfScene": "BJScene",
                        "theScene": [  "ChangeArousalQuietly",
                                      "30",
                                      "You cut off her words as you grab onto her ponytail and shove your thick manhood into her warm mouth.",
                                      "ChangeArousalByPercent",
                                      "15",
                                      "She glares up at you with indignant rage as you hilt your shaft up to her lips, and you let out a small gasp as her dextrous tongue begins service your length.",
                                      "ChangeArousalByPercent",
                                      "20",
                                      "The kunoichi's eyes widen in surprise as she seems just as caught off guard from her actions, clearly not intending to obediently service you as she begins to lewdly suck on your cock while lapping at your sensitive tip.",
                                      "ChangeArousalQuietly",
                                      "30",
                                      "She glares up at you with a nervous, yet faintly anticipatory look as you guide her head up and down your shaft, making you shiver from the delightful sensation of her soft lips firmly sealing your manhood into her mouth.",
                                      "ChangeArousalQuietly",
                                      "50",
                                      "You begin to thrust into her inviting mouth as you push and pull her head in time with your movements while her tongue continues to lewdly twine and lick your cock, making her let out muffled sounds of arousal as her confused eyes begin to cloud over with burning lust.",
                                      "Speaks",
                                      "Mmmmph?! Mmmm...♥ MMM!!!",
                                      "ChangeArousalByPercent",
                                      "25",
                                      "Gradually, you begin to properly fuck her throat as she lets a happy moan onto your shaft, and she wraps one arm around your waist to brace herself while her other hand and tail begin to tease her breasts and dripping pussy.",
                                      "Speaks",
                                      "Mmmmmm...♥♥♥",
                                      "ChangeArousalQuietly",
                                      "50",
                                      "Pleasure builds in your hips from her mouth stroking your length as she powerfully sucks on your shaft every time you thrust, then licks and teases your tip as you begin to pull out, making her shiver in bliss as she obediently services your cock.",
                                      "ChangeArousalByPercent",
                                      "35",
                                      "You can feel a powerful orgasm rapidly approaching as you increase your already rapid pace, and the kunoichi submissively looks up at you with an ecstatically lustful face as her tongue twists around your tip, and the sight of her eagerly working your throbbing manhood as you fuck her face causes whatever restraint you had left to crumble away to nothingness.",
                                      "PlayerOrgasmNoSpiritLoss",
                                      "You let out a howl as you put both your hands on the back of her head and push her onto your cock as you hilt your aching erection down her throat and pour a massive load of cum into her, and she shudders in ecstasy as her own body tenses up in orgasm, making her eyes go wide with pleasure as her pussy squirts juices onto the ground.",
                                      "Even as you continue to cum, she continues to suck on your shaft while her tongue laps at your sensitive tip, making you shiver as she extends your orgasm until it finally begins to subside.",
                                      "The kunoichi lets out a whimper of unhappiness as you begin to pull out of her mouth with a lewd, wet pop, but she doesn't protest as she submissively kneels before you.",
                                      "She trembles and moans in pleasure as she stares at your cock, and her hand is still idly teasing her pussy as her tail lovingly twists around one of your arms still wrapped behind her head.",
                                      "Speaks",
                                      "Ahhhhh... Master...♥ Your cock is so tasty...♥ GHK!?",
                                      "She suddenly seems to snap out of her bliss induced trance with a start, and she stops masturbating as she looks away from you with a deep, embarrassed flush.",
                                      "Speaks",
                                      "I-I didn't mean that! Tch! F-Fine you won... Now get moving or s-something...",
                                      "Despite her words, her gaze occasionally flits back to your still throbbing cock while her tail tightens its grip on your wrist ever so slightly...",
                                      "Menu",
                                        "Fuck her throat some more!",
                                        "Head on your way.",
                                      "EndLoop"
                                  ]
                    },
                          {
                              "NameOfScene": "Fuck her throat some more!",
                              "theScene": [ 
                                            "Still not sated, you begin to pull her unresisting head back down onto your cock.",
                                            "Speaks",
                                            "E-Eh?! H-Hold o-on a secon-!",
                                            "ChangeArousalQuietly",
                                            "20",
                                            "Before she can finish speaking, her voice abruptly dies off as she opens her mouth into a lewd O shape and sticks out her tongue, seeming to invite your shaft back into her throat once more as her warm breath tingles across your skin.",
                                            "Speaks",
                                            "Ah? Ahh?!?!",
                                            "ChangeArousalByPercent",
                                            "25",
                                            "She seems baffled by her own actions, but the lewd sight drives you to eagerly plunge your cock back into her mouth, and a shiver of pleasure runs through you as she immediately seals her lips around your dick and begins to loudly suck and lick your entire length with faint noises of pleasure.",
                                            "Speaks",
                                            "Mmmmm?!♥",
                                            "ChangeArousalQuietly",
                                            "50",
                                            "The kunoichi eagerly services your shaft as you simply lean back and let her pleasure you with her delightfully pleasant mouth, and despite her indignant glare, she seems to be enjoying herself as her hand idly moves back down and begins to tease her pussy once more, but she pulls her mouth off of your shaft with a lewd pop as she stares up at you submissively.",
                                            "Speaks",
                                            "Nmm, d-damn... I-It... *sluuurp* Haaa,♥ master's dick!♥ Ghk?! N-No! I-I won't submit...",
                                            "ChangeArousalByPercent",
                                            "20",
                                            "Despite her obvious internal conflict, she eagerly dives her head back down onto your cock and continues to skillfully lap and tease your throbbing length, making it ache with need from her gentle ministrations.",
                                            "ChangeArousalByPercent",
                                            "25",
                                            "Overwhelming lust begins to overtake your mind as you find yourself unable to sit back and let her do all the work, and you begin to pound your manhood into her throat as you push her head up and down your shaft, forcing a mewl of ecstasy from her as she redoubles her efforts to service you.",
                                            "ChangeArousalQuietly",
                                            "40",
                                            "As you fuck her throat, you watch the defiance still in her face slowly melt away to lustful submission as the suction of her mouth only seems to increase while her tongue becomes even more pleasantly teasing on your shaft, and her entire body shivers with pleasure every time you slam your length into her throat.",
                                            "Speaks",
                                            "Mmmmmm!♥ N-Nooo...♥ N-Not going to g-giv- MMMMPPHH!?♥♥♥",
                                            "ChangeArousalQuietly",
                                            "50",
                                            "As you continue to dominate her mouth, she goes rigid and lets out a muffled moan of ecstasy as a powerful orgasm tears through her, making her pussy squirt sexual juices all over the floor as her face goes slack with completely submissive pleasure.",
                                            "ChangeArousalQuietly",
                                            "60",
                                            "All of her previous attitude seems to have disappeared as she happily services your cock with delightfully lewd licks and sucks, effortlessly working in time with your movements to make you feel as good as possible as her body trembles in bliss with every thrust you make.",
                                            "ChangeArousalQuietly",
                                            "40",
                                            "Her eyes gaze up at you with pure adoration, almost seeming to beg for your semen as she sucks your shaft even further down her throat than ever before, sending powerful shivers of pleasure racing through you as you feel an orgasm building in your groin.",
                                            "ChangeArousalByPercent",
                                            "25",
                                            "The kunoichi moans in ecstasy as another climax tears through her body, making her shudder as her tongue begins to furiously lap and lick at your throbbing shaft.",
                                            "PlayerOrgasmNoSpiritLoss",
                                            "With one final thrust into her waiting mouth, you let out a primal cry of pleasure as you spurt a thick load of semen down her throat, holding her head down onto your shaft as you powerfully shudder from the sensations of her still powerfully sucking mouth.",
                                            "Her eyes begin to roll up as the sensation of your cum pouring into her causes her body to spasm uncontrollably with submissive pleasure, locking her into a mind meltingly powerful orgasm.",
                                            "After a long moment of blissful pleasure, your orgasm eventually subsides, and you pull your spent cock from her mouth with a sigh, releasing your grip on her head as she sways in place before collapsing into a twitching heap with a happy smile.",
                                   
                                            "Speaks",
                                            "Th-Thank you, master...♥",
                                            "JumpToScene",
                                            "Fucked her silly"
                                        ]
                          },






                    {
                        "NameOfScene": "Leave.",
                        "theScene": [
                                      "You decide to leave the defeated kunoichi be and head on your way, and as you walk away from her, she yells at you with indignant rage, refusing to accept that you defeated her and swearing vengeance for her defeat, and by the time you look back to where she was, she's already faded away...",
                                      "DisplayCharacters",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Pull out and leave.",
                        "theScene": [  
                                    "You pull out of the kunoichi's tight pussy as she lets out a whimpering shudder, but as you begin to walk away from her, she yells at you with indignant rage, refusing to accept that you defeated her and swearing vengeance for her defeat, and by the time you look back to where she was, she's already faded away...",
                                    "DisplayCharacters",
                                    "EndLoop"
                                  ]
                    },
          {
                        "NameOfScene": "Pull out and leave. ",
                        "theScene": [   
                                    "You pull out of the kunoichi's tight ass as she lets out a whimpering shudder, but as you begin to walk away from her, she yells at you with indignant rage, refusing to accept that you defeated her and swearing vengeance for her defeat, and by the time you look back to where she was, she's already faded away...",
                                    "DisplayCharacters",
                                    "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Head on your way.",
                        "theScene": [  
                                        "You move on and leave the embarrassed kunoichi alone, and she quickly scampers off with a deep blush.",
                                        "DisplayCharacters",
                                        "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Pull out and head on your way.",
                        "theScene": [   
                                        "You pull out of the kunoichi's tight pussy as she lets out a whimpering shudder, and as you head on you way, the kunoichi gives you a slightly wistful glare before she scampers off with a deep blush.",
                                        "DisplayCharacters",
                                        "EndLoop",
                                        "AdvanceTime", "1"
                                  ]
                    },
          {
                        "NameOfScene": "Pull out and head on your way. ",
                        "theScene": [    
                                      "You pull out of the kunoichi's tight ass as she lets out a whimpering shudder, and as you head on you way, the kunoichi gives you a slightly wistful glare before she scampers off with a deep blush.",
                                      "DisplayCharacters",
                                      "EndLoop",
                                      "AdvanceTime", "1"
                                  ]
                    },
                    {
                        "NameOfScene": "Fucked her silly",
                        "theScene": [   
                                      "Sated, you leave the kunoichi trembling on the ground with an utterly pleasure drunk expression on her face, and between her gasping breaths, you can hear her happily whimper 'master' towards you over and over again.",
                                        "DisplayCharacters",
                                        "EndLoop",
                                        "As you stare at the exhausted woman, she stares up at you and smiles happily before finally fading away, leaving you to continue onwards.",
                                        "AdvanceTime", "1"
                                  ]
                    }
                ]
}
