
{
    "name": "Scorched Path",
    "CardType": "Event",
    "CardLimit": "1",
    "Description": "There have been mentions of scorch marks being found up in the mountains, going around the guild. No official statement has been made, but Elena advises adventurers to stay cautious.",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Alyssa",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
						"NameOfScene": "EventStart",
						"theScene": [ 
									"ProgressEqualsOrGreater","1","Consequent Encounters",

									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Emotional - Darkness (1_55) 94bpm.mp3",
									"As you trek along the mountain trail, your momentum comes to a stop.\nIn front of you lies a patch of scorched earth.", 
									"You turn around, scanning your surroundings, hoping to locate the source... but to no avail.",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									"You quickly let go of your search, pushing it to the back of your mind and focus on getting back on track.",
									"As you contemplate on whether or not to follow the original path, you notice a bunch of large boulders that have fallen on top of each other, sandwiched between two flanks. Upon closer inspection, it seems to have been there for quite some time, covered in layers of moss, and undergone extensive weathering.", 
									"Menu",
									"Climb the dubious rocks",
						
									"Continue along the trail",
									"EndLoop"
                                  ]
                    },
					{
                        "NameOfScene": "Climb the dubious rocks",
                        "theScene": [ 
									"ChangeBGM", "music/Caverns/Purple Planet Music - Emotional - Darkness (1_55) 94bpm.mp3",		  
									"Having come to a decision, you bring yourself over to the pile of rocks; studying them from every angle, mentally noting which stones to climb, and finding the best way to approach as one ill considered move could result in you just plummeting back down.", 
									"ChangeBGM", "music/Caverns/Purple Planet Music - Tense - Melancholia (1_24) 96bpm.mp3", 
									"Finishing your mental preparations, you begin your climb; cautiously prodding for any loose stones and feeling for any slippery surfaces.\nSteadily, you make your way up.",
									"ChangeEnergy",
									"-50",
									"Finally at the top, you see a ledge and make your way over to it.\nYou cautiously walk over uneven boulders until landing on even ground.",
									"ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									"You breathe out a sigh of relief before heading off, continuing your ascent to the top of the mountain.",
									"StopBGM"
								  ]
                    },
					{
                        "NameOfScene": "Continue along the trail",
                        "theScene": [ 
									  "ProgressEqualsOrGreater","1","Consequent Intro First Half",

									  "Deciding to stay on course, you continue along the trail.",
									  "You make your way up the mountain, with not a single monster girl in sight. All seems to be going well, that is until; you see a scorch mark.", 
									  "ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Emotional - Darkness (1_55) 94bpm.mp3", 
									  "You go further and further finding another mark, then another, and another, and then ANOTHER! It becomes apparent that this is no mere coincidence.", 
									  "Your pace slows down, growing more and more cautious at each passing mark. Suddenly, you hear something.", 
									  "Listening closely, you make out the broken voice of someone in the distance. You follow the sound in order to investigate. As you draw nearer the sound becomes more and more distinct.",
									  "Speak", "???",
									  "GOT YOU! Hah~…ha~ … easier if… unh~ … do not struggle{color=#e80cc0}♥{/color}.",
									  "You finally locate the source of the sound, coming from a short distance ahead of you. Sneakily, you crouch behind a boulder and look over, managing to make out the figure of a male adventurer, with his pants missing; pinned down by an amalgamous looking monster girl with a hand over his mouth.",
									  "DisplayCharacters",
									  "1",
									  "EndLoop", 
									  "Your eyes creep upwards from the mysterious predator’s right hand, which to your surprise, is actually a large paw covered in long shaggy hair running all the way up to her shoulder. In contrast, her left arm is lined with rigid scales all the way down to her clawed fingers.",
									  "Your eyes move up, immediately drawn to her strikingly contrasting and oddly colored eyes along with the pair of sharp corrugated horns, next to her two rounded furry ears at the sides of her head.",
									  "Your attention mindlessly drifts down her body, noticing her long, fur covered legs, and stopping at her hooved feet.", 
									  "Speak", "???",
									  "Well, well, well. It seems as though there are still some foolish adventurers trying to confront the Demon Queen! After the Black Knight destroyed the lift we had believed that no one would dare approach the mountain, let alone~ make their way to the temple.",
									  "She pushes her face closer and extends her clawed finger; slowly dragging the tip up his body and tracing the contour of his form.",
									  "Speak", "???",
									  "Hmmm~… what-to-do with-you~{color=#e80cc0}♥{/color}. I suppose I should follow my orders to disable your recall stone, bring you to the castle, and torture you.\nSet you as an example for the other foolish adventurers wanting to defy her majesty.",
									  "A low hiss resounds as a snake emerges, joined to her body like a tail, swaying excitedly. The monster girl's narrow, eating up his expression as she flashes a toothy smile.",
									  "Speak", "???",
									  "But before that, I shall have my way with you~{color=#e80cc0}♥{/color}.",
									  "A plume of fire blows out of her mouth, burning away the rest of his clothes and exposing his bare skin. She plants both of her hands onto his chest and starts sensually grinding on his pelvis, moving her hips around in circles as her tail coils around his leg.",
									  "Speak", "???",
									  "Mnn{color=#e80cc0}♥{/color} Maybe if you give me enough pleasure, Ah~{color=#e80cc0}♥{/color}, I’ll put in a good word for you with the Black Knight. Mmm{color=#e80cc0}♥{/color} Then, MAYBE, she’ll only force you to cum 20 times~{color=#e80cc0}♥{/color}.", 
									  "Menu",
										"Barge in to help!",
						
										"Leave him to his fate!",
										
										"Go and report the kidnappings to the guild!",
									  "EndLoop"
                                  ]
                    },
					{
                        "NameOfScene": "Barge in to help!",
                        "theScene": [
									"ChangeBGM-NoFade", "music/Battle/Battel-LunaticDance.mp3",  
									"You rush out of your hiding spot, drawing her attention.",
									"PlayerSpeaks", 
									"GET OFF OF HIM!",
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Metal Gear Solid - Exclamation Point Sound Effect.mp3",
									"She jumps at your sudden entrance, surprise written all over her face, as her tail coils around itself and hisses.",
									"Speak", "???",
									"Wa-wait! Who are you and w-what are you doing here!? How much did you hear?!",
									"You tell her that there is no point in asking questions, having heard everything she said about kidnapping adventurers opposing the Demon Queen.",
									"PlayerSpeaks",
									"PREPARE FOR BATTLE!",
									"ChangeBGM-NoFade", "music/Battle/Comet_Highway.mp3",
									"A wild monster girl approaches!", 
									"JumpToScene",
									"Initial Intro Cont"
                                  ]
                    },
					{
                        "NameOfScene": "Leave him to his fate!",
                        "theScene": [ 
									"DisplayCharacters",
									"EndLoop",
									"ChangeBGM-NoFade", "music/Loss/BGM03_Uncanny light.mp3",
									"Closing your eyes, you take a moment to perform a silent prayer for the fallen adventurer, following the laws of the land and let the winner have her spoils.",
									"DisplayCharacters",
									"1",
									"EndLoop",
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Metal Gear Solid - Exclamation Point Sound Effect.mp3",
									"ChangeBGM", "music/Battle/agitating-point.mp3", 
									"As soon as you open your eyes you catch the monster girl’s gaze looking RIGHT AT YOU!",
									"Speak", "???",
									"Human! Show yourself and explain to me what you’re doing here!",
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Newtype Flash.mp3",
									"ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/Predator.mp3",
									"Alarm bells go off in your head, triggering your flight response as you bolt away, fleeing from the scene.",
									"You run as fast you can, not even daring to look back, as your heart keeps pounding louder and louder, trying to keep up with your body as it goes into overdrive, jumping over rocks and ducking under branches.",
									"As you run away a shadow zooms past you, before a winged figure drops from the sky, kicking up a cloud of dust, causing you to skid and stop.",
									"PlayerSpeaks",
									"*cough* *cough*",
									"Speak", "???",
									"Stop! Do not try fleeing again for you cannot escape from me!",
									"Menu",
									"Confront her!",

									"Apologize for ruining her fun",
									"EndLoop"
                                  ]
                    },
					{
                        "NameOfScene": "Confront her!",
						"theScene": [
									"ChangeBGM-NoFade", "music/Battle/Battel-LunaticDance.mp3",   
									"PlayerSpeaks", 
									"You've come for me next huh? Go ahead, try kidnapping me! Just so you know, I won't be as easy!", 
									"PlayerSpeaks", 
									"PREPARE FOR BATTLE!", 
									"ChangeBGM-NoFade", "music/Battle/Comet_Highway.mp3",
									"A wild monster girl approaches!", 
									"JumpToScene",
									"Initial Intro Cont"
									  ]
					},
					{
                        "NameOfScene": "Apologize for ruining her fun",
						"theScene": [
									"You quickly apologize for invading her privacy.",
									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Tense - Melancholia (1_24) 96bpm.mp3", 
									"She leans in towards you and looks at you intensly, {w=2}watching your reactions{w=1}.{w=1}.{w=1}.{w=1} before seemingly coming to a decision, retracting her body and folding her arms.",
									"ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
									"Speak", "???", 
									"Hmph! It seems that you still have SOME manners… apology accepted. I’ll let it go this time.", 
									"ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/Predator.mp3", 
									"However. Do not repeat this act again in the future.",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									"You let out a breath that you didn’t even know you were holding back as tension leaves your body. With a slight turn of her head, she looks at you shyly from the side with a faint blush.",
									"ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3",
									"Speak", "???",
									"So. While you’re here…tell me. Since you saw me and all, what did you think?",
									"ChangeBGM-NoFade", "music/Forest/nandesuto.mp3",
									"Did I do alright? Was I too passionate? Not passionate enough! How’s my technique? Wait, you probably want to see it yourself! Don’t worry. I can go another round {b}right now{/b}!",
									"Speak", "???", 
									"Huh? Why are you blushing?",
									"Too close! You can’t help but blush, caught off guard by the words coming out of her mouth, combined with the fact that her face is a mere few inches away from your face!",
									"Speak", "???", 
									"Wait. What did you think I was doing?",
									"ChangeBGM", "../Mods/Scorched_Path/Music/Predator.mp3",
									"Her question snaps you back to reality as your gaze darts around looking for a way out. Your hopes are dashed as her gaze bores into you, pressuring you to respond.",
									"You give in, deciding to tell her what you saw.",
									"JumpToScene",
									"Initial Intro Cont"
									  ]
					},
					{
                        "NameOfScene": "Go and report the kidnappings to the guild!",
						"theScene": [ 
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",		  
									"DisplayCharacters",
									"EndLoop",
									"You slowly back out, deciding that this is far too dangerous for you to handle alone. What if there are more of them?, what if you get captured?, it’s better to play it safe and let the guild take care of this. Hopefully, Elena can organize a rescue mission.",
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/ZapSplat foley_dry_thick_leaf_or_twig_crunch_break_crush_002_58185.mp3",
									"*SNAP*",
									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Tense - Melancholia (1_24) 96bpm.mp3",
									"You freeze in place. Looking down you see a snapped twig. Sweat begins running down your face.",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									"Hoping no one heard you, you turn around your heel to head back but unexpectedly bump into something… soft.",
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Icky Squish (Anime Sound) - Sound Effect for editing.mp3", 
									"DisplayCharacters",
									"1",
									"EndLoop", 
									"You stumble back, a little dazed, opening your eyes to be immediately greeted by a pair of subtle breasts before panning up to see two sharp miscolored eyes glaring at you as your eyes go wide, realizing it’s HER.",
									"ChangeBGM-NoFade", "music/Battle/agitating-point.mp3",
									"Speak", "???",
									"AHEM! Are you not aware that it is very rude to spy on someone without them knowing? What do you aim to achieve, human?",
									"She steps closer little by little, causing you to instinctively move back, trying to widen the distance until your back bumps into the side of a rock. With no way out, you have no choice but to confront the monster girl.",
									"Menu",
										"Confront her!",

									"Apologize for ruining her fun",
									"EndLoop"
									  ]
					},
					{
                        "NameOfScene": "Initial Intro Cont",
                        "theScene": [ 
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Gaming Sound FX - Record Scratch - Sound Effect (HD).mp3",
									"ChangeBGM", "music/Forest/nandesuto.mp3",
									"Speak", "???",
									"Haaah!? What are you talking about?! Wait, I get it now! You must have overheard me a while ago! This is all a misunderstanding! I am an actor! I was just practicing my lines for a movie. If you don’t believe me, look!",
									"Your gaze follows her outstretched finger, pointing to the body of the male adventurer. Only, it isn’t.",
									"Getting a better view, you find that what you initially thought was an adventurer turns out to be a mannequin of an adult human male. Next to it lies a stack of thick notebooks with one of them turned open. You find the pages densely packed with lines of dialogue with the exact same words the monster girl was saying earlier.",
									"JumpToScene",
									"Explain Please Menu"
									  ]
					},
					{
                        "NameOfScene": "Explain Please Menu",
                        "theScene": [ 
									"Menu",
									"'What about the kidnappings for the Demon Queen?'",
									"'Why do you have a mannequin?'",
									"'What was with the scorch marks on the trail?'",
									"'If you aren’t with the Demon Queen how did you know about the lift?'",
									"Apologize",
									"EndLoop"
									  ]
					},				
					{
                        "NameOfScene": "'What about the kidnappings for the Demon Queen?'",
                        "theScene": [ 
									"Speak", "???", 
									"There aren’t any kidnappings of adventurers here! I don’t know anything about the Demon Queen and their plans, that was all just part of the act!",
									"Speak", "???",
									"I'm practising for a movie about a soldier in the Demon Queen army capturing adventurers trying to beat the Demon Queen.", 
									"Speak", "???",
									"She is in charge of imprisoning the main protagonist and sexually torturing him, but eventually they fall in love with each other and run off getting married putting the ongoing conflict behind them. I play as one of the soldiers he defeats before getting captured.",
									"JumpToScene",
									"Explain Please Menu"
									  ]
					},
					{
                        "NameOfScene": "'Why do you have a mannequin?'",
                        "theScene": [ 
									"Speak", "???",
									"Hmm? The mannequin? It’s here to give me a better feel of the scenes I am part of. Most of them have me acting with another actor so having a dummy to practice with helps me remember my positioning and be aware of my eye contact and body language.",
									"JumpToScene",
									"Explain Please Menu"
									  ]
					},
					{
                        "NameOfScene": "'What was with the scorch marks on the trail?'",
                        "theScene": [ 
									"Speak", "???",
									"Huh? Oh, those! Uhh funny story. You see in a specific scene it has me chasing the adventurer across the set. They told me to use whatever abilities I have to really sell that I was trying hard to capture him and {i}apparently{/i} I got a little too into it, kept breathing fire everywhere on the way here hehe…",
									"JumpToScene",
									"Explain Please Menu"
									  ]
					},
					{
                        "NameOfScene": "'If you aren’t with the Demon Queen how did you know about the lift?'",
                        "theScene": [ 
									"Speak", "???",
									"Huh? The lift? Don’t you know? The lift gets destroyed by the Black Knight and then rebuilt every three months.",
									"Speak", "???",
									"Rumor has it that the day when the Black Knight spares the lift, is the day that no more new adventurers appear~. The locals gather and ride down the lift from the top of the mountain for good luck and a chance to meet the Black Knight. It’s a really popular tourist attraction for monster girls♪",
									"JumpToScene",
									"Explain Please Menu"
									  ]
					},
					{
                        "NameOfScene": "Apologize",
                        "theScene": [ 
									"ChangeBGM-NoFade", "music/Loss/reason.mp3",		  
									"You quickly apologize for your accusations, only to have her look at you coldly.",
									"Speak", "???",
									"Hmph! You sure have some nerve! Accusing me of being a kidnapper, being involved with the destruction of public property, and being a shameless pervert!!!",
									"Speak", "???", 
									"I take false accusations and my reputation very seriously! Imagine if you were an actor and someone went around, telling people that you were a pervert and a criminal! Word would get out and rumors would start to form. Things will quickly get out of hand and the rumors would only get worse! No one would cast me for any roles ever again and my acting career would be over!",
									"Seeing her up in your face and red from anger, once again you beg for forgiveness and ask if there is anything you can do to make it up to her and show your sincerity.",
									"She backs off and calms down taking a brief moment to contemplate. She circles around you, examining you up and down, almost as if appraising your worth.",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									"Speak", "???", 
									"Hmm… maybe you can do something for me… You do seem capable.",
									"ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3",
									"Speak", "???", 
									"and easy on the eyes~.",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									"Speak", "???", 
									"*Cough*",
									"Speak", "???",
									"I have decided that there is something you can help me with. You see most of the time I come out here alone, memorizing lines, trying to convey the right emotions, and finding the right body language. This time, the character I am playing has a lot of interactions with a male adventurer.",
									"Speak", "???", 
									"Problem is, I don’t know anyone who can help me practice. Luckily for me, you’re here! Nothing like the real deal to help me get into character!",
									"Speak", "???", 
									"I would really appreciate having someone like you to practice with. Will you help me? Don’t worry about being bad. I’ll provide you with some practical tips on acting and I am confident that you will do alright. So, what do you say?",
									"JumpToScene",
									"Help?"
									  ]
					},
					{
                        "NameOfScene": "Help?",
                        "theScene": [ "Menu",
									  "I’m kinda busy",
									  "Help her",
									  "EndLoop"
									  ]
					},
					{
                        "NameOfScene": "Help her",
                        "theScene": [
									"Speak", "???",
									"Great! I will not go back on my word! I will forgive you and let you go on your way after helping me with this scene.",
									"JumpToScene",
									"Help Act Intro"
									  ]
					},
					{
                        "NameOfScene": "I’m kinda busy",
                        "theScene": [ 
									"ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
									"Speak", "???",
									"Ok, that’s fine. I guess I will just stay here, after you've hurt my feelings and insulted me. Maybe I will go rape and kidnap some adventurers looking for the Demon Queen and tell the Black Knight to blow up the docks or something~.",
									"Speak", "???",
									"Yah, that will definitely~ make me feel better, like the criminal and pervert that I am. It’s okay, you can go. I’ll forget any of this ever happened.",
									"She closes her eyes, moving her head forcefully to the side with an exaggerated pout. From time to time she opens her eyes to check if you left but every time you look at her she closes her eyes again and makes an exaggerated hmph while turning away from you.",
									"JumpToScene",
									"Help?"
									  ]
					},
					{
                        "NameOfScene": "Help Act Intro",
                        "theScene": [ 
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									"Cheerfully, she goes over to her stack of scripts and hands one of them over to you. She runs through the scene with you and informs you of your role as an aventurer, captured by the Black Knight.",
									"JumpToScene",
									"Help Act Opening -Initial"
							]
					},
					{
                        "NameOfScene": "Help Act Opening -Initial",
                        "theScene": [
									"ChangeBGM-NoFade", "music/Caverns/Stalwick_-_Dreaming.mp3",
									"ProgressEqualsOrGreater","1","Help Act Lewd -Consequent", 
									"After getting kidnapped by the Black Knight you spent days being humiliated and sexually edged, until you gave in and begged for sweet release. Miraculously, on the fifth day of captivity the recall stone began working again, sending you back to church.",
									"Feeling miserable and defeated, you went to the bar and drank away your sorrow. {w}While drinking, a bunch of elves sat next to you, drunk beyond any doubt.",
									"They spent half an hour with their hands in your pants fishing for your dick and stroking it while taking turns kissing you deeply. You used them as an opportunity to mend your wounded pride and manliness, fucking them silly.", 
									"However, you knew that at your current state you would not succeed at defeating the Demon Queen.",
									"You lost yourself in training, throwing yourself at every monster girl you could grab your hands on. Harpies, elves, succubi, slimes, anything that could be fucked, you fucked. You spent everyday, waking up at the wake of dawn, swinging your dildo, and practicing your thrusts.",
									"You barely held on to your sanity.", 
									"But after a week you finally completed your training, coming out the other end, faster… stronger… smarter… sexier. You honed your technique to the utmost limit, able to make girls drip with arousal with just your touch.",
									"After climbing the treacherous mountain fending off various assailants, you finally found the enemy’s encampment. However, before you were able to attack the enemy, you got spotted. Which brings us back to the present.",
									"JumpToScene",
									"Help Act Lewd -Initial"
							]
					},
					{
                        "NameOfScene": "Help Act Lewd -Initial",
						"theScene": [ 
									"ChangeBGM-NoFade", "music/Battle/agitating-point.mp3",
									"Speak", "???", 
									"Foolish Adventurer! You dare return to oppose the demon queen? You should have stayed in town and never looked back. Have you not learned your place when the Black Knight milked you dry and humiliated you in front of us all?",
									"Speak", "???", 
									"The way you were moaning like a girl and thrusting SOOO desperately was really pathetic. HAHA! Not to mention that pleasure melted expression you had! Oh, just perfect! BWAHAHA!",
									"ChangeBGM-NoFade", "music/Battle/Comet_Highway.mp3",
									"The monster girl licks her lips and gets down on all fours while locking her eyes on to yours. She growls like a predator, circling around, trying to analyze your movements. Whenever she moved left you moved right, whenever she moved right you moved left. This went on and on, locking you both into performing a sort of impromptu dance.", 
									"She breaks the dance first and lunges towards you only to miss as you evade her.",
									"She lunges again but misses, as you sidestep away. She lands on the ground and uses her momentum to perform a leg sweep. You jump backwards and evade, but she stands up and seamlessly transitions into unleashing a flurry of swipes! You weave your body in and out of her attacks at close range, grabbing her wrists and pinning her down to the ground! The monster girl struggles against your hold.",
									"Speak", "???",
									"Let go! Bastard! When did you get so strong?",
									"You smile at gaining the upper hand but suddenly she breathes out a plume of fire into your face!",
								
									"ChangeArousalByPercent", "75",
									"You find yourself shivering in arousal, releasing your grip on her, crashing on the ground. She gets up and quickly straddles your waist.",
									"ChangeBGM-NoFade", "music/Loss/reason.mp3", 
									"Speak", "???",
									"Fool! You were careless!",
									"ChangeArousalByPercent", "20",
									"ChangeArousalByPercent", "5",
									"She pushes her face closer, bringing her mouth to your ear as she breathes out a flame, causing you to shiver with arousal and your ears to flush red. She lightly nibbles on your ear with her soft lips, playfully tugging and teasing as you let out gasps of arousal. She kisses your cheek leaving a tingly warm sensation from the point of contact as you breathe heavily and pitch a tent in your pants.",
									"Speak", "???",
									"Ha. How cute~{color=#e80cc0}♥{/color} Looks like this is the end!",
									"Is this really the end? Is this what all those days of hard training led up to? Defeated by a lowly grunt and being a slave to pleasure?",
									"ChangeBGM-NoFade", "music/Battle/Battel-LunaticDance.mp3", 
									"No! In defiance, you summon whatever strength you have and power through the arousal!",
									"You grab a hold of her, roll to the side, and get on top.",
									"Speak", "???",
									"What? That’s impossible! You shouldn’t be able to do anything right now!",
									"ChangeArousalQuietly","20",
									"You shut her up with a breathless kiss.",
									"ChangeBGM-NoFade", "music/Casino/BGM sweet smell.mp3", 
									"Speak", "???",
									"*Ch* MPH?! *tsk ch tsk* MHH! NMU! *ch tsk slurp*",
									"She lets out an initial cry of surprise before shifting to one of defiance, only for it to end up muffled by your inter locked lips. Squirming under you, she tries to pry your lips from her mouth and push you away. But you don’t let her, doubling your efforts and securing your hold. Her struggling only compounds the amount of oxygen lost as she starts getting light headed, her eyes rolling up, and her vision hazy.",
									"Her earlier protests melt, relaxing her grip as the tension leaves from her body. You end the kiss. Pursing your lips together, you suck along the length of her tongue, pulling it out of her mouth as her head follows after you, braking away with an audible pop.",
									"Speak", "???",
									"tssskkkkkk, PWAH!!!{color=#e80cc0}♥♥♥{/color} Huff~ Huff~… hah…ha…bastard~ Hah... ha…~",
									
									"You both take deep breaths trying to get as much oxygen back into your lungs. Recovering first, you bring your mouth to the side of her face and with a sensual flare you kiss her on the cheek, traveling down her neck leaving a blazing trail of kisses.",
									"Every time your lips touch her sensitive skin, she shivers with arousal, letting out soft whimpers. Wasting no time, you cop a feel and assertively knead her breasts eliciting low moans as her nipples stiffen between your fingers. Pinching them, you carefully lift her boobs up into the air, letting them hang for a moment before releasing them as gravity takes over, plopping them back down to her chest.",
									"Speak", "???",
									"OOOH~{color=#e80cc0}♥{/color}",
									"You look at the monster girl, her expression slack with arousal and her tongue lolling out of her mouth. Her dazzling, heterochromic, crystal clear eyes, glazed over and her cheeks tinged with smoldering heat, as sweat covers her entire body.",
									"ChangeArousalQuietly","30", 
									"In between her thighs you notice a trail of her juices, running down her legs coming from her wet slit.",
									"With every labored breath she takes you can’t help but stare at her large perky breasts as her chest rhythmically heaves up and down.",
									"ChangeArousalQuietly","30", 
									"Seeing this alluring sight, your body can’t help responding on a primal level with your cock painfully erect, straining the confines of your pants.",
									"Placing both your hands on her cheeks, you both lock lips. Your tongues intertwine; the both of you vying for dominance as she wraps her arms around the back of your neck.",
									"ChangeArousalQuietly","20",
									"Speak", "???",
									"Mnff *tsk ch* mngh{color=#e80cc0}♥{/color} *tsk tsk slurp* MNN… {color=#e80cc0}♥{/color}*ch ch tssskkkkk* Mwaaahh{color=#e80cc0}♥♥♥{/color}", 
									"Noticing her significantly more enthusiastic reaction you are determined not to lose control, aggressively caressing, teasing, and sucking on her tongue, while making sure to caress every square inch of the inside of her mouth.",
									"While pressing your body weight on to her, you move your leg in between hers, pressing your knee into her pussy. You slowly grind into her, causing her pussy to secrete more and more juices as her legs instinctively clamp together while she moans loudly.",
									"You break the kiss as you pull out your cock. Slowly but surely you move it closer and closer to her drenched slit. You tease the entrance of her pussy. Brushing its’ entire length up and down, coating it in her juices and giving her playful pokes with the tip.", 
									"You tower over her, {w}remembering all the humiliation you went through at the hands of the enemy. {w}All those days spent honing your skills {w}and fucking anything with a vagina. {w}A wave of glee washes over you and a devious grin gets plastered on your face as your revenge draws closer and closer.",
									"JumpToScene",
									"First Act End"
						]
					},
					{
                        "NameOfScene": "Help Act Lewd -Consequent",
						"theScene": [
									"ChangeBGM-NoFade", "music/Battle/agitating-point.mp3",
									"Speaks",
									"Foolish Adventurer! You dare return to oppose the demon queen? You should have stayed in town and never looked back. Have you not learned your place when the Black Knight milked you dry and humiliated you in front of us all?",
									"Speaks", 
									"The way you were moaning like a girl and thrusting SOOO desperately was really pathetic. HAHA! Not to mention that pleasure melted expression you had! Oh, just perfect! BWAHAHA!", 
									"ChangeBGM-NoFade", "music/Battle/Comet_Highway.mp3",
									"The monster girl licks her lips and gets down on all fours while locking her eyes on to yours. She growls like a predator, circling around, trying to analyze your movements. Whenever she moved left you moved right, whenever she moved right you moved left. This went on and on, locking you both into performing an impromptu dance.", 
									"She breaks the dance first and lunges towards you only to miss as you evade her.",
									"She lunges again but misses, as you sidestep away. She lands on the ground and uses her momentum to perform a leg sweep. You jump backwards and evade, but she stands up and seamlessly transitions into unleashing a flurry of swipes! You weave your body in and out of her attacks at close range, grabbing her wrists and pinning her down to the ground! The monster girl struggles against your hold.",
									"Speaks",
									"Let go! Bastard! When did you get so strong?",
									"You smile at gaining the upper hand but suddenly she breathes out a plume of fire into your face!",
								
									"ChangeArousalByPercent", "75",
									"You find yourself shivering in arousal, releasing your grip on her, crashing on the ground. She gets up and quickly straddles your waist.",
									"ChangeBGM", "music/Loss/reason.mp3", 
									"Speaks",
									"Fool! You were careless!",
									"ChangeArousalByPercent", "20",
									"ChangeArousalByPercent", "5",
									"She pushes her face closer, bringing her mouth to your ear as she breathes out a flame, causing you to shiver with arousal and your ears to flush red. She lightly nibbles on your ear with her soft lips, playfully tugging and teasing as you let out gasps of arousal. She kisses your cheek leaving a tingly warm sensation from the point of contact as you breathe heavily and pitch a tent in your pants.",
									"Speaks",
									"Ha, how cute~{color=#e80cc0}♥{/color} Looks like this is the end!",
									"Is this really the end? Is this what all those days of hard training led up to? Defeated by a lowly grunt and being a slave to pleasure?",
									"ChangeBGM-NoFade", "music/Battle/Battel-LunaticDance.mp3", 
									"No! In defiance, you summon whatever strength you have and power through the arousal!",
									 
									"You grab a hold of her, roll to the side, and get on top.",
									"Speaks",
									"What? That’s impossible! You shouldn’t be able to do anything right now!",
									"ChangeArousalQuietly","20",
									"You shut her up with a breathless kiss.",
									"ChangeBGM-NoFade", "music/Casino/BGM sweet smell.mp3", 
									"Speaks",
									"*Ch* MPH?! *tsk ch tsk* MHH! NMU! *ch tsk slurp*",
									"She lets out an initial cry of surprise before shifting to one of defiance, only for it to end up muffled by your inter locked lips. Squirming under you, she tries to pry your lips from her mouth and push you away. But you don’t let her, doubling your efforts and securing your hold. Her struggling only compounds the amount of oxygen lost as she starts getting light headed, her eyes rolling up, and her vision hazy.",
									"Her earlier protests melt, relaxing her grip as the tension leaves from her body. You end the kiss. Pursing your lips together, you suck along the length of her tongue, pulling it out of her mouth as her head follows after you, braking away with an audible pop.",
									"Speaks",
									"tssskkkkkk, PWAH!!!{color=#e80cc0}♥♥♥{/color} Huff~ Huff~… hah…ha…bastard~ Hah... ha…~",
									
									"You both take deep breaths trying to get as much oxygen back into your lungs. Recovering first, you bring your mouth to the side of her face and with a sensual flare you kiss her on the cheek, traveling down her neck leaving a blazing trail of kisses.",
									"Every time your lips touch her sensitive skin, she shivers with arousal, letting out soft whimpers. Wasting no time, you cop a feel and assertively knead her breasts eliciting low moans as her nipples stiffen between your fingers. Pinching them, you carefully lift her boobs up into the air, letting them hang for a moment before releasing them as gravity takes over, plopping them back down to her chest.",
									"Speaks",
									"OOOH~{color=#e80cc0}♥{/color}",
									"You look at the monster girl, her expression slack with arousal and her tongue lolling out of her mouth. Her dazzling, heterochromic, crystal clear eyes, glazed over and her cheeks tinged with smoldering heat, as sweat covers her entire body.",
									"ChangeArousalQuietly","30", 
									"In between her thighs you notice a trail of her juices, running down her legs coming from her wet slit.",
									"With every labored breath she takes you can’t help but stare at her large perky breasts as her chest rhythmically heaves up and down.",
									"ChangeArousalQuietly","30", 
									"Seeing this alluring sight, your body can’t help responding on a primal level with your cock painfully erect, straining the confines of your pants.",
									"Placing both your hands on her cheeks, you both lock lips. Your tongues intertwine, the both of you vying for dominance as she wraps her arms around the back of your neck.",
									"ChangeArousalQuietly","20", 
									"Noticing her significantly more enthusiastic reaction you are determined not to lose control, aggressively caressing, teasing, and sucking on her tongue, while making sure to caress every square inch of the inside of her mouth.",
									"Speaks",
									"Mnff *tsk ch*  mngh{color=#e80cc0}♥{/color}*tsk tsk slurp*  MNN… {color=#e80cc0}♥{/color}*ch ch tssskkkkk*Mwaaahh{color=#e80cc0}♥♥♥{/color}",
									"You both melt into each other, shivering in ecstasy, moaning into each other’s mouth.",
									"In response you press your body weight on to her and move your leg in between hers, pressing your knee into her pussy. You slowly grind into her, causing her pussy to secrete more and more juices as her legs instinctively clamp together as she moans loudly.",
									"You break the kiss as you pull out your dildo. Slowly but surely you move it closer and closer to her drenched slit. You tease the entrance of her pussy. Brushing its’ entire length up and down, coating it in her juices and giving her playful pokes with the tip.", 
									"You tower over her, {w}remembering all the humiliation you went through at the hands of the enemy. {w}All those days spent honing your skills {w}and fucking anything with a vagina. {w}A wave of glee washes over you and a devious grin gets plastered on your face as your revenge draws closer and closer.",
									"JumpToScene",
									"Consequent Act End"
						]
					},
					{
                        "NameOfScene": "First Act End",
						"theScene": [
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Gaming Sound FX - Record Scratch - Sound Effect (HD).mp3",
									"StopBGM",
									"Speak", "???",
									"{color=#c280ff}Kyaa!!! I can’t!{/color}",
									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Tense - Melancholia (1_24) 96bpm.mp3",
								
									"PlayVisualEffect","RepeatingPulse","pink.png",
									"Out of nowhere, you get bitten by her snake tail followed by your whole body going limp and falling on top of her. Teary eyed, she pushes you away and retreats backwards clutching her knees to her chest, and wrapping herself up in her wings…",
									"EndVisualEffect", 
									"ChangeBGM-NoFade", "music/Loss/Do not yarn.mp3", 
									"Speak", "???",
									"{color=#c280ff}I can’t do this. T-things all just felt t-too real! This is all too much for me!{/color}",
									"Speak", "???",
									"{color=#f2eca1}Oh come on! It’s just sex! There is nothing to be afraid of!{/color}",
									"Speak", "???",
									"{color=#f46264}It’s perfectly normal for a monster girls to have sex with random adventurers.{/color}",
									"Speak", "???",
									"{color=#c280ff}T-that is not the point! I-I just don’t feel comfortable doing it straight away with someone I don’t even know.{/color}",
									"Speak", "???",
									"{color=#f2eca1}Great! Now he must think we’re a total weirdo for talking to ourselves!{/color}",
									"Speak", "???",
									"{color=#69b3f7}Too bad, he was really good looking~, and it was all going so well too~.{/color}",
									"Speak", "???",
									"{color=#f2eca1}Urgh. Let’s just go!{/color}",
									"She stands up and approaches you.",
									"Speak", "???",
									"{color=#69b3f7}Sorry for all this~. I guess we just aren’t ready enough to handle you~.{/color}",
									"Speak", "???",
									"{color=#f46264}I’ll keep my word, consider what happened earlier as water under the bridge. You don’t have to come back anymore.{/color}",
									"Speak", "???",
									"{color=#c280ff}Sorry… f-for freaking you out … and pa-paralyzing you with my snake tail.{/color}",
									"Speak", "???",
									"{color=#c280ff}The numb feeling will wear off in uh… about an hour.{/color}",
									"Speak", "???",
									"{color=#f2eca1}If you EVER accuse me of doing those things. We WILL know and we WILL fight back!{/color}",
									"Speak", "???",
									"{color=#c280ff}Le-legally speaking of course!{/color}",
									"DisplayCharacters",
									"EndLoop", 
									"She moves out of your sight and a few moments later you hear the sound of dust being kicked up in the air and the flapping of wings.",
									"You lie on the ground with your head facing the sky, body still limp, all alone with your thoughts. You look back on all the events that led up to this point, the odd scorch marks, the weird looking monster girl, and her even weirder goodbye. With nothing else left to do you look at the sky and watch the clouds praying that you don’t get attacked and taken away by monster girls.",
									"…",
									"RefreshPlayer",
									"After a while the paralysis wears off and your body starts coming back to life. You get up and move on.",
									"StopBGM", 
									"ChangeProgress", "1",
						
									"SetChoice", "1", "FirstActOver"
						]
					},
					{
                        "NameOfScene": "Consequent Encounters",
						"theScene": [
									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Emotional - Darkness (1_55) 94bpm.mp3",
									"As you steadily trek along the mountain trail you come across a patch of scorched earth.",
									"You briefly look around for the source of the marks, but to no avail. In your search, you find several rocks sandwiched together by two mountain flanks. You could probably climb on top of them.",
									"Menu",
									"Climb the dubious rocks",
						
									"Continue along the trail",
									"EndLoop"
						]
					},
					{
                        "NameOfScene": "Consequent Intro First Half",
						"theScene": [
									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Emotional - Darkness (1_55) 94bpm.mp3",
									"IfChoice","1","NOPE","NOPE",
									"As you continue along the trail you encounter more and more scorch marks. You travel further and further, following the scorch marks, when suddenly you hear a woman’s voice. You follow the sound as it gradually becomes more and more distinct.",
									"DisplayCharacters",
									"1",
									"EndLoop",  
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									"Finally, you locate the source of the sound and see an amalgamous looking monster girl, acting out scenes from a script.", 
									"You call out to her, announcing your presence as you walk towards her.",
									"ProgressEquals", "1", "Second Intro",
									"IfChoice","1","KnowsPersonalities","Third Intro -Knows",
								
									"ProgressEqualsOrGreater", "2", "Third Intro -Dont Know Thing"
						]
					},
					{
                        "NameOfScene": "Second Intro",
						"theScene": [
									"ChangeBGM-NoFade", "music/Forest/nandesuto.mp3",
									"Speak", "???",
									"Hm?... O-oh! Y-you came back?!",
									"She quickly stands up, dropping her script as her eyes dart around, getting flustered as you get closer to her, before finally stopping infront of her.",
									"Speak", "???",
									"Um, H-hi! I thought you'd be uh, mad at me for what happened before, o-or be too weirded out haha..",
									"Speak", "???", 
									"W-What are you doing here? Oh! uh m-my name is {b}Alyssa{/b} by the way.",
									"Speaks",
									"W-what’s yours?",
									"You give your name and properly introduce yourself. She nods in acknowledgement before adjusting her posture and clearing her throat.",
									"Speaks",
									"Nice to properly meet you {ThePlayerName}. So. What made you come all the way out here?",
									"ChangeProgress","1",
									"Menu",
									"About the accusations…",
									"To check if you were okay",
									"To continue where we left off in our “acting” session",
									"EndLoop"

						]
					},
					{
                        "NameOfScene": "About the accusations…",
						"theScene": [
									"Speaks",
									"Oh, that.",
									"Speaks", 
									"Don’t worry. Like I said before, all water under the bridge. I forgive you for whatever you thought I did.",
									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Tense - Melancholia (1_24) 96bpm.mp3", 
									"Speaks",
									"Granted of course that you DON’T report me for false crimes OR spread false rumors about me.",
									"She looks at you intensely, staring into your eyes as if confirming you understood her.",
									"ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
									"Before relaxing her gaze as you let out a sigh of relief.",
									"JumpToScene",
									"Second Intro Cont"
						]
					},
					{
                        "NameOfScene": "To check if you were okay",
						"theScene": [
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Metal Gear Solid - Exclamation Point Sound Effect.mp3",
									"Speaks", 
									"FWEH?!",
									"She lets out a strange noise before looking down to the ground with her flush face.",
									"Speaks",  
									"O-Oh you were worried about me? T-thanks, I‘m alright now. Sorry for bailing on you.",
									"Speaks",  
									"It’s just that… that was my first time acting with an adventurer and I got lost in the moment and let things get a little carried away. I didn’t mean for things to get so … heated when I asked you to help me with acting, honest!",
									"Speak", "???", 
									"I’m sorry if it seemed like I was leading you on. Asking you to help me with my problems was probably too much of an ask anyway. S-Sorry.",
									"JumpToScene",
									"Second Intro Cont"
						]
					},
					{
                        "NameOfScene": "To continue where we left off in our “acting” session",
						"theScene": [
									"The moment when you bring the matter up, her face gets dyed in a deep crimson as she looks off to the side.",
									"Speaks", 
									"Oh! You see uhh… I think you have the wrong idea. I am not really all that comfortable being that uhh… {i}intimate{/i} with you, someone I don’t even know…",
									"ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3", 
									"Speaks", 
									"Even if you are REALLY good looking~ and made me feel REEAALLY good~{color=#e80cc0}♥{/color}.",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									"Her face blushes even harder as she looks at the ground after realizing what she just said.", 
									"JumpToScene",
									"Second Intro Cont"
						]
					},
					{
                        "NameOfScene": "To continue where we left off in our “acting” session -Knows",
						"theScene": [
									"The moment when you bring the matter up, her face gets dyed in a deep crimson as she looks off to the side.",
									"Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									"{color=#c280ff}Oh! You see uhh… I-I am not really all that comfortable being that {i}intimate{/i} with you y-yet.{/color}",
									"ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3", 
									"Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									"{color=#69b3f7}Even if you are REALLY good looking~ and made me feel REEAALLY good~{/color}{color=#e80cc0}♥{/color}{color=#69b3f7}.{/color}",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									"Her face blushes even harder as she looks at the ground after realizing what she just said.", 
									"JumpToScene",
									"Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Second Intro Cont",
						"theScene": [
									  "Speaks", 
									  "*Ahem*",
									  "Speaks", 
									  "Will that be all?",
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Third Intro -Dont Know Thing",
						"theScene": [
									  "Speaks", 		  
									  "Hm? Oh, it's you.",
									  "She stops what she was doing and puts down her script.",
									  "Speaks", 
									  "Anything I can help you with?",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Intro Interaction Menu",
						"theScene": [
									  "Menu",
									  "Talk",
									  "Sex?",
									  "Help her with acting",
									  "Leave",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Talk",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","Talk Menu -Knows Buffer",
									  "Menu",
									  "About her",
									  "About acting",
									  "Back",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Sex?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","Sex Menu -Buffer",
									  "JumpToScene",
									  "To continue where we left off in our “acting” session"
						]
					},
					{
                        "NameOfScene": "Help her with acting",
						"theScene": [
									  "IfChoice","1","SecondActOver","Help Act Intro - Dont Know",
									  "IfChoice","1","KnowsPersonalities","Help Act Intro - Knows",
	
									  "Speaks",
									  "Oh? You want to help me with my acting? Hm... I definitely could use the practice, and he WAS very convinving, b-but what if things go too far? W-what if he gets the wrong idea and tries something?",
									  "She walks back and forth all the while mumbling to herself.",
									  "After a short momment she stops and faces you.",
									  "ProgressEqualsOrGreater", "5", "Help Again-Success",
									  "Speaks",
									  "H-hey, uh, I think I let things go a little too far last time, so I think we should um, get to know each other first before acting again.",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Help Again-Success",
						"theScene": [
									  "Speaks",
									  "Fine lets do it. but d-don't get the wrong idea or anything, we're just going to practise and thats it, got it? No funny business!",
									  "Speaks", 
									  "I-I don’t want things to get out of hand again, so we're going to do things properly, S-so I hope you're fine with, um, using this d-dildo instead. So what do you say?",
									  "JumpToScene",
									  "Help Act Menu"
									  
						]
					},
					{
                        "NameOfScene": "Help Act Intro - Dont Know",
						"theScene": [
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
									  "Speaks",
									  "Oh you want to help me with my acting? It's fine, you don’t {i}HAVE{/i} to help me, I’m perfectly capable of practicing on my own...but if you did and I am {b}not{/b} saying I want you to, but if you did, I would certainly accept it. Hmph",
									  "JumpToScene",
									  "Help Act Menu"
									  
						]
					},
					{
                        "NameOfScene": "Help Act Intro - Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}You want to help me with acting? Alright! You ready?{/color}",
									  "JumpToScene",
									  "Help Act Menu"
						]
					},
					{
                        "NameOfScene": "Help Act Menu",
						"theScene": [
									  "Menu",
									  "'Maybe some other time'",
									  "'Let's Do It'",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "'Maybe some other time'",
						"theScene": [
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									  "IfChoice","1","KnowsPersonalities","Maybe some other time -Knows",
									  "Speaks",
									  "Right, I'm sure you must be very busy.",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Maybe some other time -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}Right, I'm sure you must be very busy.{/color}",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "'Let's Do It'",
						"theScene": [
									  "JumpToScene",
									  "Help Act Intro"
						]
					},
					{
                        "NameOfScene": "Consequent Act End",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","Consequent Act End -Knows",
									  "ProgressEqualsOrGreater","21","Consequent Act End -High Affinity",
									  "PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Metal Gear Solid - Exclamation Point Sound Effect.mp3",
									  
									  "But then before you can do anything else, her snake tail pops into your face and hisses at you.",
									  "Speaks",	
									  "I-I think this is enough huff huff… Mmm W-we should stop here…hah",
									  "RefreshPlayer",
									  "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									  "You are brought back to reality and you both slowly get back up. She turns away from you straightening her clothes and fixing her hair while you do the same. As you get dressed you notice her sneaking glances at you. Finally you both get dressed.",
									  "Speaks", 
									  "Thanks for umm helping me practice …you were really helpful. I uhh thought you were really convincing and I learned a lot about adventurers.",
									  "ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3",  
									  "Speaks", 
									  "Like just how {b}strong{/b} and {b}assertive{/b} they can be~ {color=#e80cc0}♥{/color}",
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									  "She blushes once again. After a while you both cool down.",
									  "Speaks",
									  "So. What else do you want to do?",
									  "SetChoice","1","SecondActOver",
									  "ChangeProgress", "3",
							   		  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Consequent Act End -High Affinity",
						"theScene": [
								 	  "For a moment you look at her face searching for confirmation.",
									  "Speaks",
									  "Hah… hah… Go on, {b}fucker{/b} hah… hah… do your worst, I {b}dare{/b} ya~{color=#e80cc0}♥{/color}",
									  "You nod and proceed to push the dildo in, burying it deep inside her tight pussy, making her tense and gasp in arousal.",
									  "Her gaze drifts to your hand, following it as you slowly slide the dildo out of her pussy.",	
									  "Her pussy affectionately clings to its length like a lover, refusing to let go, while letting out more of her juices; before you jam it back in, all in one go.",
									  "Her head arches backwards as she quivers and loudly moans.",
 									  "With long strokes, you thrust it in and out of her pussy before picking up the pace, pistoning her, until with a final thrust you slam the dildo into her pussy as she screams with pleasure, quivering hard from climax. You slowly pull out the dildo and set it aside.",
									  "Speaks",
									  "hah hah… that was a-amazhing{color=#e80cc0}♥{/color}~ hah hah",
									  "RefreshPlayer",
									  "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									  "You both get up and clean up after yourselves, straightening out your clothes and fixing your hair. As you get dressed you notice her sneaking glances at you. Finally you both get dressed.", 
									  "Speaks",
									  "um, T-Thanks... it felt really good…",
									  "She furiously blushes and meekly looks down. After an awkward silence you both cool down.",
									  "Speaks",
									  "So, what else do you want to do?",
									  "ChangeProgress", "3",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Leave",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","Leave - Knows",
									  "DisplayCharacters",
									  "EndLoop", 
									  "You decide to leave and exchange goodbyes, continuing along the trail and resume your trek.",
									  "StopBGM"

						]
					},
					{
                        "NameOfScene": "Third Intro -Knows",
						"theScene": [
									  "JumpToRandomScene",
									  "Goat Intro",
									  "Lion Intro",
									  "Snake Intro",
									  "Dragon Intro",
									  "EndLoop"
							

						]
					},
					{
                        "NameOfScene": "Goat Intro",
						"theScene": [
									  "PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Icky Squish (Anime Sound) - Sound Effect for editing.mp3",
									  "ChangeArousalQuietly","10", 
									  "She is initially surprised upon seeing you, but quickly changes to a warm smile as she waves her hand and goes over to you, immediately bringing you into a tight hug. Surprised by the sudden intimacy, you can’t help but notice the softness of her breasts as they press into your chest, before finally releasing you from her embrace.",
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}Nice to see you again~. What made you come all the way out here? Was it me?~{/color}",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Lion Intro",
						"theScene": [
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Yo, {ThePlayerName}, what’s up?{/color}",
									  "She greets you before you're able to say anything, showing a toothy smile with her ears perked up and twitching happily.",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Snake Intro",
						"theScene": [
								   	  "She nervously fidgets and pushes her things to the side.",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}H-hi! I was uhh just practicing my lines… I was really hoping to see you again.{/color}",
									  "Her face blushes a little as she shyly plays with her hair and fidgets in place.",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}S-so, what brings you here?{/color}",
									  "JumpToScene",
									  "Intro Interaction Menu"

						]
					},
					{
                        "NameOfScene": "Dragon Intro",
						"theScene": [
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 		  
									  "{color=#f46264}Hm? Oh, it's you.{/color}",
									  "She stops what she was doing and puts down her script.",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Anything I can help you with?{/color}",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Talk Menu -Knows Buffer",
						"theScene": [
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
							 		  "{color=#c280ff}O-oh! You want to talk? Sure, what do you want to talk about?{/color}",
									  "JumpToScene",
									  "Talk Menu -Knows"
						]
					},
					{
                        "NameOfScene": "Talk Menu -Knows",
						"theScene": [
									  "Menu",
									  "About her",
									  "About acting",
									  "Back",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Sex Menu -Buffer",
						"theScene": [
									  "IfChoice","3","Reason knows","Sex Menu -Buffer2",
									  "JumpToScene",
									  "To continue where we left off in our “acting” session -Knows"
						]
					},
					{
                        "NameOfScene": "Sex Menu -Buffer2",
						"theScene": [
									  "ProgressEqualsOrGreater", "41", "Sex Menu",
									  "JumpToScene",
									  "To continue where we left off in our “acting” session -Knows"
						]
					},
					{
                        "NameOfScene": "Sex Menu",
						"theScene": [
									  "Menu",
									  "Hug her",
									  "Kiss her",
									  "Blowjob",
									  "Sex{color=#e80cc0}♥♥♥{/color}",
									  "Back",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Back",
						"theScene": [
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Consequent Act End -Knows",
						"theScene": [
									  "You can't take it anymore, swiftly unbuttoning your pants and pulling out your painfully erect cock. You raise her legs and get into the mating press position. Somehow throughout your lust clouded mind, you find it within yourself to stop and look at the monster girl.",
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Hah… hah… Go on, {b}fucker~{/b}{/color}{color=#e80cc0}♥{/color}{color=#f2eca1} hah… hah… do your worst, I {b}dare{/b} ya~{/color}{color=#e80cc0}♥{/color}{color=#f2eca1}.{/color}",
									  "ChangeArousalQuietly","20", 
									  "You smile before plunging your cock inside her pussy as she tenses and gasps with pleasure.",
									  "ChangeArousalQuietly","30",
									  "You start pounding away at her as she wraps her arms around your back, with each thrust striking her cervix and causing her to shiver and moan.", 
									  "ChangeArousalQuietly","45", 
									  "Pleasure starts to mount in your body as your arousal builds and builds threatening to bubble over. You pick up the pace as you near the end of your rope, making her moan louder.", 
									  "PlayerOrgasmNoSpiritLoss",
									  "You pull her in a sudden deep kiss and with a final thrust, you both orgasm as you hilt yourself into her vagina flooding her womb with your molten hot seed spurting thick ropes of cum into her.",
									  
									  "You both take a moment to come off from each of your respective highs, indulging in each other's warmth, until eventually the pleasure ebbs away.",
									  "RefreshPlayer",
									  "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",  
									  "You both stur and get up, straigthening out your clothes and fix your hair. At the corner of your eye you can see Alyssa occasionally stealing glances at you. Finally you both get dressed.",
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}Wow~, that was incredible~{/color}{color=#e80cc0}♥{/color}{color=#69b3f7}.{/color} {color=#69b3f7}You really went ahead and showed me~{/color}{color=#e80cc0}♥{/color}{color=#69b3f7}.{/color}",
									  "She turns in place, as she looks at you with flushed cheeks and a content smile.",
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}So what do you want to do next?{/color}",
									  "ChangeProgress", "3",
									  "JumpToScene",
									  "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Blowjob",
						"theScene": [
									 "ChangeBGM-NoFade", "music/Casino/07　After the act.mp3", 
									 "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									 "{color=#69b3f7}Oh~? hehe You want me to give you a blowjob? Alright then~ Anything for you~{/color}{color=#e80cc0}♥{/color}",
									 "ChangeArousalQuietly","10",
									 "She smiles and seductively walks towards you, each step swinging her curvy hips as she stretches her long slender legs.",
									 "ChangeArousalByPercent", "15",
									 "Casually, she places her hands on your shoulders, caressing you and gently running her fingers down your body as she repeatedly kisses you, gasping into your mouth with her flaming breath, raising your internal body temperature.",
									 "ChangeArousalQuietly","10",
									 "Her hand makes it's way down to your crotch and unzips your pants, freeing your straining cock as it twitches in the cold open air.", 
									 "ChangeArousalQuietly","5",
									 "She runs her hands under your shirt, caressing your stomach and your torso as she skilfully takes off your top. Suddenly, she breaks the kissing session and pushes you down into an upright seated position.", 
									 "ChangeArousalByPercent", "20",
									 "She then breathes out a plume of fire, making you shiver with arousal as your skin feels so sensitive to even the lightest touch and your already erect penis starts throbbing.",
									 "ChangeArousalQuietly","20",
									 "She takes off her top before getting on top your lap and presses her ample chest onto yours in a tight hug.",
									 "ChangeArousalQuietly","15", 
									 "Your over-sensitive body jumps from the sudden skin to skin contact, causing you to let out an involuntary moan, as a warm sensation spreads throughout your chest.", 
									 "ChangeArousalQuietly","25", 
									 "She blows a small flame into your ear, before breaking the hug and placing her hand onto the base of your shaft.",
									 "ChangeArousalQuietly","30",
									 "She starts giving it several molten hot kisses, before gradually making her way to the top, upon which she gives your cock head a final passionate kiss.", 
									 "She sucks and nibbles on your cock causing her to secrete her venomous saliva, as bubbles begin to form from her mouth, before lathering your cock with her tongue and running through it's entire length. She lets the pleasure build, heating the inside of her mouth with her fiery breath as she bobs her head up and down your shaft.", 
									 "ChangeArousalQuietly","50",
									 "You try to hold out for as long as you can but the pleasure soon proves to be too much as your climax draws near. Sensing your impending climax she goes in harder, relentlessly sucking and bobbing her head coaxing you to spurt your load into her mouth.",
									 "PlayerOrgasmNoSpiritLoss",
									 "You grab the sides of her head and keel over, unleashing a torrent of cum and depositing it stragiht into her mouth as she makes several audible gulps trying to swallow it all.", 
									 "After a while your orgasm eventually dies down, as the tension leaves your body. You let go of her head as she sucks your cock in one long drawn out motion, making a wet pop as she lets out a satisfied gasp.",
									 "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									 "{color=#69b3f7}MMM… delicious~{/color}{color=#e80cc0}♥{/color}",
									 "RefreshPlayer",
									 "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									 "You stay seated for a while as you recover from your orgasm before suddenly being handed your shirt. You eventually get dressed and straighten out your clothes. You finally get dressed before approaching her ounce again and deciding on what to do next.",
									 "JumpToScene",
									 "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Sex{color=#e80cc0}♥♥♥{/color}",
						"theScene": [
									 "ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3",
									 "ChangeArousalByPercent","5", 
									 "Upon hearing your proposal her face turns bright red as she looks down at the ground. She turns around and strips off her clothes, unceremoniously dropping them on the ground. She then gets down on all fours, raising her ass into the air giving it an enticing wiggle as her juices drip down her thigh.",
									 "You stand there rooted on the spot, stunned by her brazen display of arousal. She looks over her shoulder with a deep blush.",
									 "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									 "{color=#f46264}C-Come on. Don’t just stand there. Ugh, T-this is so embarrassing…{/color}",
									 "Her words snap you back to reality as you frantically take off your clothes, freeing your erect cock and move towards her. You firmly grasp her hip, aligning your dick with her drooling slit as her snake tail wraps around your waist, before gently penetrating her.",
									 "ChangeArousalByPercent","10",
									 "She tenses, her tail giving you a sudden squeeze while she shivers in bliss, letting out a cute gasp before covering it up with her hand.",
									 "ChangeArousalByPercent","15",
									 "You place both of your hands onto her hips and start moving, carefully going in and out of her pussy.",
									 "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									 "{color=#f46264}Mmm... Ungh!{/color}{color=#e80cc0}♥{/color}{color=#f46264} Mmm~... Mff!{/color}{color=#e80cc0}♥{/color}",
									 "ChangeArousalByPercent","30",
									 "You continue to work her, s~l~o~w~l~y drawing your cock out, scraping the inner folds of her pussy as it clings to your shaft, before stopping at the tip and slamming it back in as you both tremble in ecstasy.",
									 "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									 "{color=#f46264}Ah~!{/color}{color=#e80cc0}♥{/color}{color=#f46264} …hah..ha...{ThePlayerName}, Mmm~{/color}{color=#e80cc0}♥{/color}  hiss~, {color=#f46264}S-stop teasing me already, Mph~!  h-harder.. go harder!{/color}{color=#e80cc0}♥{/color}",
									 "ChangeArousalByPercent","20",
									 "You nod and pick up the pace, plunging into her with quick and deep thrusts while giving her some firm slaps on the ass, catching her off guard as her hand drops to the side, giving way to her unfiltered moans as they ring out loudly in the air.",
									 "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									 "{color=#f46264}Ekk!{/color}{color=#e80cc0}♥{/color}{color=#f46264}, Ah!{/color}{color=#e80cc0}♥{/color}{color=#f46264} Ah!{/color}{color=#e80cc0}♥{/color}{color=#f46264},Ohh~{/color}{color=#e80cc0}♥{/color}{color=#f46264}!{/color}", 
									 "ChangeArousalByPercent","20",
									 "Her tail instinctively coils tighter around you, letting out a low hiss. Everytime you smack her ass, her pussy gives you a squeeze, churning your dick as her love juices gush out everytime you fill her.",
									 "ChangeArousalByPercent","10",
									 "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									 "{color=#f46264}That’s it! AHH~!{/color}{color=#e80cc0}♥{/color}{color=#f46264} AH~!{/color}{color=#e80cc0}♥{/color}{color=#f46264} USE ME!, BREED ME!, Ha!{/color}{color=#e80cc0}♥{/color}{color=#f46264}, Hah!{/color}{color=#e80cc0}♥{/color}{color=#f46264} put me in my place, show me that I’m nothing more than your personal cumdump bitch and make me YOURS!!!{/color}{color=#e80cc0}♥{/color}{color=#f46264}.{/color}",
									 "PlayerOrgasmNoSpiritLoss",
									 "You hug the base of her tail, using it as leverage and pound away at her spasming pussy, and with a few definitive thrusts you hilt yourself in her, spurting out thick ropes of cum as she cries out in ecstasy, burying her face in the ground as her face goes slack from pleasure with her tongue rolling out of her mouth.",
									 "ChangeBGM-NoFade", "music/Casino/07　After the act.mp3",
									 "You both shiver from post coital bliss, releasing each other's holds and plop to the ground taking deep breaths and recover from both of your respective orgasms.",
									 "StopBGM",
									 "...",
									 "PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Metal Gear Solid - Exclamation Point Sound Effect.mp3",
									 "ChangeBGM", "music/Casino/Bewitching.mp3", 
									 "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									 "{color=#69b3f7}You sure had a lot of fun~ Hope you’re ready for more~ Cuz the {b}rest{/b} of us still haven’t gotten our turns~{/color}",
									 "ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3",
									 "ChangeArousalByPercent","10",
									 "Before you can even utter a word, she pulls you into a deep kiss, wrapping her arms around you with her cleavage pressing into your chest.",
									 "ChangeArousalByPercent","15", 
									 "She dominates your mouth, swirling her tongue as she makes you swallow her saliva. Every gulp of her venomous saliva sends shivers throughout your body, dulling your mind as tingly warmth spreads throughout your body.", 
									 "ChangeArousalByPercent","10",
									 "You both continue kissing, moaning into each other’s mouths before eventually coming up for air.", 
									 "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									 "{color=#69b3f7}Mnff *tsk ch*  mngh{/color}{color=#e80cc0}♥{/color}{color=#69b3f7}*tsk tsk slurp*  MNN… {/color}{color=#e80cc0}♥{/color}{color=#69b3f7}*ch ch tssskkkkk*Mwaaahh{/color}{color=#e80cc0}♥♥♥{/color}",
									 "ChangeArousalByPercent","20",
									 "She breaks the kiss forming a bridge of saliva between both your lips, as she opens her eyes and looks at you with unbridled lust. She proceeds to pepper your face with kisses, feeling your face getting loose from her smouldering kisses as your mind melts to pleasure, the only thing you can focus on is the face of the woman before you.",
									 "ChangeArousalByPercent","20",
									 "You burn with desire, kissing her back and forcing her down as you both roll over while planting both your hands beside her head.",
									 "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									 "{color=#69b3f7}Mm!, mmm… mfwa{/color}{color=#e80cc0}♥{/color}",
									 "ChangeArousalByPercent","10",
									 "You break the make out session and desperately catch your breath. she bites her lower lip spreading her legs for you as her hands spread her pussy lips inviting you into her wet pussy.",
									 "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									 "{color=#69b3f7}Ah!{/color}{color=#e80cc0}♥{/color}",
									 "ChangeArousalByPercent","10",
									 "You penetrate her as she seductively moans and coos into your ear.",
									 "ChangeArousalByPercent","25", 
									 "She then grabs your head and fervently kisses you while you piston her pussy. Each meeting of your hips sends pangs of pleasure as she professes her love to you in between breaths.",
									 "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									 "{color=#69b3f7}Love you{/color}{color=#e80cc0}♥{/color}{color=#69b3f7}! love you{/color}{color=#e80cc0}♥{/color}{color=#69b3f7}! love you{/color}{color=#e80cc0}♥{/color}{color=#69b3f7}! EEK!{/color}{color=#e80cc0}♥{/color}",
									 "PlayerOrgasm", "3",
									 "ChangeEnergyByPercent", "-30",
									 "The arousal builds in your crotch until you can no longer hold on and hilt into her, pumping another load into her greedy pussy as her hands squeeze your ass.",
									 "As you both come down from your respective highs, you dislodge your cock and lie down, your body exhausted from the continuous love making despite your dick still being erect.",
									 "...",
									 "Out of no where your body jumps, feeling the weight of something on top of your hips. Raising your head you find Alyssa, with a wide grin, licking her lips as she straddles your waist.",
									 "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									 "{color=#f2eca1}Mmm~, now it’s my turn{/color}{color=#e80cc0}♥{/color}",
									 "PlayerOrgasm", "1",
									 "She places her hands on your chest lifting her hips up before slamming them down, hilting herself on your cock as your body jerks and cums from the sudden penetration.",
									 "ChangeArousalByPercent","25", 
									 "She licks her lips and slowly gyrates her hips as the warm sensation of her pussy radiates throughout your crotch, washing you in waves of bliss as you moan.",
									 "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									 "{color=#f2eca1}Hehe, Don’t worry, just leave it all to me{/color}{color=#e80cc0}♥{/color}",
									 "ChangeArousalByPercent","35", 
									 "She begins bouncing on your cock, with each meeting of your hips sending jolts of pleasure throughout your body. She looks at you from above, grinning from ear to ear as your moans fuel her lust as she looks at you with a primal hunger.", 
									 "ChangeArousalByPercent","55", 
									 "She quickens the pace tightening her grip as she slams down on you as ecstasy assaults your body writhing below her, shifting in and out of consciousness as you submit to the pleasure.", 
									 "PlayerOrgasm", "1",
									 "ChangeArousalByPercent","125",
									 "ChangeEnergyByPercent", "-30",
									 "You cum. However, she doesn't stop, continuing to roughly ride your cock as the sounds of her wet smacking echo out.",
									 "PlayerOrgasm", "3",
									 "ChangeEnergyByPercent", "-40",
									 "With a final slam of her hips you both reach climax, erupting inside her and filling her up with your hot semen as her body tightens, squeezing every drop of semen as she purrs in satisfaction.",
									 "After a short while she finally releases her hold on you. Your entire body sore, from the rough love making and exhausted from the contionous orgasms. You aren't sure how much more you can take.",
									 "ChangeBGM", "../Mods/Scorched_Path/Music/FKG Soundtrack Hearts Repose.mp3",
									 "Suddenly, she sits you up and embraces you, wrapping her arms and legs around you with your dick still inside her. She brings her mouth close to your ear, gently stroking your head and whispers.",
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}There there~, just relax{/color}{color=#e80cc0}♥{/color}{color=#c280ff} Leave it all to me~{/color}",
									 "ChangeEnergyByPercent", "20",
									 "She runs her hands over your body, rubbing your back in a slow comforting rhythm.",
									 "ChangeEnergyByPercent", "25", 
									 "Her warm, gentle touch and sweet voice was all it took for you to calm down and relax as the tiredness settles in.",
									 "ChangeArousalByPercent","5",
									 "ChangeEnergyByPercent", "25",
									 "You stay in your comfy state for a while slowly shifting in and out of consciousness, before mommentarily jolting awake.",
									 "You absentmindedly look down to see Alyssa licking your body with her paralyzingly numbing saliva.",
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}It’s okay, I'm here, I'll never let you go {color=#c280ff}{color=#e80cc0}♥{/color}",
									 "ChangeArousalByPercent","10",
									 "You feel yourself going numb from the saliva as the muscles in your body relax, your body ceasing function, before entrusting yourself to her. She glides her tongue up your neck, coating it in saliva and licking the side of your face as you shiver, before playfully nibbling on your ear.", 
									 "ChangeArousalByPercent","5",
									 "She looks at you with an enraptured expression, affectionately rubbing your cheek with the side of her face.",
									 "ChangeArousalByPercent","80",
									 "Her face is brought invasively close to yours as you feel the warm touch of her fingers on your cheeks, before she kisses you and lovingly ravishes your mouth with her tongue in a controlled rhythm and lulling you to sleep.", 
									 "PlayerOrgasmNoSpiritLoss",
									 "She presses her large pillowy chest into yours as your nose is filled with her scent. Your senses are overload in your half asleep state focring you to eject your cum into her.",
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}That’s right, let it all out~{color=#c280ff}",
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}so warm, {ThePlayerName}’s semen{/color}{color=#e80cc0}♥{/color}{color=#c280ff}~{/color}",
									 "SetSpirit", "0",
									 "She coaxes load after load out of you, her pussy gently massaging your dick spurting the remaining cum you have until you are left shooting blanks with a spazzy expression as she giggles.",
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}Hehe cute~, so cute{/color}{color=#e80cc0}♥{/color}",
									 "before you fall asleep as she wraps you both in her wings.",
									 "RefreshPlayer",
									 
									 "...",
									 "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									 "You wake up and groggily massage your eyes, notcing that somehow you managed to get yourself clothed. You feel something sturring next to you, and immediately turn around to find Alyssa slowly getting up.",
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}Mmm… Good morning… hwaaa… that was amazing{/color}{color=#e80cc0}♥{/color}{color=#c280ff}~{/color}",
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}S-so what do you want to do now?.{/color}",
									 "JumpToScene", 
									 "Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Kiss her",
						"theScene": [
									  "You approach the monster girl and plant a kiss on her lips.",
									  "Caught by surprise, She lowers her head with blushing cheeks",
									  "ChangeArousalByPercent", "10",
									  "ChangeBGM-NoFade", "music/Casino/07　After the act.mp3",
									  "All of a sudden she steals your lips, kissing you while pushing her tongue into your mouth and wrapping it around yours.",
									  "ChangeArousalQuietly","10", 
									  "She gradually shifts to more tender licks and sucks before leaving a big wet parting kiss. ",
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									  "She blushes even harder than before and shyly looks back at you.",
									  "JumpToScene",
									  "Sex Menu"
						]
					},
					{
                        "NameOfScene": "Hug her",
						"theScene": [
									  "You embrace her tightly wrapping her in your arms.",
									  "ChangeArousalByPercent", "5", 
									  "PlaySoundBankOnce", "../Mods/Scorched_Path/Music/Icky Squish (Anime Sound) - Sound Effect for editing.mp3",
									  "ChangeBGM", "music/Casino/BGM sweet smell.mp3", 
									  "She responds in kind leaning into your embrace as her ample breasts press into your chest as she squeezes you in an equally tight if not tighter hug.", 
									  "ChangeArousalByPercent", "5", 
									  "She coos into your ears as her snake tail coils around your leg. You can't help but notice how soft yet tender her body feels in your grasp and how nice she smells.", 
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									  "After a moment you both let go. Stepping back, you see her smiling happily at you",
									  "JumpToScene",
									  "Sex Menu"
						]
					},
					{
                        "NameOfScene": "Leave -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}Aww, l-leaving already? C-can’t you stay a little longer?{/color}", 
									  "She moves to your side and clings to your arm.", 
									  "You tell her that you can’t and should really get going.", 
									  "She tries to keep you longer as you drag her along, but eventually, she begrudgingly lets go, waves goodbye, and sees you off."
						]
					},
					{
                        "NameOfScene": "About her",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","About her-Knows",
									  "Menu",
									  "Where are you from?",
									  "What is your species?",
									  "Her abilities?",
									  "RequiresMinimumProgress", "21", "About her 'moodiness'",
									  "Changed my mind",
									  "EndLoop"		
						]
					},
					{
                        "NameOfScene": "About her-Knows",
						"theScene": [
									  "Menu",
									  "Where are you from?",
									  "What is your species?",
									  "Her abilities?",
									  "RequiresMinimumProgress", "21", "About her 'moodiness'",
									  "Problems from her personalities?",
									  "About her hobbies",
									  "Changed my mind",
									  "EndLoop"				
						]
					},
					{
                        "NameOfScene": "About acting",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","About Acting -Knows",
									  "Menu",
									  "What's the movie business like?",
									  "Why acting?",
									  "What movies are you in?",
									  "RequiresChoice", "2", "informed", "How are sex scenes done for films?",
									  "Changed my mind",
									  "EndLoop"				
						]
					},
					{
                        "NameOfScene": "About Acting -Knows",
						"theScene": [
									  "Menu",
									  "What's the movie business like?",
									  "Why acting?",
									  "Was acting hard for you with your condition?",
									  "What movies are you in?",
									  "RequiresChoice", "2", "informed", "How are sex scenes done for films?",
									  "Changed my mind",
									  "EndLoop"				
						]
					},
					{
                        "NameOfScene": "Changed my mind",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","Changed my mind -Knows",
									  "JumpToScene",
									  "Talk"		
						]
					},
					{
                        "NameOfScene": "Changed my mind -Knows",
						"theScene": [
									  "JumpToScene",
									  "Talk Menu -Knows"		
						]
					},
					{
                        "NameOfScene": "Where are you from?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","Where are you from? -Knows",
									  "Speaks",
									  "Me? I live in the capital. I was having a hard time getting myself in character, so I came out {i}allll{/i} the way here to get inspired. The mountain looks {b}totally{/b} like something an adventurer would have to go through to fight the Demon Queen!", 
									  "Speaks",
									  "Besides, this place is also famous for the Black Knight stopping adventurers. I was {b}pumped{/b} to see her in action! But when I got here everyone told me I missed her. {b}Fuck!{/b}",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "Changed my mind"
						]
					},
					{
                        "NameOfScene": "Where are you from? -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Me? I live in the capital. I was having a hard time getting myself in character, so I came out {i}allll{/i} the way here to get inspired. The mountain looks {b}totally{/b} like something an adventurer would have to go through to fight the Demon Queen!{/color}", 
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Besides, this place is also famous for the Black Knight stopping adventurers. I was {b}pumped{/b} to see her in action! But when I got here everyone told me I missed her. {b}Fuck!{/b}{/color}",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "What is your species?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","What is your species? -Knows",
									  "Speaks",
									  "Ahem, well if you must know, I am classified under the Chimera family.",
									  "ChangeBGM", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3", 
									  "Speaks",
									  "Not all chimeras have the same genes, but are all under the umbrella term of Chimera when they are predominantly shown to have at least three or more traits that do not normally go together. Personally, I myself am part snake, part goat, part dragon, and part lion.",
									  "You can't help but note the pride in her voice and the wide smile plastered on her face as she comments on her lineage.",
									  "Speaks",
									  "Chimeras are all able to use the abilities of their ancestors. For example since I am part dragon and snake, I of course have the famous ability of breathing fire AND have venom that can paralyze people!", 
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
									  "Speaks",
									  "However, my fire and venom are less effective than a real dragon or snake monster girl.",
									  "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",  
									  "Speaks",
									  "Ahem.. so yeah, I’m a chimera. Is there anything else?",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "Changed my mind"

						]
					},
					{
                        "NameOfScene": "What is your species? -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Ahem, well if you {b}must{/b} know, I am classified under the Chimera family.{/color}",
									  "ChangeBGM", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3", 
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Not all chimeras have the same genes, but are all under the umbrella term of Chimera when they are predominantly shown to have at least two or more traits that do not normally go together. Personally, I myself am part snake, part goat, part dragon, and part lion.{/color}",
									  "You can't help but note the pride in her voice and the wide smile plastered on her face as she comments on her lineage.",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}Chimeras are all able to use the abilities of their ancestors. For example since I am part dragon and snake, I of course have the famous ability of breathing fire AND have venom that can paralyze people!{/color}", 
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}However, my fire and venom are less effective than a real dragon or snake monster girl.{/color}",
									  "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",  
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Ahem.. so yeah, I’m a chimera. Is there anything else?{/color}",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "Changed my mind -Knows"

						]
					},
					{
                        "NameOfScene": "Her abilities?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","Her abilities? -Knows",
									  "ChangeBGM", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3", 
									  "Speaks",
									  "Oh? You want to know more about me? W-well, thanks to my {b}unique{/b} physiology, I possess durable and sharp claws, enhanced vision in the dark, the ability of flight, the ability to breathe fire, and secrete paralyzing venom.", 
									  "She beams with pride as she puffs out her chest.",
									  "Speaks", 
									  "I can control my flames and make them not burn if I wanted to. Since I am also part snake, I am also able to infuse my venom into the flames and stun enemies.",
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",   
									  "Speaks",
									  "Plus, I also have this guy~.",
									  "As if on command the snake slithers out and wraps itself around her arm and hisses at you. She cradles its’ head and strokes it affectionately",
									  "Speaks",
									  "This cutie over here is my best friend~. He has a mind of his own but is very cooperative with me, probably because of sharing the same body and all.",
									  "Speaks", 
									  "I can sorta understand him and he seems to understand me. He has been with me since the start and grew along side me~. *hiss~*",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "Changed my mind"
						]
					},
					{
                        "NameOfScene": "Her abilities? -Knows",
						"theScene": [
									  "ChangeBGM", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3", 
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Oh? You want to know more about me? W-well, thanks to my {b}unique{/b} physiology, I possess durable and sharp claws, enhanced vision in the dark, the ability of flight, the ability to breathe fire, and secrete paralyzing venom.{/color}", 
									  "She beams with pride as she puffs out her chest.",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}I can control my flames and make them not burn if I wanted to. Since I am also part snake, I am also able to infuse my venom into the flames and stun enemies.{/color}",
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",   
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}Plus, I also have this guy~{/color}",
									  "As if on command the snake slithers out and wraps itself around her arm and hisses at you. She cradles its’ head and strokes it affectionately",
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}This cutie over here is my best friend~ He has a mind of his own but is very cooperative with me, probably because of sharing the same body and all~{/color}",
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}", 
									  "{color=#69b3f7}I sorta understand him~ and he sorta understands me~. He has been with me since the start and grew along side me~{/color} *hiss~*",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "About her 'moodiness'",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","About her 'moodiness' -Knows",
									  "The momment you utter the question, her ears twitch, as her tail coils around itself. Her expression visibly dips as she looks away from you.",
									  "Speaks", 
									  "Oh… you noticed…",
									  "A short pause ensues as she hesitates with continuing the conversation.",
									  "ChangeBGM-NoFade", "music/Emotional/Purple Planet Music - Emotional - Sense Of Loss (2_04) 54bpm.mp3",
									  "Speaks",
									  "You see uh, I have a p-particular condition.",
									  "Speaks", 
									  "I have umm m-multiple personalities. In total I have four personalities, each one being similar to a monster girl I'm made of, a lion, snake, dragon, or goat.", 
									  "Speaks",  
									  "Whenever it seems like I'm talking to myself or act different, i-it’s probably me switching between one of them.", 
									  "...",
									  "Speaks",
									  "W-well g-go on. Say something.",
									  "Menu",
									  "Reassure her",
									  "Joke with her",
									  "Disgust", 
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Reassure her",
						"theScene": [
								    "ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/Purple Planet Music - Ethereal Eternity (1_43) 70bpm.mp3",
									"You gently approach her and clasp her hand, telling her that it's all right, nothing is going to change. All those personalities she has are just different sides of the same coin.", 
									"In the end no matter what personality she shows, they are all still what makes her, {b}her{/b}. And nothing will ever make you change the way you feel about her.",
									"For a brief momment she just stares at you in utter silence. Probably, taking it all in. Until a tear starts running down her eye.",
									"ChangeBGM", "../Mods/Scorched_Path/Music/Purple Planet Music - Dreams Come True (1_30) 110bpm (L).mp3",
									"She quickly wipes her tears and bows her head. You stand there in silence, still holding her hand, with the faint sound of someone sniffling.",
									"Speaks", 
									"*Sniff* Y-you're taking this better than I thought... t-thanks.",
									"She places her hand on top of yours. You stay like that for awhile before she decides to retract her hand and get up.",
									"ChangeProgress", "5",
									"SetChoice", "1", "KnowsPersonalities",
									"JumpToScene", 
									"Intro Interaction Menu Buffer"
						]
					},
					{
                        "NameOfScene": "Joke with her",
						"theScene": [
									"ChangeBGM-NoFade", "music/Forest/nandesuto.mp3",
									"PlayerSpeaks",
									"So if ever we go out and eat should I order a table for five?",
									"Speaks", 
									"Huh? C-come on, I'm trying to be serious here.",
									"PlayerSpeaks",
									"What? I always did like a girl more for her personality anyway, I must have struck gold with you cause you've got several.",
									"Speaks", 
									"Oh, Shut up!",
									"ChangeBGM", "../Mods/Scorched_Path/Music/Purple Planet Music - Dreams Come True (1_30) 110bpm (L).mp3",
									"She playfully punches your shoulder. Her expression is replaced by slight smile, as she seemingly goes back to normal",
									"ChangeProgress", "3",
									"SetChoice", "1", "KnowsPersonalities",
									"JumpToScene", 
									"Intro Interaction Menu Buffer"
						]
					},
					{
                        "NameOfScene": "Intro Interaction Menu Buffer",
						"theScene": [
									"ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									"JumpToScene", 
									"Intro Interaction Menu"
						]
					},
					{
                        "NameOfScene": "Disgust",
						"theScene": [
								    "ChangeBGM-NoFade", "music/Loss/Falling Down.mp3",
									"Alyssa looks at you, focusing on your expression. She shakily recoils, stepping back as tears start to bubble over, streaming down her face. Her face visibly shifts from fear to anger, before resigning to sadness and possibly regret.",
									"You try to say something but are immediately cut off.",
									"ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/Leave without me.mp3",
									"Speaks", 
									"DON'T *sniff*",
									"Speaks",
									"I-I uh, *sniff*, I-I think I'll go.",
									"DisplayCharacters",
									"EndLoop", 
									"Before you can act, she unfolds her wings, kicking up the dust as she immediately flies away off into the distance.",
									"You stand there and wonder about all the choices you made, before eventually deciding to head back and continue on your journey.",
									"StopBGM",
									"SetChoice","1","NOPE"
						]
					},
					{
                        "NameOfScene": "NOPE",
						"theScene": [
									"As you continue along the trail you encounter more and more scorch marks. You travel further and further, following the scorch marks. Eventually you make it to the end of the path, safe and sound, as you head on and continue on your journey."
						]
					},
					{
                        "NameOfScene": "About her 'moodiness' -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}Well, I was born with a particular condition. I have umm dissociative identity or multiple personalities. In total I have four personalities each bearing some resemblance to different monster girls, a lion, snake, dragon, or goat.",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}Whenever I talk to myself or suddenly shift in mood or personality it’s probably me switching between one of them.{/color}",
									  "ChangeProgress", "1",
									  "JumpToScene", 
									  "Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "Problems from her personalities?",
						"theScene": [
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}I have always had this condition as far back as I can remember. At first I thought it was just a voice in my head, like an imaginary friend. But as I grew older I slowly realized that they didn’t go away and that it was not normal to have so many of them.{/color}", 
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}People started telling me that I often acted and sounded really differently at times. They also told me that I often had mood swings but at that point I already knew that it was because of my condition.{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}I steadily learned to control myself and live with it. I worked on switching less and less and staying with one personality for longer periods of time.{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}Now it has gotten to a point where I can mostly choose when to switch and most people can’t tell that I have a condition. Although I can’t completely control it and sometimes I shift when I'm really stressed.{/color}",
									  "ChangeProgress", "1",
									  "JumpToScene", 
									  "Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "About her hobbies",
						"theScene": [
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}I have various hobbies that I take up depending on my mood. F-for example, I like spending my time alone with a good book.{/color}",
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}", 
									  "{color=#69b3f7}I also love gardening, being surrounded by nature~, watching the flowers bloom~, Very rewarding!{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}On occasion I also enjoy a glass of wine. It provides a very rich experience, stimulating your senses and engulfing you in a nice relaxing feeling.{/color}",
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}But then, nothing beats the thrill of a hunt! That feeling when you slowly stalk your prey and then finally nab them! Mm! It really gets my blood pumping!{/color}",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "What's the movie business like?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","What's the movie business like? -Knows",
									  "Speaks",
									  "Oh~ you want to learn more about the film industry? Hm… let us see… where to start.",
									  "She readjusts her posture and straightens her back.",
									  "Speaks",
									  "Well first of all, there are both humans and monster girls across all levels of the industry. However there are predominantly more monster girls than humans. We have all kinds of monster girls working in the industry. Although, some species of monster girls are more popular than others and are sadly boxed into certain roles.", 
									  "Speaks",
									  "It is also important to note that not all human actors are adventurers. Most of them are regular people with little knowledge on adventuring, but the popular ones almost always are, with their own little fan clubs.",
									  "Speaks",
									  "Generally there are two types of films shown in cinemas. The first type is for films that are more tame and thought provoking while the other is more…",
									  "ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3", 
									  "Speaks",
									  "{i}Sexually explicit{/i}~",
									  "ChangeProgress", "1",
									  "Menu",
									  "Wait what do you mean 'sexually explicit'?",
									  "I see",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "What's the movie business like? -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}Oh~ you want to learn more about the film industry? Hm… let us see… where to start.{/color}",
									  "She readjusts her posture and straightens her back.",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Well first of all, there are both humans and monster girls across all levels of the industry. However there are predominantly more monster girls than humans. We have all kinds of monster girls working in the industry. Although, some species of monster girls are more popular than others and are sadly boxed into certain roles.{/color}", 
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}It is also important to note that not all human actors are adventurers. Most of them are regular people with little knowledge on adventuring, but the popular ones almost always are, with their own little fan clubs.{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Generally there are two types of films shown in cinemas. The first type is for films that are more tame and thought provoking while the other is more…{/color}",
									  "ChangeBGM-NoFade", "music/Casino/BGM06_sink.mp3", 
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}{i}Sexually explicit{/i}~{/color}",
									  "ChangeProgress", "1",
									  "Menu",
									  "Wait what do you mean 'sexually explicit'?",
									  "I see",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Wait what do you mean 'sexually explicit'?",
						"theScene": [
							          "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									  "IfChoice","1","KnowsPersonalities","Wait what do you mean 'sexually explicit'? -Knows",
									  "Speaks",
									  "Oh, don’t make me say it out loud for you. You know what I'm talking about~ ",
									  "Not really, no. You then proceed to explain to her that you really are clueless, not being a native of Lucidia and all. She lets out a surprised sound and nods in understanding.",
									  "She then turns her head slightly to the side, with a deep blush and shyly plays with her fingers.",
									  "ChangeBGM-NoFade", "music/Unknown/The Dark Eternal Night.mp3",  
									  "Speaks",
									  "Oh, I didn't know that. Well u-um how do I put this...w-well",
									  "She turns around and looks directly at you.",
									  "Speaks",
									  "Well basicly, it’s porn.",
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3",
									  "Speaks",
									  "Pornography~, sexual fantasy~, erotica~, whatever you want to call it. Its one of the biggest businesses in Lucidia~, popular among humans, monster girls, and monster-human couples~ {b}Hundreds{/b} and even {b}thousands{/b} of films made every month and earn {b}millions{/b} of eros each year~.",
									  "SetChoice", "2", "informed",
									  "Menu",
									  "So you do porn?",
									  "I see",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Wait what do you mean 'sexually explicit'? -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}Oh, don’t make me say it out loud for you. You know what I'm talking about~{/color}",
									  "Not really, no. You then proceed to explain to her that you really are clueless, not being a native of Lucidia and all. She lets out a surprised sound and nods in understanding.",
									  "She then turns her head slightly to the side, with a deep blush and shyly plays with her fingers.",
									  "ChangeBGM-NoFade", "music/Unknown/The Dark Eternal Night.mp3",  
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}Oh, I didn't know that. Well u-um how do I put this...w-well{/color}",
									  "She turns around and looks directly at you",
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Well basicly, it’s porn.{/color}",
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3",
									  "Speak", "Alyssa {color=#69b3f7}Goat{/color}",
									  "{color=#69b3f7}Pornography~, sexual fantasy~, erotica~, whatever you want to call it. Its one of the biggest businesses in Lucidia~, popular among humans, monster girls, and monster-human couples~ {b}Hundreds{/b} and even {b}thousands{/b} of films made every month and earn {b}millions{/b} of eros each year~{/color}",
									  "SetChoice", "2", "informed",
									  "Menu",
									  "So you do porn?",
									  "I see",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "So you do porn?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","So you do porn? -Knows",
									  "Speaks",
									  "Eh?! N-NO, I DON'T!",
									  "Speaks", 
									  "Don't get the wrong idea, it's not as bad as you think. People have gone on to say that working in the industry empowered them to be more confident and accept their sexuality. Some of the actresses are {b}very{/b} talented, and plus they pay {b}stupid{/b} amounts of money.", 
									  "Speaks", 
									  "I-I'm just not really sure if I really want to pursue that kind of career.",
									  "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "About acting"
						]
					},
					{
                        "NameOfScene": "So you do porn? -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}Eh?! N-no, I don’t!{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}Don't get the wrong idea, it's not as bad as you think. People have gone on to say that working in the industry empowered them to be more confident and accept their sexuality. Some of the actresses are {b}very{/b} talented, and plus they pay {b}stupid{/b} amounts of money.{/color}", 
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}I-I'm just not really sure if I really want to pursue that kind of career.{/color}",
									  "ChangeBGM", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "About Acting -Knows"
						]
					},
					{
                        "NameOfScene": "I see",
						"theScene": [
									 "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									 "JumpToScene", 
									 "About acting"
						]
					},
					{
                        "NameOfScene": "Why acting?",
						"theScene": [
									  "IfChoice","3","Reason knows","Why acting? -Reason Knows",
									  "IfChoice","1","KnowsPersonalities","Why acting? -Knows",
									  "Speaks",
									  "W-well uhh that’s actually k-kinda personal… I don’t really feel like talking about it.",
									  "JumpToScene", 
									  "About acting"
						]
					},
					{
                        "NameOfScene": "Why acting? -Knows",
						"theScene": [
									  "ProgressEqualsOrGreater", "10", "Why acting? -Reason",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}W-well uhh that’s actually k-kinda personal… I don’t really feel like talking about it.{/color}",
									  "JumpToScene", 
									  "About Acting -Knows"
						]
					},
					{
                        "NameOfScene": "Why acting? -Reason",
						"theScene": [
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}W-well uhh that’s actually k-kinda personal…{/color}",
									  "You tell her it's alright if she doesn't want to tell you.",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}No no, It's fine, r-really!{/color}",
									  "You give her some time, listening attentively for whenever she's ready.",
									  "ChangeBGM-NoFade", "music/Emotional/Purple Planet Music - Emotional - Sense Of Loss (2_04) 54bpm.mp3",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",  
									  "{color=#c280ff}Y-you see when I was a child, growing up I was always alone. B-being a chimera, I never really knew who my parents were, o-or if I even {b}had{/b} parents. Other people would always laugh and pick on me because of my mismatched appearance and call me a weirdo for talking to myself and my 'imaginary friends'.{/color}", 
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}Naturally, I never really had any friends and for a long time, I-I felt really insecure about myself.{/color}",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}There were a few chimeras I've met before b-but none were really a-as... {i}unique{/i} as me.{/color}",  
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}Looking back, I felt that i-if there was someone like me, s-someone famous that everyone admired and {b}not{/b} laughed at, I would p-probabbly have felt much better about myself.{/color}",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}I guess I just want to be that person... Y-you probably think I'm being silly huh?{/color}",
									  "Menu",
									  "Pfft, what a stupid reason HAHAHA!", 
									  "Uh, I think there are other things you should do besides acting",
									  "Don't say that, it's an admirable reason",
									  "EndLoop"
						]
					},
					{
                        "NameOfScene": "Pfft, what a stupid reason HAHAHA!",
						"theScene": [
									"PlaySoundBankOnce", "../Mods/Scorched_Path/Music/ZapSplat human_hand_slap_around_face.mp3",
									"*SMACK!*",
									"ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Tense - Melancholia (1_24) 96bpm.mp3",
									"A heavy sound rings out in the air. You stand there in shock, frozen in place, as your brain slowly process what just happened. Instinctively, your touch the side of your face, but you feel no pain. Your eyes turn towards Alyssa, only to find her arm oustretched, wings unfolded, breathing heavy, and her eyes sharply glaring at you.",
									"Your heart beats faster and faster, legs failing, as your body trembles in animalistic fear from the intimidating visage of the monster girl in front of you. Your ears not even registering the intimidating hissing going on in the background.",
									"ChangeBGM-NoFade", "music/Battle/agitating-point.mp3",
									"Speak", "Alyssa {color=#f2eca1}Lion{/color}", 
									"{color=#f2eca1}Grr, BASTARD!!!{/color}",
									"Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									"{color=#c280ff}*sniff*, B-Bastard. *sniff*{/color}",
									"ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/Leave without me.mp3",
									"Her expression immediately crumbles from a surge of emotion. Her eyes turn red and her shoulders shake, as tears stream down her face.",
									"DisplayCharacters",
									"EndLoop", 
									"She shakes her head in frustration. Before you can act, she unfolds her wings, kicking up the dust as she immediately flies away off into the distance.",
									"You stand there rooted on the spot, feet locked into place, as time seems to stretch on forever. You watch Alyssa shakily fly off into the sky amidst a trailing sounds of sobbing.",
									"...", 
									"Eventually you find the will to leave and continue on your journey.",
									"StopBGM",
									"SetChoice","1","NOPE"
						]
					},
					{
                        "NameOfScene": "Uh, I think there are other things you should do besides acting",
						"theScene": [
									 "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									 "{color=#c280ff}Y-ya, you're probabbly right, I should go and rethink some things...{/color}",
									 "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									 "ChangeProgress", "-5",
									 "SetChoice","3","Reason knows",
									 "JumpToScene", 
									 "Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "Don't say that, it's an admirable reason",
						"theScene": [
									"Speak", "Alyssa {color=#c280ff}Snake{/color}",
									"{color=#c280ff}O-oh! That was really sweet of you to say… T-thanks.{/color}",
									"ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",
									"ChangeProgress", "5",
									"SetChoice","3","Reason knows",
									"JumpToScene", 
									"Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "Why acting? -Reason Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}W-well uhh that’s actually kinda personal…{/color}",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",  
									  "{color=#c280ff}You see when I was a child, growing up I was always alone. B-being a chimera, I never really knew who my parents were, o-or if I even {b}had{/b} parents. Other people would always laugh and pick on me because of my mismatched appearance and call me a weirdo for talking to myself and my 'imaginary friends'.{/color}", 
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}Naturally, I never really had any friends and for a long time, I-I felt really insecure about myself.{/color}",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}There were a few chimeras I've met before but none were really a-as... {i}unique{/i} as me.{/color}",  
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}Looking back, I felt that if there was someone like me, s-someone famous that everyone admired and {b}not{/b} laughed at, I would p-probabbly have felt much better about myself.{/color}",
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}I guess I just want to be that person.{/color}",
									  "ChangeProgress", "1",
									  "JumpToScene", 
									  "Changed my mind -Knows"
						]
					},
					{
                        "NameOfScene": "Was acting hard for you with your condition?",
						"theScene": [
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Ugh, It was a pain in the ass at first. Most people didn’t want to take me because of my condition. Some still don’t, hmph! even though I have more experience and talent than the others!{/color}", 
									  "For a while I went without any acting jobs. Whenever that happens I do odd jobs like being a guard, or a pizza delivery girl. Luckily someone gave me a chance, saw how amazing I am, and I got to make my debut! hehe!",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Things are better now to the point that some people wouldn't know I had a condition unless I told them!, b-but sometimes my other personalities come out when stressed but most people were very understanding.{/color}",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "About Acting -Knows"
						]
					},
					{
                        "NameOfScene": "What movies are you in?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","What movies are you in? -Knows",
									  "ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3", 
									  "Speaks",
									  "Let’s see, in the past I was a cast member of 'Raiders of the Lost Sigil', 'Sex in the Capital', and 'Phantom of the Ooohpera'!",
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 

									  "Speaks", 
									  "A-although I mostly played minor roles o-or was an extra...",
									  "ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3", 
									  "Speaks",
									  "I would say my most popular role was in 'The Strumpet, The Desolation of Smoag', where I played one of the main antagonists and burned down a village!",
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 

									  "Speaks",
									  "E-even if I only showed up in the last quarter of the movie a-and didn’t get much to do outside of that.",
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3", 
									  "Speaks",
									  "I've never been stopped on the street by a fan for autographs or anything. But when I do get recognized it feels really awesome! hehe!",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "About acting"
						]
					},
					{
                        "NameOfScene": "What movies are you in? -Knows",
						"theScene": [
									  "ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3",
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}Let’s see, in the past I was a cast member of 'Raiders of the Lost Sigil', 'Sex in the Capital'”', and 'Phantom of the Ooohpera'!{/color}",
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
  
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}", 
									  "{color=#c280ff}A-although I mostly played minor roles o-or was an extra...{/color}",
									  "ChangeBGM-NoFade", "../Mods/Scorched_Path/Music/FKG Soundtrack Commander's Office.mp3",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}I would say my most popular role was in 'The Strumpet, The Desolation of Smoag', where I played one of the main antagonists and burned down a village!{/color}",
									  "ChangeBGM-NoFade", "music/Forest/nandesuto.mp3", 
 
									  "Speak", "Alyssa {color=#c280ff}Snake{/color}",
									  "{color=#c280ff}E-even if I only showed up in the last quarter of the movie a-and didn’t get much to do outside of that.{/color}",
									  "ChangeBGM-NoFade", "music/Mountain/Purple Planet Music - Chilled - Desert Winds (3_12).mp3",  
									  "Speak", "Alyssa {color=#f2eca1}Lion{/color}",
									  "{color=#f2eca1}I've never been stopped on the street by a fan for autographs or anything. But when I do get recognized it feels really awesome! hehe!{/color}",
									  "ChangeProgress", "1",
									  "JumpToScene", 
									  "About Acting -Knows"
						]
					},
					{
                        "NameOfScene": "How are sex scenes done for films?",
						"theScene": [
									  "IfChoice","1","KnowsPersonalities","How are sex scenes done for films? -Knows",
									  "Speaks",
									  "Well, first off actors {b}clearly{/b} state in their contract how far they are willing to go for sex scenes like partial nudity, full on nudity, full on sex, or props only and if they are even willing to be in one.",
									  "Speaks", 
									  "Secondly, the way we do sex scenes is dependent on the type of director. Some are more 'hands on' and tend try to direct and control everything, while others are more 'go with the flow' and leave it up to the actors.",
									  "Speaks", 
									  "All the actors on set are very professional and don’t let feelings get to them off-screen. Although some of them do end up together and become a couple.", 
									  "Speaks",
									  "Though I do sometimes feel bad for the stuntmen or doubles, because oftentimes we usually cast extras or people who are unaware of the acting industry and get taken advantage of and drained dry, both metaphorically {b}and{/b} literally.",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "About acting"
						]
					},
					{
                        "NameOfScene": "How are sex scenes done for films? -Knows",
						"theScene": [
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",
									  "{color=#f46264}Well, first off actors {b}clearly{/b} state in their contract how far they are willing to go for sex scenes like partial nudity, full on nudity, full on sex, or props only and if they are even willing to be in one.{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}Secondly, the way we do sex scenes is dependent on the type of director. Some are more 'hands on' and tend try to direct and control everything, while others are more 'go with the flow' and leave it up to the actors.{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}", 
									  "{color=#f46264}All the actors on set are very professional and don’t let feelings get to them off-screen. Although some of them do end up together and become a couple.{/color}",
									  "Speak", "Alyssa {color=#f46264}Dragon{/color}",  
									  "{color=#f46264}Though I do sometimes feel bad for the stuntmen or doubles, because oftentimes we usually cast extras or people who are unaware of the acting industry and get taken advantage of and drained dry, both metaphorically {b}and{/b} literally.{/color}",
									  "ChangeProgress", "1", 
									  "JumpToScene", 
									  "About Acting -Knows"
						]
					},
					{
						"NameOfScene": "Event Broke",
						"theScene": [ "JLP603: CONGRATULATIONS THE MOD IS BROKEN!!!",
									"JLP603: If this wasn't supposed to happen, go to the Monster Girl Dreams discord and ping me @JLP603 in one of the Modding Channels.",
									"JLP603: While you're here, let me list some notes on progression in case it's relevant.",
									
									"Choice variables:KnowsPersonalities,FirstActOver,SecondActOver,\ninformed,NOPE,Reason knows",
									"Progress value:0-initial meeting. 1-it means you will meet for the second time overall. 2-meeting after the 2nd encounter.",
									"Progress value:5-you can act. 21-you can learn about her personalities and have high afinity acting. 41-unlock sex but needs to know abt reason and personalities",
									"Actions and respective progression values: talking-1 or 5, acting-3"
								  ]
					}
	]	
}
