{
    "name": "The Trail of Statues",
    "CardType": "Event",
    "CardLimit": "1",
    "Description": "A mysterious trail of statues leads up to a dark, cavernous lair...",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Euryale",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene": [ "IfChoice", "1", "RejectedEuryale", "RejectedIntro",
                                      "ProgressEqualsOrGreater",
                                      "1",
                                      "VisitingEuryale",
									  "ChangeBGM-NoFade", "music/Caverns/Purple Planet Music - Emotional - Darkness (1_55) 94bpm.mp3",
									  "As you explore the outer edges of the Mountain, something grabs your attention. Along a rocky trail, you notice what seem to be ruined pillars, most covered with small plants which cling on to the debris.",
									  "You decide to investigate further, noting the difference between this area of the Mountain and the rest. Approaching the pillars, you feel they must be very old, as the architecture does not really match anything you've yet seen during your time in Lucidia.",
									  "Walking past them, you notice the trail leads into a cave opening in the distance, and the path there seems to be decorated with what appear to be sculptures made of some sort of stone.",
									  "Approaching the sculptures reveal them to be monster girls, or at least depictions of them. Harpies, Minotaurs, Lizard Girls and some others, all in various poses and sporting different expressions. A cold wind blows from the cave, sending a shiver down your spine as you hear a feminine hum.",
									  "Speak", "???",
									  "Mhmhm... What do we have here?",
									  "DisplayCharacters",
									  "1",
									  "EndLoop",
									  "ChangeBGM", "music/Battle/sakka.mp3",
									  "As you turn around, you are faced with the sight of a tall and beautiful woman you had not noticed before, looking down at you with a smug smile. Most strikingly, her hair is made entirely of living snakes, which writhe and glare at you, hissing menacingly.",
									  "With a swift motion, she throws a hand on your shoulder with surprising force, keeping you tightly in place. You let you a surprised gasp as you realize she has rather sharp claws, and her hand seems to be covered in a layer of scales.",
									  "Speak", "???",
									  "A curious little adventurer, who couldn't help but want a better look of my lovely garden...?",
									  "She grins, revealing large prominent, snake-like fangs where her canine teeth should be, and her serpent-like eyes gaze down at you with an almost predatory air.",
									  "Speak", "???",
									  "Tell me, young man. Have you ever heard of a gorgon...?",
									  "PlayerSpeaks",
									  "N...N-No?",
									  "Her smug grin grows wider.",
									  "Speak", "???",
									  "Gorgons have this very interesting ability... of {i}turning people to stone with their gaze{/i}.",
									  "Your eyes widen and sweat runs by your forehead. Does this mean all these statues were actually people once?! She leans down over you, the serpents that make up her hair hissing out audibly as they seem to grow agitated.",
									  "Speak", "???",
									  "And it seems I just found the newest decoration for my garden!",
									  "You panic and let out a yell as you realize she intends to turn you to stone! You attempt to struggle out of her grasp, but her stare is utterly intimidating, keeping you frozen in place. You at least manage to turn your head away from her, hoping to avert your gaze from the monster and buy yourself some time to formulate some plan to escape.",
									  "...",
									  "ChangeBGM", "music/Forest/nandesuto.mp3",
									  "Speak", "???",
									  "...Ahahah! Oh, I'm so sorry, but I couldn't resist...",
									  "The gorgon lets go of you and brings a hand to herself, giggling while her snakes all relax instantly. You hesitate for a moment before turning back to her, and realize she doesn't seem to really mean you any harm after all.",
									  "Still, you frown as you realize you have been pranked by this woman, which quickly grabs her attention as she settles down, looking at you apologetically.",
									  "Speak", "???",
									  "Really, I apologize, but you just looked so cute watching my sculptures, and I haven't seen a human in a long time...♥",
									  "You splutter for a moment at her sudden shift in tone, as she continues to giggle to herself at the sight of your growing blushing. Knowing you are no longer in danger, you finally have a chance to look at the woman properly; she is pale, tall and her figure is nothing sort of matriarchal, though her clawed fingers and toes, the serpents upon her head and the large tail you notice trailing behind her clearly shows her monstrous nature.",
									  "Speak", "???",
									  "Please, let me make up for this silly prank by offering you a cup of tea. Mhmhm, I'm sure you'll love it.",
									  "The gorgon offers you her hand, a soft smile on her face as she does so.",
									  "Menu",
									  "Take her hand",
									  "Refuse her",
                                      "EndLoop"
                                  ]
                    },
					{
                        "NameOfScene": "Take her hand",
                        "theScene": [ "SetChoice", "1", "EuryaleForgiven",
									  "Deciding not to hold a grudge over a silly prank, you take the gorgon's hand. Her touch is much more tender now as she takes you to her lair, and as you walk behind her, you are offered a good view of her swaying hips and tail.",
									  "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
									  "Once you enter the cave, you see a table with some chairs near the entrance, as well as a pile of tools and stones, including small hammers and picks. Various pedestals with pieces of stone on them can be found, as well as another chamber, where you see a large, comfortable-looking bed. The gorgon offers you a seat so you may wait, then walks off into another dark corridor.",
									  "After a few moments, she returns, a smile on her face as she offers you a cup with a fragrant liquid in it. Taking a sip, you can tell it's a strong, but not entirely unpleasant tea.",
									  "Speaks",
									  "Allow me to introduce myself properly. I am Euryale, and I am a gorgon. But you don't need to worry about me petrifying you, as the enchantment has nullified the more deadly side of that power. May I have your name?",
									  "PlayerSpeaks",
									  "I'm {ThePlayerName}.",
									  "A curious smile grows on her expression.",
									  "Speaks",
									  "Ooh, is that so? I've heard of you. You've been making somewhat of a stir recently, hm? All the local girls mention your name...",
									  "Speaks",
									  "And I wasn't joking when I said you were cute. Mhmhm, I see why they speak fondly of you...♥",
									  "You can't help but blush a bit as you drink your tea, and the tips of Euryale's forked tongue slip out her lips playfully as she watches you. Once you are done, you place the cup on the table and rise to your feet, and Euryale approaches you with a small smile.",
									  "Speaks",
									  "Do feel free to stay if you'd like. It gets awfully lonely in here sometimes, you know? I'd love to have a chat, or perhaps I could offer you a... {i}proper{/i} apology for my prank...♥",
									  "ChangeProgress",
                                      "1",
                                      "JumpToScene",
                                      "TalkMenu"
                                  ]
                    },
					{
                        "NameOfScene": "Refuse her",
                        "theScene": [ "Her eyes widen and her snakes hiss out in alert. The gorgon's smile vanishes as she becomes visibly worried.",
									  "Speaks",
									  "I-It was just a little joke! I swear, I never intended to hurt you!",
									  "Menu",
									  "Forgive her",
									  "Nope",
                                      "EndLoop"
                                  ]
                    },
					{
                        "NameOfScene": "Forgive her",
                        "theScene": [ "JumpToScene",
									  "Take her hand"
                                  ]
                    },
					{
                        "NameOfScene": "Nope",
                        "theScene": [ "You turn around and make your way back from where you came, not wanting anything to do with this woman's shenanigans.",
									  "Speaks",
									  "Awawawa! P-Please don't go...!",
									  "As you return to the mountain trail, the gorgon is left behind, feeling guilty and rejected...",
									  "SetChoice", "1", "RejectedEuryale"
                                  ]
                    },
					{
                        "NameOfScene": "RejectedIntro",
                        "theScene": [ "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
									  "You stumble into the trail of pillars and statues leading up to the lair of the gorgon who pranked you previously.",
									  "DisplayCharacters",
									  "1",
									  "EndLoop",
									  "As you approach her lair, she can be seen walking out, stretching her arms. Once she notices your presence, however, she immediately smiles widely and runs up to you.",
									  "Speak", "Gorgon",
									  "You're back! Please, do come in! Let's patch things up!",
									  "Menu",
									  "Take her hand",
									  "I don't think so",
                                      "EndLoop"
									  ]
					},
					{
                        "NameOfScene": "I don't think so",
                        "theScene": [ "You immediately turn 180 degrees around and march out, and the gorgon can only watch with her mouth agape in confusion and sorrow as you leave her once again."
									  ]
					},
					{
                        "NameOfScene": "VisitingEuryale",
                        "theScene": [ "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
									  "You stumble into the trail of pillars and statues leading up to the lair of Euryale the gorgon. Making your way there, it doesn't take long for you to meet the serpent-like woman again.",
									  "DisplayCharacters",
									  "1",
									  "EndLoop",
									  "You find her working on one of her sculptures, using her tools to carefully chisel its details while her snakes seem to watch her work intently. As you approach, she notices your presence, and her lips curl into a warm smile.",
									  "Speaks",
									  "My my. Welcome back, {ThePlayerName}. What can I do for you?",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "TalkMenu",
                        "theScene": [ "Menu",
									  "Have a chat",
									  "Ask to see her garden",
									  "Fight?",
									  "Sex?",
									  "Leave",
                                      "EndLoop"
									  ]
					},
					{
                        "NameOfScene": "Have a chat",
                        "theScene": [ "Menu",
									  "What exactly is a gorgon?",
									  "What's with the sculptures?",
									  "What are those ruins outside?",
									  "Do you like it here?",
									  "You're... very beautiful.",
									  "Actually, nevermind.",
                                      "EndLoop"
									  ]
					},
					{
                        "NameOfScene": "What exactly is a gorgon?",
                        "theScene": [ "Speaks",
									  "We are a species of monster girl with features of serpents, as you may have noticed. Though unlike, say, a lamia, we are not literally half-snake. We are closer to aberrants, I think? Monstrous humanoids? Though I always found that classification rather... rude.",
									  "Speaks",
									  "There were never too many of us, and in the current day, you'd be lucky to spot one at all. So, lucky you, mhmhm.♪",
									  "Speaks",
									  "The snakes that make up my hair are not {i}exactly{/i} self-aware, but their consciousness isn't quite the same as my own. They're not really flesh and bone, more like a mix of scales and hair? They do shed like normal hair, and I can cut them into whatever haircuts I want without causing them any pain, as the heads just grow back very quickly.",
									  "The serpents writhe a bit in response, causing Euryale to let out a soft giggle.",
									  "Speaks",
									  "They're saying hello.♪",
									  "Speaks",
									  "Anyway, gorgons are very magically-attuned, and we really do possess the power to petrify others with our gaze. It's our most famous ability, one that made us feared by all during the old days. Nothing short of a powerful succubus, dragon, vampire or other greater monster girl could withstand it!",
									  "Speaks",
									  "The enchantment really neutered it, however, since the attack was lethal in nature. We can still do it, but now it only really causes the victim's body to stiffen momentarily, similar to paralysis. Still useful in a fight, if we really need it.",
									  "She remains silent for a moment, before her expression turns to worry and she raises her hands a bit.",
									  "Speaks",
									  "N-Not that I've ever used it to kill anyone! Even before the enchantment was raised, I was never a fan of violence.",
									  "Speaks",
									  "I'd be the first to admit my species has a fearsome appearance, however. It serves as a tool for intimidation, should the need arise.",
									  "Speaks",
									  "... Or if I want to spook cute little adventurers trespassing into my yard.♥",
									  "ChangeProgress", "1",
                                      "JumpToScene",
                                      "Have a chat"
									  ]
					},
					{
                        "NameOfScene": "What's with the sculptures?",
                        "theScene": [ "Speaks",
									  "I'm a sculptor.♪",
									  "Speaks",
									  "I'm not the sort to turn people into statues with my gaze, but I do enjoy the art of making them from actual stone. I feel it resonates with me, you know?",
									  "Speaks",
									  "Helps that I have these ladies right on my head, and they're very good at noticing any imperfections I may have missed.",
									  "The serpents which make up Euryale's hair rise up and let out small hisses, causing the gorgon to smile.",
									  "Speaks",
									  "Yes, yes, you do a great job, girls.",
									  "Speaks",
									  "Once they're ready, I usually sell them at the capital. You'd be surprised by how much the nobles there pay for classical gorgon craftsmanship. Mhmhm, not that I'm complaining, of course.",
									  "Speaks",
									  "But I do keep at least one of each species I make in my garden. I have a lovely Harpy, a flexing Minotaur, two Lizard Girls... Oh, and a very elaborate Mimic. You can open it like a real chest!",
									  "She smiles proudly, before realizing something.",
									  "Speaks",
									  "...Do be careful if you attempt to do it. Don't know if the enchantment will help if you let the rock lid fall on your fingers...",
									  "Both Euryale and her bundle of snakes shudder slightly.",
									  "ChangeProgress", "1",
                                      "JumpToScene",
                                      "Have a chat"
									  ]
					},
					{
                        "NameOfScene": "What are those ruins outside?",
                        "theScene": [ "Speaks",
									  "Those are signs that this area was once occupied by my race a long time ago. We used to have little settlements like these where we congregated.",
									  "Speaks",
									  "Clearly abandoned for a long time. Now there are only a few pillars and this cave, which I claimed as my own.",
									  "Speaks",
									  "There's nothing particularly important about them. As far as I can tell, this place used to house some sort of library or other such place of study, though I've no idea why it fell to ruin.",
									  "Speaks",
									  "Human attack? Or perhaps some other monster? I've no idea. If I had to guess, it was either the former, or the gorgons who used to live here made some powerful Arch-Succubus particularly upset, so she blew the whole place up.",
									  "Speaks",
									  "Wouldn't surprise me, really. I visit the capital frequently, and there are some real nasty sorts there. Imagine them hundreds of years ago, when having a peaceful existence wasn't the norm yet!",
									  "Euryale huffs out in what seems to be distaste, but doesn't elaborate any further.",
									  "ChangeProgress", "1",
                                      "JumpToScene",
                                      "Have a chat"
									  ]
					},
					{
                        "NameOfScene": "Do you like it here?",
                        "theScene": [ "Speaks",
									  "Oh, I enjoy it a lot. My kind has an affinity towards mountainous terrain. Though I can't say I'm particularly close to the locals...",
									  "Speaks",
									  "Most of them find me intimidating, and really, I mostly enjoy the peace and quiet. Though I do use some of them for reference for my sculptures, and I pay them good money for it, so it's not like I have no connections.",
									  "Speaks",
									  "The Lizard Girls are the easiest to speak to; I suppose our shared reptilian heritage makes it easier? I do find their desire for a soulmate to be very endearing, though they can be pushy at times.",
									  "Speaks",
									  "Can't say I get along well with the Minotaurs. Too boisterous and brutish. The Mimics generally just do their own thing, but I never had any bad experiences with them...",
									  "Speaks",
									  "The Harpies are... difficult. Not because they're {i}bad{/i}, but they're just so energetic, it's hard to keep up with them. I visit their village occasionally to trade, and they just swarm all over you like a typhoon.",
									  "Speaks",
									  "If you ever go there and see a statue of a posing Harpy, you know who they got it from.♪",
									  "Speaks",
									  "There are some other interesting faces roaming about. For example, there's a Wurm living in the area! I saw her scare off caravans recently, probably to add their stuff to her hoard. Dragons are temperamental like that.",
									  "Speaks",
									  "I also saw the most lovely young lady near the top of the mountain. The way she moved her hips was breathtaking...♥ But alas, we have not spoken. And there is the temple at the peak, but I don't go there. I know better than to meddle with direct minions of the Demon Queen.",
									  "Speaks",
									  "And that's all I can say about the locals, I'm afraid. I hope that answers your question.",
									  "ChangeProgress", "1",
                                      "JumpToScene",
                                      "Have a chat"
									  ]
					},
					{
                        "NameOfScene": "You're... very beautiful.",
                        "theScene": [ "A smile grows on Euryale's face as she approaches you. She brings a hand over to your face and begins stroking your cheek with her fingers, giggling softly.",
									  "Speaks",
									  "And you're such a cute boy...",
									  "The gorgon wraps her arms around you, pushing you into her as she presses her lips against yours. You feel her soft breasts almost enveloping your head as she does so, due to the difference in height between you.",
									  "She brings her other hand to your hair, and you feel her claws lightly scratch your scalp as she continues to make out with you, pressing her large body against yours.",
									  "ChangeArousalByPercent", "15",
									  "It doesn't take long for her affections to start getting to you, and a bulge forms in your pants, which presses against one of her legs as she keeps it against your crotch.",
									  "ChangeArousalByPercent", "15",
									  "She eventually parts her lips from yours, her forked tongue passing over hers as she looks down at your face, now smeared in her black lipstick while she keeps you snugly pressed into her breasts, giving your hair a light scratch.",
									  "Speaks",
									  "Mhmhm... You're such a sweetheart.♥ I could keep kissing you forever.♥",
									  "ChangeArousalByPercent", "15",
									  "Before you can say anything, Euryale presses her lips into yours again and resumes her affectionate makeout session, the gorgon's tail swaying from side to side excitedly while she wraps her serpent-like tongue around your own.",
									  "ChangeArousalByPercent", "15",
									  "She gives you no rest as she showers your mouth with affection. You do the one thing you can think of and wrap your arms around her, causing her to giggle happily as she continues her kissing.",
									  "It takes a while, but she finally ends her assault on your lips, allowing you to break free of her embrace. You stumble back slightly, dazed by the fierce kissing, and she bring a hand to her mouth as she lets out a mischievous giggle.",
									  "Speaks",
									  "Mhmhm. Cutie.♥",
									  "ChangeProgress", "2",
                                      "JumpToScene",
                                      "Have a chat"
									  ]
					},
					{
                        "NameOfScene": "Actually, nevermind.",
                        "theScene": [ "Euryale tilts her head slightly, with her snake hair doing the same.",
									  "Speaks",
									  "Is there anything else you want?",									  
                                      "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Ask to see her garden",
                        "theScene": [ "Euryale beams up eagerly as you ask to see her garden of statues, clasping her hands together.",
									  "Speaks",
									  "Of course! Please, follow me.",
									  "Euryale guides you over to her garden, where her statues are in display. She promptly gestures for you to approach, smiling all the way.",
									  "JumpToScene",
									  "StatueMenu"
									  ]
					},
					{
                        "NameOfScene": "StatueMenu",
                        "theScene": [ "Menu",
									  "Approach the Harpy statue",
									  "Approach the Minotaur statue",
									  "Approach the Lizard Girl statue",
									  "Approach the Mimic statue",
									  "Approach the Kunoichi statue",
									  "Go back",
                                      "EndLoop"
									  ]
					},
					{
                        "NameOfScene": "Approach the Harpy statue",
                        "theScene": [ "You approach the statue depicting a Harpy. The bird woman has her wings wide open with a large smile on her face, posing as if about to jump. Like all the other Harpies you have seen so far, she is wearing a cute little hat on her head.",
									  "It becomes clear to you that this sculpture is extremely detailed; every individual feather of the Harpy's wings has been chiseled, and her clothes could well be mistaken for real from a distance.",
									  "Speaks",
									  "When I visited the Harpies' village to ask for a model volunteer, most rejected it because it sounded 'boring'. This one eventually agreed, but getting her to stand still was about as hard as making the actual sculpture...",
									  "Speaks",
									  "Obviously, such a thing takes me {i}hours{/i} to make. Can you imagine keeping a young Harpy in check for hours?",
									  "Speaks",
									  "Mhm. I do find them very endearing, though. Quirky and endearing. And the statue itself came out pretty well, if I say so myself.",
									  "Euryale smiles confidently, and her snakes seem to huff out in pride.",
									  "ChangeProgress", "1",
									  "JumpToScene",
									  "StatueMenu"
									  ]
					},
					{
                        "NameOfScene": "Approach the Minotaur statue",
                        "theScene": [ "You approach the statue depicting a Minotaur. The bull woman is flexing her muscles, with one arm pointed up and another one down, while sporting a cocky grin.",
									  "You note the details of the sculpture: the Minotaur's fur is carefully chiseled out, and her face, arms and abs have small visible scars. Her horns also have small details across them, including minute chips and scratches.",
									  "Speaks",
									  "Sometimes, I feel sorry for these girls. They injure themselves rather regularly, but it does little to stop them. They are proud of their strength and endurance.",
									  "Speaks",
									  "This young lady was one of my best models, as she could keep her pose for hours without flinching. I haven't seen her in a while, however... I think she may have left to be with the boy she liked.",
									  "Speaks",
									  "Mhmhm. I remember suggesting she bring him here to look at the statue. She turned into a shade of red I didn't believe was possible for a Minotaur.",
									  "Euryale lets out a rather mischievous giggle.",
									  "ChangeProgress", "1",
									  "JumpToScene",
									  "StatueMenu"
									  ]
					},
					{
                        "NameOfScene": "Approach the Lizard Girl statue",
                        "theScene": [ "You approach the statue depicting a Lizard Girl. She is standing in a combat pose, her claws outstretched and her mouth smugly open, showing off her fangs and forked tongue.",
									  "You note how every individual scale of her reptilian parts are carefully detailed, as are the insides of her mouth, up to her throat.",
									  "Speaks",
									  "I originally wanted a simpler pose, but this young lady insisted we do it like this. She wanted to look 'intimidating', to train her 'battle face' for when she fought her 'soulmate'.",
									  "Speaks",
									  "I wouldn't say she looks particularly scary... But to be fair, I am probably old enough to be her great-grandmother, so I am not easily frightened.",
									  "Your eyes dart over to Euryale as she mentions her seemingly great age, an eyebrow raised. Noticing your reaction, she glances back at you.",
									  "Speaks",
									  "Mhmhm. I don't look like it, hm? But don't worry, I have {i}plenty{/i} of experience...♥",
									  "Euryale gives you a wink, leaving you a little flustered as you look away.",
									  "ChangeProgress", "1",
									  "JumpToScene",
									  "StatueMenu"
									  ]
					},
					{
                        "NameOfScene": "Approach the Mimic statue",
                        "theScene": [ "You approach a statue depicting a treasure chest with a pair of large, muscular arms growing from its sides. Euryale urges you to open the chest, and as you do (with some effort), it reveals a sculpture of a Mimic inside.",
									  "The Mimic has a cocky grin on her face and is posing provocatively as she rests inside the chest. Her curly hair is carefully chiseled out, as are the teeth and fleshy interior of the treasure chest.",
									  "Speaks",
									  "Truth be told, I find Mimics slightly disturbing... Are the chest and the girl the same entity? Are they two separate consciousnesses, like me and my snake-hair?",
									  "Speaks",
									  "But I do feel this sculpture is one of my best works. The whole idea of having a statue that can open up to reveal a smaller statue really paid off in the end!",
									  "Euryale crosses her arms with a smirk and her snakes close their eyes, huffing in confidence. She is clearly proud of her work.",
									  "ChangeProgress", "1",
									  "JumpToScene",
									  "StatueMenu"
									  ]
					},
					{
                        "NameOfScene": "Approach the Kunoichi statue",
                        "theScene": [ "You approach the statue depicting what looks like a curvy, pointy-eared woman in a ninja outfit. She is posing with one foot raised off the ground, two fingers pointed close to her mouth, and her face mostly obscured by a mask.",
									  "SwapLineIf", "OtherEventsChoice", "Kunoichi's Hallway Dojo",
										"1", "BeatShizu", "Upon closer inspection, it strikes you that this is a statue of Shizu, the Kunoichi master.",
										"1", "", "The statue vaguely reminds you of the Kunoichi succubus who attacked you on your way here, but you can't tell for sure.",
									  "EndLoop",
									  "Speaks",
									  "This one is one of the most interesting cases I had. One night, I noticed this succubus skulking around my lair. I confused her for a thief and froze her in place with my gaze.",
									  "Speaks",
									  "But imagine: she was actually a member of the Demon Queen's army! Turns out she was just scouting the area. But really, she should've just introduced herself instead of sneaking into my lair...",
									  "PlayerSpeaks",
									  "And she didn't get upset over you paralyzing her?",
									  "Speaks",
									  "Not at all. In fact, it became evident to me that being frozen and at my mercy left her... very hot and bothered. Mhm, I put her {i}skills{/i} to the test as punishment for trespassing.♪",
									  "Speaks",
									  "After that, I got her to serve as a model during her free time... Though she asked me not to make sellable copies of the sculpture, which is fair enough. She probably doesn't want to be easily recognized.",
									  "ChangeProgress", "1",
									  "JumpToScene",
									  "StatueMenu"
									  ]
					},
					{
                        "NameOfScene": "Go back",
                        "theScene": [ "You tell Euryale you have seen enough, and the gorgon nods as she guides you back to the entrance of her lair.",
									  "JumpToScene",
									  "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Fight?",
                        "theScene": [ "IfChoice", "2", "EuryaleDefeated", "I'm sure!",
									  "Euryale smirks, her snakes raising themselves into a combative pose.",
									  "Speaks",
									  "You want to fight me? I'm quite strong, you know. I can throw a mean spell, mhmhm.♪",
									  "Menu",
									  "I'm sure!",
									  "Better not...",
                                      "EndLoop"
									  ]
					},
					{
                        "NameOfScene": "I'm sure!",
                        "theScene": [ "Speaks",
									  "You asked for it.♪",
									  "Euryale raises up to her full height and her snakes hiss out aggressively!",
                                      "CombatEncounter", "NoRunning",
                                      "Euryale",
                                      "StartCombat",
									  "DisplayCharacters",
									  "1",
									  "EndLoop",
									  "Euryale reappears soon after, letting out a satisfied sigh while her snakes relax on top of her head.",
									  "Speaks",
									  "Mhmhm. Cute and strong. Just how I like them...♥",
									  "ChangeProgress", "3",
									  "SetChoice", "2", "EuryaleDefeated",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Better not...",
                        "theScene": [ "The gorgon brings a hand to her mouth and giggles softly.",
									  "Speaks",
									  "Perhaps when you're a bit stronger. I wouldn't want to break such a cutie like you.♥",
									  "She winks at you mischievously, making you a little flustered.",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Sex?",
                        "theScene": [ "IfChoice", "2", "EuryaleDefeated", "Sex Accepted",
                                      "Speaks",
									  "Mmmm... I don't know. Do you deserve it, mhmhm?♥",
									  "She gives you a playful flick of her forked tongue as her eyes narrow.",
									  "Speaks",
									  "Perhaps if you beat me in a fight, I'd be willing to have some {i}real{/i} fun with you...",
									  "Speaks",
									  "Mmmm. Being so upfront about it to begin with. You're naughty...♥",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Sex Accepted",
                        "theScene": [ "Euryale's cheeks turn rosy as she licks her own lips.",
                                      "Speaks",
									  "Mmm. Naughty boy.♥ Being so upfront about such a thing... I should punish you.♥",
									  "Menu",
									  "Be kissed senseless",
									  "Snakey blowjob",
									  "Worship her body",
									  "Fuck the gorgon!",
									  "'Petrification' play",
									  "Actually, let's not",
                                      "EndLoop"
									  ]
					},
					{
                        "NameOfScene": "Be kissed senseless",
                        "theScene": [ "ChangeBGM", "music/Relaxing/Purple Planet Music - Dreamy - A Touch Of Zen (4_25) 62bpm.mp3",
                                      "The gorgon flicks her tongue out, letting out an audible but soft 'hiss' as she gazes at you. The serpents upon her head raise their heads and turn their eyes to you as well, as if stirred.",
                                      "She takes a step forward, bringing her hands to your face and softly pressing her plump black lips against yours, watching you with half-closed eyes.",
									  "Euryale grows more eager as the seconds pass, and you soon feel her forked tongue wrap around yours, and the gorgon begins pushing you down slightly, causing her to loom over you as she showers you with her affection.",
									  "ChangeArousalByPercent", "15",
									  "She hums contently as you fully accept her advances, wrapping your hands around her as she continues to make out with you for a little longer, until she parts her lips from yours, allowing you to breathe properly as she huffs out, her face covered in blush. Her snake hair writhes in response, and you realize all the serpents have their eyes fixed on you as she smiles.",
									  "Speaks",
									  "Get him, girls.♥",
									  "In an instant, all the snakes upon Euryale approach you and surround your head. You watch them for a moment before you notice them delivering little pecks all over your face, flicking their tongues into you to deliver small snake kisses.",
									  "ChangeArousalByPercent", "15",
									  "The gorgon watches as you are caught off-guard by the serpents' act, before she joins into the fun herself; she starts showering you in kisses while the serpents go on about their business, leaving you utterly helpless as you are kissed all over by Euryale and her snake hair.",
									  "ChangeArousalByPercent", "15",
									  "Their oral dominance makes you hard, your cock erect under your clothes until you feel one of Euryale's hands reach down to them and push them down, freeing your dick from its confines. It twitches delightfully as she trails her soft fingers by its side, but she doesn't go further from there. Instead, she brings her hand back up and traces her fingers over your hair, her serpent-like eyes locked into your own all the while.",
									  "Speaks",
									  "Mhm... We don't want you to make a mess out of your clothes when we make you cum from kisses alone.♥",
									  "ChangeArousalByPercent", "15",
									  "In your kiss-drunk state, your face covered in black lipstick marks, you can only respond with a happy whimper as Euryale presses her lips into yours again, while her snakes continue their affectionate peckings all over you.",
									  "ChangeArousalByPercent", "15",									  
									  "They surround your head entirely, ensuring your field of vision is made up of nothing but them and Euryale, her half-closed yellow eyes shining slightly as she smiles softly in her kiss, enjoying your expression as you surrender yourself to this prison of snake smooches.",
									  "ChangeArousalByPercent", "25",
									  "Your cock throbs and twitches, pre-cum leaking out as she gives you no indication she intends to stop until you finally ejaculate. It's clear she's also enjoying this a lot, as her face has gone red in blush, and she moans in your kiss, closing her eyes as you enjoy the taste of each other's tongues as they wrap up again.",
									  "ChangeArousalByPercent", "25",
									  "Her hands keep your head in place, her clawed fingers gently caressing your hair as she notices you tense up. She deeply kisses you again, holding you close to her before she lets your lips part, a trail of saliva still connecting the two of you.", 
									  "Speaks",
									  "Mmmm, you cutie...♥ Let it all out for me...♥",
									  "You feel your cock throbbing in need, eager to spurt out for her despite she not even touching it, her kisses leaving you inflamed with desire just by themselves, and you groan in the kiss, much to the gorgon's amusement as she gives your lips no rest.",
									  "PlayerOrgasmNoSpiritLoss",
									  "With your eyes closed, you lock your lips again, her snakes flicking their little tongues all over you as you pump out cum, unable to resist their advances any longer. Your semen splatters all over Euryale's stomach, which only seems to excite the gorgon further as she keeps your tongue tightly locked around hers, encouraging you to shoot out more and more onto her.",
									  "Eventually your orgasm settles down, and Euryale and her snakes lean back, freeing your head from the snakey prison. You still find yourself rather dazed from the overwhelming amount of affection you were just subject to, and the gorgon smiles softly as she watches you get back to your senses.",
									  "She brings a hand down, passing her fingers over the cum you splattered on her before bringing it to her mouth. She hums as she starts licking them clean.",
									  "Speaks",
									  "Good job...♥ Now, rest.♥",
									  "You nod as much as you are able as she leads you to her room, and helps you lay down on her bed before giving you a final, chaste kiss to the forehead as your vision starts to blur...",
									  "...",
									  "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
									  "RestPlayer",
									  "You wake up after a good nap, recovered from the snakey assault. Rising to your feet, you return to Euryale, who has cleaned herself by now. She smiles happily and her snakes flick their tongues at you playfully.",
									  "Speaks",
									  "Mhm, are you well rested? I hope you enjoyed that as much as I did... And word of advice? Never try to out-kiss a gorgon. Unless you want to lose.♪",
									  "ChangeProgress", "5",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Snakey blowjob",
                        "theScene": [ "ChangeBGM", "music/Relaxing/Purple Planet Music - Dreamy - A Touch Of Zen (4_25) 62bpm.mp3",
                                      "Euryale gives you a small but toothy grin as she guides you to her living room, before gesturing to one of her comfortable chairs. As you sit, the gorgon drops to her knees, before putting her hands on the edges of your pants, slowly pulling them down to reveal your cock.",
                                      "She brings her soft yet clawed fingers to it and begins to gently caress it, while her other hand reaches up to her toga and opens it, allowing her large breasts to break free.",
									  "Speaks",
									  "Mmmmm. You look delicious.♥",
									  "She wraps her fingers around your cock and begins slowly pumping it, which combined with the sight of her breasts, quickly aids you in becoming fully erect. As your cock rises to its full height, Euryale's eyes lock to it and she begins to breathe out hot breaths at it, causing it to it twitch slightly in response.",
									  "ChangeArousalByPercent", "5",
									  "The gorgon then opens her toothy maw and allows your cock inside, wrapping her lips around it as she does so. A gasp comes out of you and she begins to gently bob up and down on it, while her hand moves down and begins to fondle your balls.",
									  "ChangeArousalByPercent", "10",
									  "As you start to moan from the pleasure, her eyes look up your face and she lets you a giggle, content that you're enjoying yourself. Her forked tongue flicks at your cock's head inside her mouth, and you feel it sandwiched between the sides of her fangs as they rub against it; it's clear she's doing her best to keep it safe from an accidental bite.",
									  "ChangeArousalByPercent", "10",
									  "In the meantime, she continues to lovingly caress your balls, grabbing and massaging them between her fingers. Her claws lightly scratch them, but never to the point of causing you any pain and discomfort.",
									  "ChangeArousalByPercent", "15",
									  "You moan in delight as her service continues, causing you to instinctively bring your hand forward and place it on her head. Immediately, some of the snakes that make up her hair quickly but gently entangle themselves around your fingers, and Euryale allows your cock to break free of her mouth with a 'pop' before passing her long tongue over its surface.",
									  "ChangeArousalByPercent", "20",
									  "The gorgon giggles again as she starts nuzzling your cock, taking glee in its feel and the heat coming from it as she smiles softly at you. She then allows it back into her mouth and picks up her pace, and another group of snakes reach forward in order to approach your crotch area.",
									  "ChangeArousalByPercent", "25",
									  "Before you can quite register what she's planning, Euryale starts deepthroating your cock, still fondling your balls as her snakes then begin flicking their tongues all over your crotch, tickling you as they do.",
									  "ChangeArousalByPercent", "30",
									  "You let out a loud moan as your cock is devoured by the serpentine woman, your crotch around your dick playfully tickled by her snakes and your balls are gently massaged by her skilled fingers. Pre-cum leaks off your cock, which seems to only encourage Euryale to speed up further, the tip of her tail waggling excitedly as she grows more aroused herself.",
									  "ChangeArousalByPercent", "30",
									  "The gorgon gives you no rest as she dominates you with her mouth, her long tongue wrapping around your cock like a lollipop as it reaches her throat again and again, eager to milk you of every drop of your semen. As you moan and gasp from the snake woman's advances, she hums out almost mischievously, watching you intently as she continues to cup your balls with her fingers and tickle your crotch with her monstrous hair.",
									  "PlayerOrgasmNoSpiritLoss",
									  "You find yourself unable to withstand the pleasure any longer as you press Euryale's head into your cock, pumping out a powerful load of cum right into her hungry throat.",
									  "The gorgon moans out in delight as her tongue tightly wraps around your dick, bobbing up and down in order to milk you as much as possible as you keep pouring your seed into her. Her snakes shiver in satisfaction and retreat from your crotch, while she gives your balls a final, gentle cup.",
									  "Once your orgasm finally subsides, Euryale allows your cock to break free of her mouth, while the snakes around your hand slowly disentagle themselves. The gorgon gently presses your still sensitive cock in her cheek, smiling contently as she gazes at your pleasure-drunk expression.",
									  "Speaks",
									  "Thanks for the meal.♥ But now I think someone needs a rest.",
									  "As she says so, you realize just how fatigued this entire endeavor made you, and you decide to close your eyes and take a breather as the gorgon rises to her feet...",
									  "...",
									  "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
									  "RestPlayer",
									  "As you wake up later, you notice a comfortable blanket covering your body. Getting up and stretching yourself, you walk out of the living room to find Euryale once again. As you approach, her snakes turn their heads to you, before the gorgon does the same.",
									  "Speaks",
									  "Well rested, {ThePlayerName}? I covered you since I didn't want you to get cold, mmhm. And by the way... good job.♥",
									  "The gorgon winks and puts her index finger in her mouth playfully, causing you to blush as memories of her oral service quickly return to you mind.",
									  "ChangeProgress", "5",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Worship her body",
                        "theScene": [ "ChangeBGM", "music/Relaxing/Purple Planet Music - Dreamy - A Touch Of Zen (4_25) 62bpm.mp3",
                                      "Euryale's eyes widen and her snakes all turn their attention to you. She almost immediately turns red in blush.",
                                      "Speaks",
									  "W-What...? You want to... worship my body?",
									  "Speaks",
									  "M-My my... Who am I to refuse such a proposal?♥",
									  "The gorgon quickly undresses herself, allowing her toga to fall on the floor beneath her. Her flawless pale skin, her large breasts and her lovely pussy all lay bare before your eyes, and she presents herself to you in visible anticipation.",
									  "Speaks",
									  "Mmmm. Indulge yourself in me...♥",
									  "You circle around Euryale, the snakes on her head following your movements curiously before you approach her from behind, wrapping your arms around the gorgon. She lets out a little gasp of surprise as you start kissing the nape of her neck, your hands caressing the sides of her stomach as you do so.",
									  "She puts her own hands over yours as they go up, and you start groping and kneading her large, soft breasts, causing a pleased hum to escape the gorgon. She leans her head back, resting it into yours as you continue to lovingly kiss her neck.",
									  "Your hands sink in the soft flesh of her tits, and you eagerly grope, fondle and knead them, allowing your fingers to gently roll around her nipples as you feel them growing erect from your stimulation. She sighs contently and presses her rear against you, her tail threatening to coil itself around your right leg, and you begin making your way down, kissing her back while still groping her tits.",
									  "Once done, you let go of her breasts as you then circle around her again, now facing the gorgon who looks at you with a pleasured and somewhat flustered smile on her face. You lean down, bringing your hands to her hips and caressing them as you start delivering small kisses all over her navel, and Euryale lets out an elated giggle as she watches you.",
									  "Speaks",
									  "Haa~ You're such a sweetheart...♥",
									  "She brings a hand to your head and caresses your hair in praise, and your trail of kisses goes upward until you reach her tits, where you then allow her right nipple into your mouth as you start suckling it, causing a moan to escape the gorgon. Your hands reach up behind her and you start groping and fondling her thick rear, and she clearly delights in your advances as her shakes her hips a little.",
									  "She pats you as you suckle and taste her nipple, heavy breaths escaping her as you circle and flicker it with your tongue, and you grope and knead her ass with one hand while another delivers a small smack, receiving a surprised but not displeased yelp from the large gorgon.",
									  "As you switch to her other nipple, your hands trail up to the base of her tail and you start caressing its underside. Euryale's entire body shudders in pleasure, and she shoves your head into her tit as she moans out from your loving worship, her serpentine hair writhing and contorting as well while you continue to indulge yourself in her body.",
									  "Once safistied with suckling her nipples, you decide it's time to go downwards again, her hand still caressing your head all the way. You crouch in order to face her pussy, with it already dripping in her love juice from your ample stimulation. Your hands travel down, and you begin caressing her long legs as you put your head in her crotch, tasting her clit with your tongue.",
									  "Euryale lets out a loud moan as you start eating her out, feeling you eagerly roll your tongue around her vulnerable clit and taste her honey, while your hands caress and fondle her thighs and legs. The gorgon's eyes widen again when you bring one arm around her right leg and lift it off the ground, before bringing it over your shoulder, allowing it to rest there as you continue your service.",
									  "Speaks",
									  "A-Ahn! You absolute cutie!♥ If you do this, there's no way I'll be able to resist you.♥",
									  "ChangeArousalByPercent", "35",
									  "Not content to be the only one receiving any pleasure in this act, Euryale's tail reaches up from between her legs and pulls your pants down, allowing your rock hard erection to bounce free from its confines. You feel the tip of the tail wrap around your dick, pumping it eagerly, which only serves to encourage you further in pleasuring the beautiful gorgon's pussy.",
									  "ChangeArousalByPercent", "35",
									  "Keeping your arms wrapped around her thighs, you eat her out to your heart's content, and she moans out in delight, rewarding your eager services with a tailjob. You hear Euryale's breathing grow heavier by the moment, until you feel her hand take a strong grip of your head, shoving it into her pussy as she shudders.",
									  "ChangeArousalByPercent", "30",
									  "Speaks",
									  "MMMHH! C-CUMMIIING!♥♥♥",
									  "PlayerOrgasmNoSpiritLoss",
									  "The gorgon yells, her body shaking delightfully over you as she reaches her orgasm. You taste her pussy juice in your tongue, and her tail tightens around your cock, pumping it rapidly in response. It doesn't take long for you to cum yourself, letting out a rope of semen into the floor beneath you and covering Euryale's tailtip with your seed.",
									  "As the gorgon regains her composure, she looks down at you with a loving expression, breathing heavily as her face is red in blush.",
									  "Speaks",
									  "You're such a good boy...♥ Now, come and cuddle with me.♥",
									  "You nod and Euryale wraps an arm over your shoulder, guiding you to her bed. As you both lay down, she gives you a chaste kiss to the forehead before pulling her blankets over the two of you, and you drift off to sleep...",
									  "...",
									  "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
									  "RestPlayer",
									  "As you wake up later, you notice Euryale has already gotten up. Stretching up and rising to your feet, you walk over to her room, where you find the gorgon relaxing in her chair. Her snakes turn their heads to you, and she gives you a sweet smile.",
									  "Speaks",
									  "Slept well, {ThePlayerName}? Mmhm, I know I did...",
									  "She gives you a wink and her smile widens a bit.",
									  "Speaks",
									  "Now, what do you intend to do next, hm?",
									  "ChangeProgress", "5",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Fuck the gorgon!",
                        "theScene": [ "ChangeBGM", "music/Relaxing/Purple Planet Music - Dreamy - A Touch Of Zen (4_25) 62bpm.mp3", 
                                      "Euryale grins and her snakes hiss audibly as she grabs your hand and immediately guides you to her bedroom. Once there, the gorgon wastes no time in taking off her toga, revealing her beautiful nude body to you while you undress yourself.",
                                      "She licks her lips at the sight of your semi-erect cock before lying on the bed, positioning herself as to give you a full view of her large ass and swaying tail, and shaking her generous ass to you while looking over her shoulder.",
									  "Speaks",
									  "Mmm. Come and get it, then.♥",
									  "ChangeArousalByPercent", "10",
									  "The sight of the gorgon's captivating butt quickly brings your erection at full mast, and you jump into the bed, teasing the gorgon by rubbing your cock between her cheeks before plunging it into her waiting pussy, causing her to gasp out in pleasure as you start fucking her doggy style.",
									  "ChangeArousalByPercent", "10",
									  "You eagerly thrust your dick into her over and over, and she moans and mewls in delight as her honeypot consumes your cock completely.",
									  "ChangeArousalByPercent", "10",
									  "You take the opportunity to grab onto her ass, fondling and groping Euryale's buttcheeks as you continue to fuck her. You feel her tail softly rub itself against your back as she continues to watch you, a wide smile on her face.",
									  "Speaks",
									  "Aaaah!♥ So eager! Imagine all the things you could do to me!♥",
									  "ChangeArousalByPercent", "10",
									  "Her encouragement leads you to pick up the pace slightly as you start telling her your fantasies; how you want to bury your cock deeply into her, watch her writhe in the pleasure of you pumping a huge load of cum into her pussy, and this causes her to grin widely and mewl out in joy. You feel Euryale push her hips into yours, timing with your thrusts as to make this experience even better for you both.",
									  "Speaks",
									  "S-Such -unf- a naughty boy!♥ So eager -ahh- to make a gorgon yours?~",
									  "ChangeArousalByPercent", "10",
									  "She wiggles her ass to you in provocation, and you respond by delivering a spank to her buttocks, getting a surprised yelp in response from Euryale as you then grab on to her tail and start thrusting even harder than before.",
									  "Her eyes roll up, her snakes all writhing in excitement as you pound her, eager for more of this pleasure. You quickly start losing track of time at this point, losing interest in anything that's not the gorgeous monster woman in front of you.",
									  "ChangeArousalByPercent", "30",
									  "However, you suddenly feel her tail quickly wrap itself around you, and Euryale throws her entire body weight against you, forcing you down as she begins riding you. With her back still turned to you, she leans over her shoulder and sticks the tip of her tongue out playfully at you, before moaning out once again.",
									  "ChangeArousalByPercent", "15",
									  "Now with the gorgon riding your cock from above, you have no choice but to stay in place and indulge in the wonderful feeling of her tight pussy swallowing your dick over and over, as Euryale bounces on it, moaning and gasping out loud.",
									  "Speaks",
									  "Aaaah! Aaaaaahh!! M-More!",
									  "ChangeArousalByPercent", "15",
									  "Her tail looms over your head, and as you pass a hand through it, you notice her squeal out in response as it raises slightly. You can tell she is sensitive there, which gives you an idea.",
									  "You grab hold of the tail and start peppering its underside in kisses, causing Euryale to practically yell out in joy, leading her to ride you more intensily than before. At this point, her snake hair is completely wild, as if the serpents are no longer able to keep quiet from the pleasure soaring through the gorgon's body.",
									  "As the gorgon is consumed by the pleasure, however, you notice she has left herself open. With a strong push, Euryale yelps as she is thrown out of your cock and into the bed again, and you quickly roll her over so that she is laying on her back, with you looming over her, your cock pressed against her pussy.",
									  "As she regains her composure and realizes her position, she grins lustfully again, her body shuddering in anticipation as she leaves herself at your mercy.",
									  "Speaks",
									  "S-Such an eager young man, y-you're gonna make me-EEEEK!!♥",
									  "ChangeArousalByPercent", "40",
									  "You stop her mid-sentence as you plunge your cock into her pussy once again, pressing yourself on top of the gorgon as you do so, pinning her against the bed. Both her and her snakes lose their composure entirely, their eyes widening while her large tail waggles from side to side excitedly.",
									  "ChangeArousalByPercent", "15",
									  "As you mating press her, Euryale's pupils fire up in lustful passion as she holds into your back, her claws scratching it while her legs wrap tightly around your waist. Now locked in place, you do exactly what you intended from the start and fuck the serpentine woman as much as you are able.",
									  "ChangeArousalByPercent", "15",
									  "At this point, both you and her are completely covered in sweat as your passionate lovemaking continues, your combined moans deafening all other sounds. Euryale shrieks out as she has her orgasm, and you yelp out in surprise as she suddenly gives you a powerful love bite to the base of your neck, but any pain this may have caused goes completely unnoticed in your lust-blinded mind.",
									  "PlayerOrgasmNoSpiritLoss",
									  "With a final, powerful thrust, you bury your cock as deeply into Euryale's naughty pussy as you can, pumping load after load of your cum into her. She yells out in delight, her hands and legs tightening their hold on you as she feels your seed being poured inside her.",
									  "The gorgon begins to eagerly smooch your face, and her snake hair starts peppering you in tiny kisses as you continue to blast more ropes of cum into her until you feel you can no longer do so.",
									  "A few minutes pass until you both recover from your orgasms, and Euryale unwraps her legs in order to free your lower body. However, she holds you on top of her and keeps your cock buried inside her as she murmurs.",
									  "Speaks",
									  "Mmmm... Stay there... and cuddle...",
									  "You are quick to oblige as you lay on top of her large, comfortable body, and it doesn't take long for the two of you to drift off to sleep...",
									  "...",
									  "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
									  "RestPlayer",
									  "You slowly open your eyes much later, quickly noticing Euryale watching you with a smile. You're still laying on top of her, your head resting comfortably on her large breasts, though you feel your cock is no longer inside her. As you wake up, her snakes lean forward and begin flicking their tongues in your face playfully.",
									  "Speaks",
									  "I hope you rested well, cutie. You did such a good job there...♥",
									  "The snakes play with you a bit more, and the gorgon keeps you on top of her to cuddle for a while longer, but eventually the two of you decide it's time to get on your feet. You lay off from Euryale and from the bed, putting up your clothes again as she dresses up herself.",
									  "You both return to the entrance of her lair, and she watches you with a small blush in her face.",
									  "ChangeProgress", "5",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "'Petrification' play",
                        "theScene": [ "Euryale doesn't react at first, but once she registers what you asked, her eyes widen a bit as both her and all of her snakes turn to you.",
                                      "Speaks",
									  "W-What? Petrification? A-Are you quite sure?",
									  "Her face seems genuinely worried by your suggestion as she takes a step back.",
									  "Speaks",
									  "I can't petrify you, but my gaze attack would still cause a powerful magical paralysis to befall you. Obviously I'll be here for you, but you {i}will{/i} be sent back to your human town if I were to do this... Are you really sure you want to go through it?",
									  "Menu",
									  "When you put it like that...",
									  "Yes, I'm sure!",
                                      "EndLoop"
									  ]
					},
						{
							"NameOfScene": "When you put it like that...",
							"theScene": [ "Euryale nods, and her snakes relax as they return to their usual position.",
										"Speaks",
										"I can understand your curiosity, {ThePlayerName}, but I don't want to do anything that might make you uncomfortable.",
										"JumpToScene",
										"TalkMenu"
										]
						},
						{
							"NameOfScene": "Yes, I'm sure!",
							"theScene": [ "Euryale closes her eyes. She remains silent for a moment, and you can't help but ponder if you made her upset with this decision. However, she finally speaks again.",
										"ChangeBGM", "music/Loss/Do not yarn.mp3",
										"Speaks",
										"...Very well. You asked for it.",
										"Her eyes then open, and a powerful cone of magical energy erupts from each, radiating a golden color. When the enchanted blast hits you, you gasp out as you feel your body stiffening, unable to even yell in discomfort. You are barely able to stand on your feet.",
										"Before you have the chance to fall over, however, Euryale grabs and holds you against her. The gorgon looks into your eyes with a caring smile, and you feel her taking hold of your body and lifting it off the ground as she starts to walk somewhere.",
										"Speaks",
										"Asking a gorgon to petrify you... You are a hopeless pervert, mmhm.",
										"Your body twitches slightly, and you manage to let out small gasps in your paralyzed stupor. Euryale carries you until she sits down on one of her larger seats, gently placing your head on her lap while watching your reaction.",
										"Speaks",
										"I warned you it'd feel uncomfortable. But don't worry... I'm here for you.",
										"You watch as she brings a hand to her toga and takes off the top part, allowing her breasts to bounce free and loom over your head. At the same time, her other hand undoes your trousers, and you feel her soft fingers caress your cock as she looks down to you.",
										"She then brings your head up just slightly and leans her body down, allowing one of her nipples to reach you so that you may suckle on it; in this defenseless state, barely able to move, you wrap your lips around it without a second thought, finding comfort in her touch as your cock slowly grows erect between her fingers.",
										"Speaks",
										"Sssshhh... It's okay... I'll keep you safe...♥",
										"Mustering a groan, you suck on her nipple, feeling her hand caressing your hair and lightly scratching your scalp with her claws, while she begins pumping your now erect cock gently and sensually, causing a shiver of pleasure to course through your paralyzed body.",
										"You struggle in your afflicted state to raise one hand up, and she watches as you manage to grab onto her other breast, your fingers sinking into its soft skin and bringing a smile to her face as you begin to slowly grope it.",
										"Euryale closes her eyes, sighing as you weakly roll your tongue around her nipple and suck on it again, your fingers gently kneading her breast as you nurse her. She blushes, her snakes all watching you intently while she continues her gentle handjob.",
										"Speaks",
										"Good boy...♥",
										"She takes her hand off of your cock for a moment in order to gently squeeze and fondle your balls, causing a moan to escape you as you continue to suckle on her teat, your body shivering in a mix of paralytic magic and sexual pleasure.",
										"PlayerOrgasm", "1",
										"She then brings her hand back to your dick and gently pumps it up, and down, and again and again, filling your weak body with bliss as you are left completely and utterly at her mercy. It doesn't take long for a spurt of cum to coat her fingers as you feel unable to hold back any longer.",
										"PlayerOrgasm", "2",
										"However, she does not stop. Instead, she gives you a sweet, gentle smile as she continues her service, slowly scratching your head as she uses only two fingers to tease and handle your ridid cock, causing another rope of cum to come out.",
										"Speaks",
										"Let it all out for me...♥ It'll be alright...♥",
										"PlayerOrgasm", "2",
										"You stop suckling on her as a prolongued moan escapes you, another cumshot escaping your powerless body, each of them sending an overwhelming sensation of mixed weakness and pleasure all over you. You immediately return to her teat, however, delighting in her taste around your tongue as she continues to pamper you.",
										"PlayerOrgasm", "3",
										"Each orgasm she milks out of you seems stronger than the last, as you grow weaker and more sensitive. You knead her breast and suckle on her nipple as much as you can, but you feel yourself growing less and less able to move every passing moment.",
										"SetSpirit", "0",
										"Your body tenses up as you let out one final spurt of cum, gasping as you become unable to do anything but shiver weakly in Euryale's lap. Your vision starts to fail and your Recall Stone begins to activate. She looks down at you with a sincere, comforting smile as she brings her hand to her mouth, licking your cum out of it.",
										"Speaks",
										"Goodbye, {ThePlayerName}. Have a good rest.♥",
										"With a mild groan, you feel yourself freed from her grasp as you are taken away, longing for more of her sweet touch and her soft teat in your lips admist your weakened stupor before you lose consciousness entirely...",
										"ChangeProgress", "5",
										"ChangeFetish", "Breasts", "5",
										"ChangeFetish", "Monstrous", "5",
										"ChangeSensitivity", "Magic", "10",
										"GameOver"
										]
						},
					{
                        "NameOfScene": "Actually, let's not",
                        "theScene": [ "Euryale frowns slightly and her snakes hiss out loud, glaring down at you in disapproval.",
                                      "Speaks",
									  "Why even bring it up, then? Please don't waste my time, dear.",
									  "JumpToScene",
                                      "TalkMenu"
									  ]
					},
					{
                        "NameOfScene": "Leave",
                        "theScene": [ "Euryale's face shows some disappointment before she gives you a warm smile.",
                                      "Speaks",
									  "Leaving already? Goodbye then, {ThePlayerName}. Do come back whenever you like...",
									  "You make your way back out and resume your adventure, the gorgon giving you a final wave as she returns to her sculptures.",
									  "StopBGM"
									  ]
					},
					{
                          "NameOfScene": "Euryale Progression",
                          "theScene": [ "progress walkthrough (it doesn't do anything atm but WHO KNOWS, MAYBE ONE DAY?)",
                                      "Meeting her and being nice (no booli) - 1",
									  "Talk options - 1 or 2",
									  "Winning a fight - 5",
									  "Sex options - 5",
									  
                                      "SetChoice 1 - RejectedEuryale or EuryaleForgiven. Dictates how her intro plays.",
                                      "SetChoice 2 - EuryaleDefeated. Dictates whether you beat her in a fight. Unlocks sex options."
                                    ]
                      },
					  {
                          "NameOfScene": "Event Broke",
                          "theScene": [ "aaaa what did you do it broke and ruined everything i hope you're happy"
                                    ]
                      }
	]	
}
