{
    "name": "Euryale",
    "IDname": "Euryale",
    "species": "Aberrant",
    "gender": "female",
    "description": "A tall and imposing woman with light gray skin whose hair is made up of a large swarm of writhing green-scaled serpents, some which reach down all the way to her shoulders. Her eyes possess vertical yellow pupils and black sclera, and a pair of pointed ears poke out from the sides of the serpent swarm. She has a seductive smile upon her plump black lips, and as she opens them, she reveals her large snake-like fangs and a long, forked tongue.\n\nShe is wearing a long, silky white toga which does a poor job at hiding her soft yet firm D-cup breasts, giving you a very good view of her cleavage and sideboob. Trailing down her body, the garment complements her body nicely, showing off her large thighs and generous rear as she walks.\n\nThe skin of her lithe arms eventually gives way to dull green, soft-looking scales as it reaches her hands, her fingers adorned with large claws. The same goes for her long legs and her feet, which lay bare.\n\nSprouting from her rear is a large, serpentine tail which trails behind her as she walks, slightly raised from the ground and adorned with several golden bracelets near its tip.",
    "encyclopedia": "Hnnngh pamper me gorgon mommy.",
    "tags": "none",
    "generic": "False",
    "requires": [ ""],
    "skillList": [ "Gorgon's Arousing Spell", "Gorgon's Debilitating Spell", "Gorgon's Cock Worship", "Gorgon's Eager Fucking", "Gorgon's Gaze", "Gorgon's Kissing Invitation", "Gorgon's Leg Lock", "Gorgon's Loving Smooching", "Gorgon's Oral Invitation", "Snakey Kissie Assault", "Toga Teasing"],
    "perks": [ "Arcane Adept", "Arcane Expert", "Clingy", "Loving", "Pacing", "Semen Frenzy", "Skilled Tongue", "Unbounded"],
    "stats": { "lvl": "40",
              "Exp": "550",
              "max_hp": "850",
              "max_ep": "10",
              "max_sp": "1",
              "Power": "18",
              "Technique": "15",
              "Intelligence": "40",
              "Allure": "45",
              "Willpower": "22",
              "Luck": "10"
    },
    "Fetishes": [ ""],
    "BodySensitivity": { "Sex": "75",
              "Ass": "75",
              "Breasts": "100",
              "Mouth": "65",
              "Seduction": "125",
              "Magic": "45",
              "Pain": "25",
              "Holy": "100",
              "Unholy": "100"
    },
    "resistancesStatusEffects": {
              "Stun": "40",
              "Charm": "25",
              "Aphrodisiac": "15",
              "Restraints": "40",
              "Sleep": "25",
              "Trance": "0",
              "Paralysis": "0",
			  "Debuff": "0"
    },
    "moneyDropped": "1450",
    "ItemDropList": [
                      {
                        "name": "Fairy Dust",
                        "dropChance": "75"
                      },
					  {
                        "name": "Shed Gorgon Snake-Hair",
                        "dropChance": "60"
                      },
					  {
                        "name": "Magus Staff",
                        "dropChance": "30"
                      },
					  {
                        "name": "Fae Moon Rune",
                        "dropChance": "20"
                      }
                    ],
    "lossScenes": [
                    {
                        "NameOfScene": "DefaultLoss",
                        "move": "",
                        "stance": "",
                        "includes": [ "Euryale"],
                        "theScene": [ "You lose your composure altogether as exhaustion takes over, unable to continue fighting. Euryale brings a hand to her lips and lets out a soft giggle.",
                                    "Speaks",
                                    "I warned you I'm strong.♪ But you did your best, and that's what matters.",
                                    "The gorgon walks over to you and wraps an arm around your head, before bringing you closer. You immediately find your face smothered between her large breasts, a half-dazed murmur of bliss coming out of you.",
									"Speaks",
									"Now, for {i}my{/i} reward for beating you, mhmhm.♥",
									"She brings a hand down and wraps her fingers around your still sensitive cock, and without wasting time, she starts pumping it up and down. You gasp out from the pleasure, your eyes rolling back.",
									"She has a gentle smile as she looks down at you, her other hand going over your head as she starts caressing your hair, while very gently shoving your head further into her cleavage.",
                                    "PlayerOrgasm", "1",
									"You fail to hold back a moan as you spurt out cum into her hand, and she hums audibly as she slows down her pumping, enjoying the feeling of your hot seed between her fingers.",
									"Speaks",
									"Good boy.♥",
                                    "She gives you a brief moment of rest before her handjob continues, causing you to gasp and bury yourself deeper in her tits. She coos and pats your head gently, closing her eyes and smiling as she continues her service.",
									"PlayerOrgasm", "1",
									"Her extremely affectionate advances force another load out of you, and it splatters out of her hands into her stomach, though despite the mess, she giggles again in glee as she continues to pump on your cock, making no sign of stopping.",
									"Speaks",
									"You can give me more, right? I know you can do it.♥",
									"She shakes her tits, smothering your face in them even further and leading you to moan out in glee as she starts scratching your head in praise. Her snakes look down at you curiously as your face contorts from the pleasure coursing through you.",
									"PlayerOrgasm", "1",
									"In this soft and gentle prison you find yourself in, you find yourself unable to do anything but surrender utterly to the gorgon's skilled touch, spurting out another load of hot cum on her stomach which leads her to hum out and giggle.",
									"PlayerOrgasm", "1",
									"You close your eyes, a dumb smile across your face as she continues to milk and praise you for every load you let out, caring for nothing else at the moment but her soft touch, her sweet voice and her skilled hand making your cock completely hers.",
									"PlayerOrgasm", "1",
									"As you cum one more time, you start losing your senses. Your Recall Stone activates, and Euryale finally lets go of your overstimulated cock, bringing her cum-soaked fingers to her mouth so that she may lick them with her long forked tongue.",
									"Speaks",
									"Mhmmmmm. I'll be well fed tonight...♥ Thank you, cutie.♥",
									"She holds on to your weakened body until you vanish, ensuring that until you are sent back to Town, you may rest your head upon her wonderfully soft tits at least a while longer...",
                                    "ChangeFetish", "Sex", "5",
									"ChangeSensitivity", "Sex", "5"
                                  ],
                        "picture": ""
                    },
					{
                        "NameOfScene": "PenetrationLossVaginal",
                        "move": "",
                        "stance": "Sex",
                        "includes": [ "Euryale"],
                        "theScene": [ "You moan as you cum deep inside Euryale's hot pussy, and she reacts by shaking her hips slightly, keeping your overstimulated cock buried inside her.",
                                    "Speaks",
                                    "Your own fault for trying to fuck me silly, mhmhm. Now I'll milk you of your delicious cum.♥",
                                    "She pushes you into the ground, gasping out in pleasure as she begins riding you. She has her legs wide up and places her hands on her knees, allowing you a full view of her matriarchal body as she slams her hips down on you again.",
									"Her large breasts bounce up and down in a rhytm, and you raise your arms weakly, hoping to grab them. However, her tail comes out from behind her and gently smacks your hands away. Euryale giggles smugly before gasping out in pleasure.",
									"Speaks",
									"Mmmm!♥ You're so cute when you squirm like that!♥",
									"Unable to retaliate, you lay down and do the only thing you can muster; watch the victorious gorgon have her way with you, gifting you the perfect view of her body as she rides you mercilessly, swaying her breasts purposefully so that you'll keep your eyes locked to them.",
                                    "PlayerOrgasm", "1",
									"The pleasure is unbearable, and you let out another rope of cum into the gorgon's greedy womb, causing her to slam down into you in order to bury you as deeply inside her as possible. She giggles out gleefully as she feels your seed inside her, and you thrust your hips up as much as you're able, indulging in her movements.",
									"Speaks",
									"Naughty. I see what you're doing...♥ And I'm glad you're enjoying it as much as I am.♥",
									"Speaks",
									"But we can't be done yet, right? I haven't milked you enough.♥",
                                    "Euryale raises her hands, which are enveloped in magical energy before she presses her palms into your chest. Not only does this further pin you beneath her, you also feel magical energy coursing through you, leaving your entire body extremely sensitive.",
									"PlayerOrgasm", "1",
									"The intense change in sensitivity causes you to gasp out as another load of cum immediately spurts out of your cock and into her, and Euryale hums out loud in pleasure as she gyrates her hips, eager to take as much from you as she can.",
									"Speaks",
									"Yes, good boy!♥ Fill me up...!♥",
									"She leans down on top of you, leading your head to be trapped between her large, soft breasts as she gyrates her hips more. Both of you gasp and moan as you are overcome in the newfond pleasure of your sensitized body.",
									"Any resistance you intended to present at this point is gone, as you can think of nothing more than the divine feeling of the gorgon using your cock, and her wonderful breasts rubbing and cuddling into you as she makes deliberate movements to ensure you are smothered by them with every move of her hips.",
									"PlayerOrgasm", "1",
									"This time, you manage to raise your arms, and you embrace Euryale, who coos lovingly in response, smothering your head a little more between her ample cleavage in order to pleasure you even further. Another rope of cum leaves your sensitive cock, causing the gorgon to moan in delight.",
									"PlayerOrgasm", "1",
									"Her tail sways happily from side to side as she milks cumshot after cumshot from you, keeping your weakened and vulnerable body comfortably pinned under her all the way through, letting you nuzzle her tits and indulge in the softness of her large body.",
									"PlayerOrgasm", "1",
									"You groan, fatigued and barely conscious, as your magically-sensitized body pumps one more load into the gorgon's naughty slit, who presses herself into you, ensuring not a drop escapes her. Your Recall Stone begins to activate, and Euryale finally stops, bringing a hand over to your hair and gently caressing it.",
									"Speaks",
									"Oooh...♥ So much delicious cum... You're such a good boy...♥",
									"You murmur happily in response as Euryale cuddles with you, keeping you trapped under her soft and warm body until your Stone finally takes you away, though your body longs for more of the loving gorgon's sweet touch and gentle praise...",
                                    "ChangeFetish", "Sex", "5",
									"ChangeFetish", "Breasts", "5",
									"ChangeSensitivity", "Sex", "5",
									"ChangeSensitivity", "Magic", "10"
                                  ],
                        "picture": ""
                    },
					{
                        "NameOfScene": "PenetrationLossAnal",
                        "move": "",
                        "stance": "Anal",
                        "includes": [ "Euryale"],
                        "theScene": [ "You moan as you cum deep inside Euryale's ass, and she reacts by shaking her hips slightly, keeping your overstimulated cock buried inside her.",
                                    "Speaks",
                                    "Your own fault for trying to fuck me silly, mhmhm. Now I'll milk you of your delicious cum.♥",
                                    "She pushes you into the ground, gasping out in pleasure as she begins riding you. She has her legs wide up and places her hands on her knees, allowing you a full view of her matriarchal body as she slams her hips down on you again.",
									"Her large breasts bounce up and down in a rhytm, and you raise your arms weakly, hoping to grab them. However, her tail comes out from behind her and gently smacks your hands away. Euryale giggles smugly before gasping out in pleasure.",
									"Speaks",
									"Mmmm!♥ You're so cute when you squirm like that!♥",
									"Unable to retaliate, you lay down and do the only thing you can muster; watch the victorious gorgon have her way with you, gifting you the perfect view of her body as she rides you mercilessly, swaying her breasts purposefully so that you'll keep your eyes locked to them.",
                                    "PlayerOrgasm", "1",
									"The pleasure is unbearable, and you let out another rope of cum inside the gorgon's ass, causing her to slam down into you in order to bury you as deeply inside her as possible. She giggles out gleefully as she feels your seed inside her, and you thrust your hips up as much as you're able, indulging in her movements.",
									"Speaks",
									"Naughty. I see what you're doing...♥ And I'm glad you're enjoying it as much as I am.♥",
									"Speaks",
									"But we can't be done yet, right? I haven't milked you enough.♥",
                                    "Euryale raises her hands, which are enveloped in magical energy before she presses her pamls into your chest. Not only does this further pin you beneath her, you also feel magical energy coursing through you, leaving your entire body extremely sensitive.",
									"PlayerOrgasm", "1",
									"The intense change in sensitivity causes you to gasp out as another load of cum immediately spurts out of your cock and into her, and Euryale hums out loud in pleasure as she gyrates her hips, eager to take as much from you as she can.",
									"Speaks",
									"Yes, good boy!♥ Fill me up...!♥",
									"She leans down on top of you, leading your head to be trapped between her large, soft breasts as she gyrates her hips more. Both of you gasp and moan as you are overcome in the newfond pleasure of your sensitized body.",
									"Any resistance you intended to present at this point is gone, as you can think of nothing more than the divine feeling of the gorgon using your cock, and her wonderful breasts rubbing and cuddling into you as she makes deliberate movements to ensure you are smothered by them with every move of her hips.",
									"PlayerOrgasm", "1",
									"This time, you manage to raise your arms, and you embrace Euryale, who coos lovingly in response, smothering your head a little more between her ample cleavage in order to pleasure you even further. Another rope of cum leaves your sensitive cock, causing the gorgon to moan in delight.",
									"PlayerOrgasm", "1",
									"Her tail sways happily from side to side as she milks cumshot after cumshot from you, keeping your weakened and vulnerable body comfortably pinned under her all the way through, letting you nuzzle her tits and indulge in the softness of her large body.",
									"PlayerOrgasm", "1",
									"You groan, fatigued and barely conscious, as your magically-sensitized body pumps one more load into the gorgon's tight ass, who presses herself into you, ensuring not a drop escapes her. Your Recall Stone begins to activate, and Euryale finally stops, bringing a hand over to your hair and gently caressing it.",
									"Speaks",
									"Oooh...♥ So much delicious cum... You're such a good boy...♥",
									"You murmur happily in response as Euryale cuddles with you, keeping you trapped under her soft and warm body until your Stone finally takes you away, though your body longs for more of the loving gorgon's sweet touch and gentle praise...",
                                    "ChangeFetish", "Ass", "5",
									"ChangeFetish", "Breasts", "5",
									"ChangeSensitivity", "Sex", "5",
									"ChangeSensitivity", "Magic", "10"
                                  ],
                        "picture": ""
                    }
                  ],
    "combatDialogue": [
                       {
                            "lineTrigger": "SetMusicTo",
                            "move": "",
                            "theText": [ "music/Battle/sakka.mp3"]
                        },
					   {
                            "lineTrigger": "HitWith",
                            "move": "Spank",
                            "theText": [ "Her large butt jiggles from your slap.",
                                        "'Enjoying yourself, mhm?'",
                                        "'You'll need more than to conquer a gorgon.♪'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Whip",
                          "theText": [ "'Hmpf.'",
                                      "'Tch. Stop it.' Her snake hair glares at you in anger.",
                                      "'I'm not into that sort of thing.'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Demon Layer",
                          "theText": [ "'Awawa! Is that h-holy magic?!♥'",
                                      "'Mmmm!♥ F-Feels different!'",
                                      "'Aaauuh!♥ Such potent and unusual magic!'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Holy Headpat",
                          "theText": [ "She looks at you with a flustered expression while her snakes rub themselves into your hand.",
                                    "'Cutie.♥ I'll eat you up for that.♥'" ]
                        },
						{
                          "lineTrigger": "HitWith",
                          "move": "Analyze",
                          "theText": [ "My eyes are up here.♥",
                                    "'Mhmhm, curious little boy.♥'" ]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Bondage Net", "Magical Binding"],
                          "theText": [ "She struggles slightly but doesn't look particularly worried!",
                                      "'Mhmhm.♪ How long do you think you can hold me?'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Pin",
                          "theText": [ "'My my. So eager...♥'",
                                      "'Mhm. Try and hold me down.♥'",
                                      "'Can't hold yourself back? Mhmhmhm.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Lewd Bottle", "Cloying Mist", "Placebo Pheromone"],
                          "theText": [ "'My my, it's getting a bit hard to think straight.♥'",
                                      "'You don't want to make even more hot and bothered, if you value your safety.♥'"]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Electrify",
                            "theText": [ "'Mmm. Not bad. But you have room for improvement yet.'",
                                        "'I almost felt that.♪'",
                                        "'Her snake hair goes wild for a second before rearranging itself back to normal.'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Finger",
                          "theText": [ "'Mmmmhmhm.♥'",
                                      "'Are you going to keep teasing me?♥'",
                                      "'Good boy.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Dildo",
                          "theText": [ "'Scared of using the real thing?♪'",
                                      "'Mmm. Decently-sized.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Grope Ass",
                          "theText": [ "'Do you like my ass, mhm?♥'",
                                      "She hums in satisfaction as you grope her.",
                                      "'Keep going...♥'",
                                      "'Mmmh!♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Squeeze Ass", "Massage Ass", "Fondle Ass"],
                          "theText": [ "She moans out loud and shakes her ass a bit, encouraging you to continue.",
                                      "'Mhmm... Good boy...♥'",
                                      "'Yes...♥ My ass could use a massage like this...♥'",
                                      "'I bet you want me to sit on you, mhm.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Breast Caress",
                          "theText": [ "'Ahhh...♥'",
                                      "'They're all yours, sweetie.♥'",
                                      "'What skilled hands, mhmhm.♥'",
                                      "'Oooh...♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Breast Massage", "Breast Knead", "Breast Fondle"],
                          "theText": [ "'Mmm.♥ Yes, do it more...♥'",
                                      "'Are you falling for my breasts, mhm?♥'",
                                      "She places her hands over yours, encouraging you to keep grabbing them.",
                                      "'Mmmmmm!♥ I love it...♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Suckle",
                          "theText": [ "'Mhmhm. Cutie.♥'",
                                      "'Suckle all you want, I love it.♥'",
                                      "'Make sure to use your tongue.♥'",
                                      "'Aahhh... Such a good boy...♥'"]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Penetrate",
                            "theText": [ "'Mmm!♥ Come on, then!'",
                                        "'Make sure to let out a thick load inside me when you lose.♪'",
                                        "'Are you sure you can handle me? Mmhmhm.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Thrust", "Channeling Thrust"],
                          "theText": [ "'Mmmm! Yes! More!♥'",
                                      "'Move those hips, mmm, cutie!♥'",
                                      "'Oooh!♥ Mmmmm!'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Pound", "Multi Thrust", "Empowered Thrust", "Carrying Fuck"],
                          "theText": [ "'Ooooh! OOH!♥ S-So rough!♥'",
                                      "'S-Such an eager boy! Ooooooh!♥",
                                      "'Yes! Harder! Conquer me!♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Tantric Thrust", "Passionate Lovemaking"],
                          "theText": [
                                      "'Ooooh...♥ C-Cutie...!♥",
                                      "'Aaah... You absolute cute...♥ I'll eat you up for this.♥'",
                                      "'S-Such a good boy... Are you trying to make me fall for you?♥'",
                                      "'Mmmmm.♥ You're such a sweetheart...♥'"]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Anal Penetration",
                            "theText": [ "'Mmm!♥ Come on, then!'",
                                        "'Are you sure you can handle me? Mmhmhm.♥'",
                                        "'You're not getting out of there anytime soon now.♪'"]
                        },
                        {
                          "lineTrigger": "HitWithA",
                          "move": ["Thrust", "Channeling Thrust"],
                          "theText": [ "'Mmmm! Yes! More!♥'",
                                      "'Move those hips, mmm, cutie!♥'",
									  "'Do you like watching my tail sway?'",
                                      "'Oooh!♥ Mmmmm!'"]
                        },
                        {
                          "lineTrigger": "HitWithA",
                          "move": ["Pound", "Multi Thrust", "Empowered Thrust", "Carrying Fuck", "Anal Piston"],
                          "theText": [ "'Ooooh! OOH!♥ S-So rough!♥'",
                                      "'S-Such an eager boy! Ooooooh!♥",
                                      "'Yes! Harder! Conquer me!♥'"]
                        },
                        {
                          "lineTrigger": "HitWithA",
                          "move": ["Tantric Thrust", "Passionate Lovemaking"],
                          "theText": ["'Ooooh...♥ C-Cutie...!♥",
                                      "'Aaah... You absolute cute...♥ I'll eat you up for this.♥'",
                                      "'S-Such a good boy... Are you trying to make me fall for you?♥'",
                                      "'Mmmmm.♥ You're such a sweetheart...♥'"]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Ear Tease",
                            "theText": [ "She closes her eyes and blushes furiously.",
                                        "'Oooh! Mmmm, that's not fair, cutie!♥'",
                                        "'Mmm!♥ Don't tease my ear...!♥' She doesn't sound very convincing.",
                                        "'Mhmhmhmhm!♥ You're making me feel all tingly!'"]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Make Out",
                            "theText": [ "'You want my snakey kissies?♥ I'll be happy to oblige...'",
                                        "'Mhm. Big mistake.♥'",
                                        "'I'm gonna smooch you until you're a little pleasured pile.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Charm", "Charm Wave"],
                          "theText": [ "'Y-You're so cute... I'm going to pamper you.♥♥♥'",
                                      "'I want your cum...♥ I want it bad!♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Sleep",
                          "theText": [ "'Naughty boy... Trying to make me helpless...? Mmmhmhm.♥'"
                                      ]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Enfeeble", "Sensitize"],
                          "theText": [ "'Hmmm. A sensible strategy.'",
                                      "'Don't think that'll save you.♥'",
                                      "'Ooh, how uncomfortable... But I can take it.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Disarming Appeal"],
                          "theText": [ "'Don't be afraid, cutie. I'm not going to hurt you, just make you feel good.♥'",
                                      "'I guess I can slow down a little bit, if it makes you more comfortable, mhm.'",
                                      "'Don't worry, cutie. I want this to be fun for us both.♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Arouse", "Arousara", "Arousero"],
                          "theText": [ "She shrugs off most of the attack with a smug smirk.",
                                      "'Magic isn't a great weapon against a magical being like me, mhmhm.'",
                                      "'Tingly. But you'll need more than that.'",
                                      "'Nice try, cutie.♥ But you have much to learn.'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Seduce", "Enamor", "Smoldering Seduction", "Smoldering Flaunt", "Massaging Seduction", "Mass Seduction"],
                          "theText": [ "Her cheeks turn red as she lets out an excited giggle.",
                                      "'C-Cutie! Don't tease me!♥'",
                                      "'Such a sweet young man... You're making me fall for you.♥'",
                                      "'Mmmm! Tease me more, cutie...♥'"]
                        },
						{
                          "lineTrigger": "HitWith",
                          "move": "Face Fuck",
                          "theText": [ "She moans out in delight as you thrust your cock in her mouth.",
                                      "'Mph!♥ Mph!♥'",
                                      "'Mmmhm!!♥♥♥'"]
                        },



						{
                            "lineTrigger": "UsesMove",
                            "move": "Gorgon's Arousing Spell",
                            "theText": [ "'Behold my magic, mhm.'",
                                        "'Can you withstand a gorgon's spellcasting?'",
                                        "'Sexual incantation.♥'"]
                        },
						{
                            "lineTrigger": "UsesMove",
                            "move": "Gorgon's Delibitating Spell",
                            "theText": [ "'You won't last long.♥'",
                                        "'Hold still!'"]
                        },
						{
                            "lineTrigger": "UsesMove",
                            "move": "Toga Teasing",
                            "theText": [ "'Like what you see?♥'",
                                        "'Mhmhm, imagine your face shoved right here...♥'",
										"'Mmmm. Come and get me, cutie.♥'"]
                        },
						{
                            "lineTrigger": "UsesMove",
                            "move": "Gorgon's Cock Worship",
                            "theText": [ "'Mmmmmmmhmhm....♥♥♥'",
                                        "'Delicious, mhm...♥'",
                                        "'I'll love your cock all over...♥♥'"]
                        },
						{
                            "lineTrigger": "UsesMove",
                            "move": "Snakey Kissie Assault",
                            "theText": [ "'Get him, girls.♥'",
                                        "'You're ours.♥'",
                                        "'My girls are hungry too.♥'",
                                        "'Your face belongs to our smooches.♥'"]
                        },
						{
                            "lineTrigger": "UsesMove",
                            "move": "Gorgon's Loving Smooching",
                            "theText": [ "'Mmmm.♥ Chu. Chu.♥'",
                                        "'I'll mark you as mine.♥'",
                                        "'Give in to me...♥'"]
                        },
						{
                            "lineTrigger": "UsesMove",
                            "move": "Gorgon's Eager Fucking",
                            "theText": [ "'Mmmhm! Do you want to spurt inside me?♥'",
                                        "'Move, mmmm, those hips!♥",
                                        "'Indulge yourself in me, cutie.♥'"]
                        },
						{
                            "lineTrigger": "UsesMove",
                            "move": "Gorgon's Leg Lock",
                            "theText": [ "'I'll not let you leave.♥'",
                                        "'I want, mmm, a thick load inside me!♥",
                                        "'Don't you want to thrust until you conquer me?♥'"]
                        },
                        {
                            "lineTrigger": "LowHealth",
                            "move": "",
                            "theText": [ "'H-Have I underestimate you, cutie?♥'",
                                      "'I can't take much more of you...'♥"]
                        },
                        {
                            "lineTrigger": "PlayerLowHealth",
                            "move": "",
                            "theText": [ "'Look at that cute cock throbbing, desperate to release...'♥",
							             "'Don't hold back, sweetie. Just let it all out for me.♥'"]
                        },
						{
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Sex",
                            "theText": [ "You moan out as Euryale's warm pussy devours your whole erection with ease, the gorgon licking her lips excitedly as she feels you approach your climax. You let out a thick load into her womb, and she giggles out in excitement as you tremble and squirm from the pleasure.",
                                        "You moan desperately as you piston your cock into the gorgon's exquisite pussy, and she clamps down tighty into you, milking out your cum as you unload it into her. 'Mmmmmhmm... Good boy...♥'",
                                        "Euryale throws all of her weight down at you, leaving you pinned and helpless as she rides your cock incessantly, only slowing down once she feels you release your seed deep inside her, a smug smile upon her lips as she trails her forked tongue over them."
                                      ]
                        },
                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Anal",
                            "theText": [ "You moan out as Euryale's thick ass devours your whole erection with ease, the gorgon licking her lips excitedly as she feels you approach your climax. You let out a thick load into her anus, and she giggles out in excitement as you tremble and squirm from the pleasure.",
                                        "You moan desperately as you piston your cock into the gorgon's exquisite rear, and she clamps down tighty into you, milking out your cum as you unload it into her. 'Mmmmmhmm... Good boy...♥'",
                                        "Euryale throws all of her weight down at you, leaving you pinned and helpless as she rides your cock incessantly, only slowing down once she feels you release your seed deep inside her, a smug smile upon her lips as she trails her forked tongue over them."
                                      ]
                        },
						{
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Blowjob",
                            "theText": [ "You moan in delight as Euryale pumps on your cock with her mouth, the gorgon wrapping her arms around your waist and bringing you close, causing you to cum right down her throat. She swallows it all with a happy hum, licking your tip in sweet praise.",
                                        "Euryale allows your cock out of her mouth only for it to be assaulted by her snake-hair. They flick their little tongues all over shaft, and the strange and unusual sensation sends you over the edge, a spurt of cum shooting out and causing the serpents to immediately retreat.",
                                        "The gorgon hums contently as she slows down her movements, her hand reaching down to grasp and lovingly massage your testicles, as if encouraging you to produce more cum for her. Soon, you find yourself shoot straight down her naughty throat, and she gasps in delight as she gives your balls a final fondling."
                                      ]
                        },
						{
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Making Out",
                            "theText": [ "You moan in Euryale's mouth as she skillfully wraps her tongue around yours, and your cock throbs in desperate need for release, unable to resist her advances. She giggles as you let out a load of cum, before returning to her kissing session.",
                                        "Euryale starts smooching you all over, leaving your face filled with black lipstick marks while your cock leaks pre-cum, eager to release. She gives it a gentle caress with one finger, and that's enough for you to let out a powerful load as you feel a wave of pleasure tingle through your spine.",
                                        "Your face is assalted by a veritable horde of snakes who begin peppering you with little kisses while Euryale gives your cheeks long licks. Their advances are soon too much for you to withstand and you cum out eagerly for the naughty serpents and their mistress."
                                      ]
                        },
						{
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "",
                            "theText": [ "Unable to resist, you let out a spurt of cum, and Euryale watches intently, licking her lips slowly and sensually. 'Mhmmm. Don't cum on the floor, that's just a waste.♥'",
                                       "'Mhm, don't hold back, just let it all out.♥' Incapable of resisting her advances, you let you a thick rope of cum, and Euryale giggles mischievously as she watches your face contort from pleasure."
                                      ]
                        },
                        {
                            "lineTrigger": "onOrgasm",
                            "move": "",
                            "theText": [ "Ooooh!♥ I submit!! MMMMMM!'♥♥♥",
                                        "'S-Such a good boyyyyEEEEK!!!♥♥♥"
                                      ]
                        },
                        {
                            "lineTrigger": "OnSurrender",
                            "move": "",
                            "theText": [ "'Aww, too tired to go on, cutie? It's alright, I'm gonna make you feel super good now.♥'",
							             "'Yes, stop resisting... I'll show you true pleasure.♥'"]
                        },
						{
                            "lineTrigger": "StanceStruggle",
                            "move": "Sex",
                            "theText": [ "{ThePlayerName} tries to pull out of the {AttackerName}'s tight pussy..."]
                        },
                        {
                            "lineTrigger": "StanceStruggleFail",
                            "move": "Sex",
                            "theText": [ "But the gorgon's eyes flash a bit, and you feel your body stiffen for a moment, keeping you locked in place!",
                                        "But Euryale's tail wraps aroung your waist and presses you deeper into her instead!",
                                        "But Euryale clings up to you, and you can't get her to stop riding your stiff erection!",
                                        "But the gorgon slams her hips into you with surprising force, keeping you tightly locked in place!",
                                        "But the gorgon lets out a cute whine, and you can't help but continuing thrusting your cock into her!"]
                        },
                        {
                            "lineTrigger": "StanceStruggleComment",
                            "move": "Sex",
                            "theText": [ "'Mmm. No stopping now.♥'",
                                        "'Wanting to stop so soon? But you're enjoying yourself so much...♥'",
                                        "'Stop resisting, mmhmhm.♥'",
                                        "'Mmm!♥ Fuck me more...♥'",
                                        "'Nu-huh. Your cock is right where it belongs right now.♥'"]
                        },
                        {
                            "lineTrigger": "StanceStruggleFree",
                            "move": "Sex",
                            "theText": [ "And manage to pull your cock out of her tight slit!"]
                        },
                        {
                            "lineTrigger": "StanceStruggleFreeComment",
                            "move": "Sex",
                            "theText": [ "'Mmm. Why stop? You were making such a cute face.♪'",
                                      "'My my, so pent up... We have to do something about that.♥'",
                                      "Now, where do you think you're going, hm?'",
                                      "'Naughty. I'll have to punish you for that.♥'",
                                      "'Don't pretend you don't want more, mhmhmhm.♥'"]
                        },
                        {
                            "lineTrigger": "StanceStruggle",
                            "move": "Anal",
                            "theText": [ "{ThePlayerName} tries to pull out of the {AttackerName}'s tight ass..."]
                        },
                        {
                            "lineTrigger": "StanceStruggleFail",
                            "move": "Anal",
                            "theText": [ "But the gorgon's eyes flash a bit, and you feel your body stiffen for a moment, keeping you locked in place!",
                                        "But Euryale's tail wraps aroung your waist and presses you deeper into her instead!",
                                        "But Euryale clings up to you, and you can't get her to stop riding your stiff erection!",
                                        "But the gorgon slams her hips into you with surprising force, keeping you tightly locked in place!",
                                        "But the gorgon lets out a cute whine, and you can't help but continuing thrusting your cock into her!"]
                        },
                        {
                            "lineTrigger": "StanceStruggleComment",
                            "move": "Anal",
                            "theText": [ "'Mmm. No stopping now.♥'",
                                        "'Wanting to stop so soon? But you're enjoying yourself so much...♥'",
                                        "'Stop resisting, mmhmhm.♥'",
                                        "'Mmm!♥ Fuck me more...♥'",
                                        "'Nu-huh. Your cock is right where it belongs right now.♥'"]
                        },
                        {
                            "lineTrigger": "StanceStruggleFree",
                            "move": "Anal",
                            "theText": [ "And manage to pull your cock out of her tight rear!"]
                        },
                        {
                            "lineTrigger": "StanceStruggleFreeComment",
                            "move": "Anal",
                            "theText": [ "'Mmm. Why stop? You were making such a cute face.♪'",
                                      "'My my, so pent up... We have to do something about that.♥'",
                                      "Now, where do you think you're going, hm?'",
                                      "'Naughty. I'll have to punish you for that.♥'",
                                      "'Don't pretend you don't want more, mhmhmhm.♥'"]
                        },
                        {
                            "lineTrigger": "StanceStruggle",
                            "move": "Making Out",
                            "theText": [ "{ThePlayerName} tries to break the deep kiss with the gorgon..."]
                        },
                        {
                            "lineTrigger": "StanceStruggleFail",
                            "move": "Making Out",
                            "theText": [ "But she brings a hand to your hair and starts lovingly caressing you, and you can't help but want more of her affection!",
                                        "But she moans in your kiss, pressing her body into yours and leaving your tongue tightly locked around hers!",
										"But her snake-hair lungers forward and peppers you in small kisses, leaving you too kiss-drunk to back out!"]
                        },
                        {
                            "lineTrigger": "StanceStruggleComment",
                            "move": "Making Out",
                            "theText": [ "'You stay - chu - right - chu - where you are.♥'",
                                        "Her snake-hair flicks their tongues all over you playfully."]
                        },
                        {
                            "lineTrigger": "StanceStruggleFree",
                            "move": "Making Out",
                            "theText": [ "And manage to push the lusty gorgon away!",
                                      "And free your mouth from the gorgon's soft black lips!"]
                        },
                        {
                            "lineTrigger": "StanceStruggleFreeComment",
                            "move": "Making Out",
                            "theText": [ "She licks her own lips very suggestively.",
                                      "'Don't pretend you don't want my lipstick all over you, mhmhm.♥'",
                                      "'Naughty boy. I'll have to kiss you senseless for that.♥'"]
                        },
						{
                            "lineTrigger": "StanceStruggle",
                            "move": "Blowjob",
                            "theText": [ "{ThePlayerName} tries to get Euryale's mouth out of his cock..."]
                        },
						{
                            "lineTrigger": "StanceStruggleFail",
                            "move": "Blowjob",
                            "theText": [ "But she wraps her arms around your waist and presses you deeper into her throat instead!",
                                        "But her snake-hair reaches forward and tickles your crotch with their tongues, leaving you distracted and flustered!",
										"But she wraps her tongue around your cock over and over, and the pleasure is too good for you to stop it!"]
                        },
                        {
                            "lineTrigger": "StanceStruggleComment",
                            "move": "Blowjob",
                            "theText": [ "'Nu-huh.♥' She giggles mischievous with your cock in her mouth.",
                                        "'Don't struggle and let me eat you up. You know you're loving it.♥'."]
                        },
						{
                            "lineTrigger": "StanceStruggleFree",
                            "move": "Blowjob",
                            "theText": [ "And manage to push her away from it!",
                                      "And manage to break free of her prison of black lipstick!"]
                        },
						{
                            "lineTrigger": "StanceStruggleFreeComment",
                            "move": "Blowjob",
                            "theText": [ "'Aw, but you were squirming in such a cute way...♥'",
                                      "'Why resist? You know you want me to eat you up.♥'",
                                      "'Naughty boy. I'll have to suck you dry for that.♥'"]
                        }
                      ],
  "victoryScenes": [
            {
                "NameOfScene": "",
                "move": "",
                "stance": "",
                "includes": [ ""],
                "theScene": [ ""
                          ],
                "picture": ""
            }
        ],
        "pictures": [
                      {
                          "Name": "None",
                          "StartOn": "1",
                          "AlwaysOn": "1",
                          "IsScene": "0",
                          "TheBody": "1",
                          "Overlay": "No",
                          "setXalign": "0.0",
                          "setYalign": "0.0",
                          "Images": [
                          {
                              "Name": "None",
                              "File": "",
                              "setXalign": "0.0",
                              "setYalign": "0.0"
                          }
                        ]
                      }
                    ]
}
