{
    "name": "Automaton Defeated",
    "CardType": "",
    "CardLimit": "0",
    "Description": "",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Automaton",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene": [  "DisplayCharacters",
                                      "1",
                                      "EndLoop",
                                      "Menu",
                                        "Roughly dominate her pussy!",
                                        "Use her mouth!",
                                        "Leave.",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Roughly dominate her pussy!",
                        "theScene": [
                                      "ChangeArousalQuietly",
                                      "25",
                                      "You turn the Automaton around, making her lie on her front as you rest her upper body over a large flat stone, positioning her arms straight out over it. You raise her curvy rear up to your waist, and free your erect, throbbing cock out of the confines of your pants.",
                                      "ChangeArousalQuietly",
                                      "35",
                                      "You then grab a hold of her hips before plunging into the depths of her tight pussy in one powerful stroke, the sensation of penetration just strong enough to send shivers throughout your body as you involuntarily let out a moan.",
                                      "ChangeArousalQuietly",
                                      "25",
                                      "You begin building up to a good tempo, her body reacting to your strokes as it secretes lubricant with your every thrust despite, the automaton's lack of consciousness.",
                                      "ChangeArousalQuietly",
                                      "50",
                                      "You switch to slower, deeper strokes, digging into her flesh and building up pleasure until you hit her artificial womb causing her vaginal tunnel to close in on your dick giving it a tight squeeze as your entire body cries out in bliss from the feedback.",
                                      "ChangeArousalQuietly",
                                      "70",
                                      "Now with a goal in mind, you decide to pick up the pace, rapidly thrusting deep into her, maximizing your pleasure as you stretch out her stomach, causing a visible bulge to appear everytime you squish her pliant womb.", 
                                      "ChangeArousalQuietly",
                                      "90",
                                      "You press her head down on the rock in an attempt to steady her body as her arms fall off the rock and swing along to your violent movements.",
                                      "ChangeArousalQuietly",
                                      "120",
                                      "You continue to pound into her exquisite pussy, until, sensing the end of your rope, you grab her throat, choking the Automaton's lifeless body with both hands, as her body automatically reacts by having her orifice squeeze even harder making you reach new heights of pleasure.", 
                                      "PlayerOrgasmNoSpiritLoss",
                                      "You unload a huge deposit of cum directly into her womb as your body quivers and mind mommentarily blacks out from your powerful orgasm.",
                                      "You shoot load, after load, after LOAD, as you slowly drift back into consciousness. Through your foggy, haze filled, brain you slowly bring yourself to pull out of the Automaton, but notice a resistance, feeling something latching on to the tip of your cock.",
                                      "You pull and pull, making several attempts to free yourself, until with one final powerful pull, you suceed and in the process, effectively pulling out her womb as it dangles out of her pussy as the large quantity of semen you deposited flows out.",
                                      "You feel confused for a momment from the surprisingly excess amount of cum leaking out, before slowly realizing that the unconscious Automaton never absorbed any of it at all.",
                                      "JumpToScene",
                                      "Fucked her silly"

                                  ]
                    },
                    
                    {
                        "NameOfScene": "Use her mouth!",
                        "theScene": [ 
                                        "ChangeArousalByPercent",
                                        "25",
                                        "You hold the Automaton's lifeless body, picking it up and carrying it over to a wall and prop her up, readjusting her criss crossed limbs and tilted head. You theatrically unbutton your pants, slowly pulling down your zipper and revealing your throbbing, twitching cock!",
                                        "ChangeArousalByPercent",
                                        "35",
                                        "You grab her head and carefully insert your cock into her currently vaccant mouth, raising her head backwards as you slowly descend. Pushing inch by inch into her throat, until you manage to insert your whole length down her throat as you manually close her lips, creating a seal as her lips touch the base of your crotch.",
                                        "ChangeArousalQuietly",
                                        "35",
                                        "You indulge in her unconscious body as you press your thumbs into the sides of her cheeks, feeling your shaft through the skin of her face.",
                                        "ChangeArousalQuietly",
                                        "50",
                                        "You begin to thrust into her as the mini rollers lining her mouth do their job, helping you descend faster down into her narrow throat as well as rise up faster for another thrust.",
                                        "ChangeArousalQuietly",
                                        "70",
                                        "You start to get a hang of her roller's textures, as you gradually build up momentum to increase the intensity of your thrusts.",
                                        "ChangeArousalQuietly",
                                        "90",
                                        "Your grab a tight hold of the Automaton's hair, using it as leverage to prop up her head, giving you more space for larger strokes and vary up your thrusts.",
                                        "PlayerOrgasmNoSpiritLoss",
                                        "You grab the Automaton's neck wrapping both of your hands along it's length and making it clamp down on your cock, the squeezing sensation just enough to push you over the edge and reach climax, as your whole body quivers as you spurt your cum down her throat.",
                                        "Your orgasm temporarily makes you blackout, causing you to release your hold of the Automaaton's throat and making her release your cock as her body slides down and colapses on the ground.",
                                        "All the while you continue to shoot your load. Marking the Automaon's body in layers of your cum as your orgasm gradually subsides, leaving you with a slackened blissful expression on your face.",
                                        "You comedown from your lust induced high, groggily pulling your cock out of the Automaton's gullet.",

                                        "JumpToScene",
                                        "Fucked her silly"
                                  ]
                    },
                    
                    {
                        "NameOfScene": "Leave.",
                        "theScene": [
                                      "You decide to leave the out of comission robo-girl alone to complete her recall protocol. As you stand up and turn around, heading on your way, as you hear sound of the Automaton's countdown gradually growing softer and softer until the atmosphere ounce again becomes silent. Continuing on your journey.",
                                      "DisplayCharacters",
                                      "EndLoop",
                                      "JumpToScene","Item Drop"
                                      
                                  ]
                    },
                    
                    {
                        "NameOfScene": "Fucked her silly",
                        "theScene": [   
                                      "With your lust now sated, you let go of the Automaton as it crashes sideways with her defiled lifeless body on the ground.",
                                        "DisplayCharacters",
                                        "EndLoop",
                                        "As you stare at your own handiwork, you take your time cleaning yourself up, before getting up and turning around. Walking away as the Automaton finally fades away, leaving you to continue onwards on your journey .",
                                        "JumpToScene","Item Drop",
                                        "AdvanceTime", "1"
                                  ]
                    },
                    {
                      "NameOfScene": "Item Drop",
                      "theScene": [   
                                    "JumpToRandomScene",
                                      "Give Head",
                                      "Give Torso",
                                      "Give L Arm",
                                      "Give R Arm",
                                      "Give L Leg",
                                      "Give R Leg",
                                      "Give None",
                                      "Give None",
                                      "Give None",
                                      "Give None",
                                    "EndLoop"
                                ]
                    },
                    {
                      "NameOfScene": "Give Head",
                      "theScene": [   
                                    "GiveItem", "1", "Damaged Automaton Head Parts"
                                ]
                    },
                    {
                      "NameOfScene": "Give L Arm",
                      "theScene": [   
                                    "GiveItem", "1", "Damaged Automaton Left Arm Parts"
                                ]
                    },
                    {
                      "NameOfScene": "Give R Arm",
                      "theScene": [   
                                    "GiveItem", "1", "Damaged Automaton Right Arm Parts"
                                ]
                    },
                    {
                      "NameOfScene": "Give Torso",
                      "theScene": [   
                                    "GiveItem", "1", "Damaged Automaton Torso Parts"
                                ]
                    },
                    {
                      "NameOfScene": "Give L Leg",
                      "theScene": [   
                                    "GiveItem", "1", "Damaged Automaton Left Leg Parts"
                                ]
                    },
                    {
                      "NameOfScene": "Give R Leg",
                      "theScene": [   
                                    "GiveItem", "1", "Damaged Automaton Right Leg Parts"
                                ]
                    },
                    {
                      "NameOfScene": "Give None",
                      "theScene": [   
                                    ""
                                ]
                    }
                  ]
}
